L01_V04-ProductoDeUnVectorPorUnEscalar.org
#+TITLE: Lección 1 del curso - Vídeo 4
#+AUTHOR: Marcos Bujosa
#+LANGUAGE: es
#+STARTUP: show4levels

#+LaTeX_HEADER: \usepackage{nacal}
#+LATEX_HEADER: \usepackage[spanish]{babel}
#+LaTeX_HEADER: \usepackage{pdfpages}
#+LATEX_HEADER: \usepackage{fontspec}

# Para que no ejecute todo el código al exportar a pdf
#+PROPERTY: header-args :eval never-export

#+LATEX: \maketitle

*** COMMENT Ajustes para la compilación de la documentación
#+CALL: NombreEnChunksDeCodigo()
#+NAME: NombreEnChunksDeCodigo
#+BEGIN_SRC emacs-lisp :results silent
(setq org-babel-exp-code-template
         (concat "\n#+ATTR_LATEX: :options label=%name\n"
              org-babel-exp-code-template)
               )
#+END_SRC


* Producto de un vectores de $\mathbb{R}^n$ por un escalar - Vídeo 04


