L01_V04-ProductoDeUnVectorPorUnEscalar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2025-02-22 sáb 20:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lección 1 del curso - Vídeo 4</title>
<meta name="author" content="Marcos Bujosa" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Lección 1 del curso - Vídeo 4</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3cada4b">1. Producto de un vectores de \(\mathbb{R}^n\) por un escalar - Vídeo 04</a>
<ul>
<li><a href="#org9ff8e44">1.1. Escena 1 - Producto de vectores de de \(\mathbb{R}^n\) por escalares</a></li>
<li><a href="#orgb15b133">1.2. Escena 2 - Interpretación geométrica del producto de números</a></li>
<li><a href="#org702ea04">1.3. Escena 3 - Interpretación geométrica del producto de vectores de de \(\mathbb{R}^2\)</a></li>
<li><a href="#org76fb258">1.4. Escena 4 - Interpretación geométrica del producto de tres números (3D)</a>
<ul>
<li><a href="#org6f84c31">1.4.1. Escena 3D</a></li>
</ul>
</li>
<li><a href="#orgf197b98">1.5. Escena 4 - Interpretación geométrica del producto de tres números (explicación)</a></li>
<li><a href="#org03d8bcc">1.6. Escena 5 - Interpretación geométrica del producto por escalares en de \(\mathbb{R}^3\) (3D)</a>
<ul>
<li><a href="#org223b840">1.6.1. Escena 3D</a></li>
</ul>
</li>
<li><a href="#org13f53aa">1.7. Escena 5 - Interpretación geométrica del producto por escalares en de \(\mathbb{R}^3\) (explicación)</a></li>
</ul>
</li>
<li><a href="#org790e522">2. Trozos comunes de código</a>
<ul>
<li><a href="#org834f41e">2.1. Carga de la librería Manim y NacAL</a></li>
<li><a href="#org3ec92df">Definición de algunas subclases con definiciones generales</a>
<ul>
<li><a href="#org8dfedca">Definición Vectores en R2 y R3</a></li>
<li><a href="#orgb7a6c6e">Insertar un vídeo en una escena</a></li>
<li><a href="#orgef83ad2">Mover miniescenas a un subdirectorio auxiliar</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org2316e75">3. Rodando: 1,2,3&hellip; ¡acción!</a></li>
</ul>
</div>
</div>
<div id="outline-container-org3cada4b" class="outline-2">
<h2 id="org3cada4b"><span class="section-number-2">1.</span> Producto de un vectores de \(\mathbb{R}^n\) por un escalar - Vídeo 04</h2>
<div class="outline-text-2" id="text-1">
</div>
