L01_V04-ProductoDeUnVectorPorUnEscalar.org
** Escena 1 - Producto de vectores de de $\mathbb{R}^n$ por escalares 

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="1")
# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="1")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E01_ProductoPorEscalares.mp4]]

# Añadir esto tras <<Definición de mi escena con voz>>
# <<Obtención de subíndices de caracteres en expresiones>>
# para obtener los índices de los elementos de una cadena de texto

#+name: L01_V04_E01_ProductoPorEscalares
#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V04_ProductoDeUnVectorPorUnEscalar.py
<<Carga de la librería Manim y NacAL con AzureService>>
#<<Carga de la librería Manim y NacAL>>
<<Definición de mi escena con voz>>
<<Definición de VectorR2>>
<<Definición de VectorR3>>
<<copyright>>

class L01_V04_E01_ProductoPorEscalares(MiEscenaConVoz):    
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )       
        #self.set_speech_service(GTTSService(lang="es", tld="com"))       
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"""\usepackage{nacal} """)

        self.creditos()
        
        # Portada
        titulo = Title(_("Producto de vectores de ") + r"\R[n]" + _("por escalares"),
                     tex_template = myTemplate,
                     font_size=70).set_color(BLUE)
        self.play(Write(titulo))
        self.pausa_media()
        self.play(FadeOut(titulo))
	
        operacionProducto = Tex(_("Producto por escalares"),
                         tex_template = myTemplate, font_size=70
                         ).to_edge(UP).set_color(BLUE)

        operacionDescripcion = Tex(_("El producto se define componente a componente."),
                         tex_template = myTemplate,
                         ).move_to([0,2.5,0]).to_edge(LEFT)
        # Ejemplos
        EjR3 = Tex(r"\textbf{" + _("Ejemplo en ") + r"\R[3]:}",
                 tex_template = myTemplate,
                 font_size=50).set_color(GREEN).next_to(operacionDescripcion, DOWN, aligned_edge=LEFT)

        EjR4 = Tex(r"\textbf{" + _("Ejemplo en ") + r"\R[4]:}",
                 tex_template = myTemplate,
                 font_size=50).set_color(GREEN).next_to(operacionDescripcion, DOWN, aligned_edge=LEFT)
        
        a    = 3
        b    = nc.Vector( [0, 1, 2])        
        s1 = MathTex(a,                tex_template = myTemplate,)
        por= MathTex(r"\cdot",         tex_template = myTemplate,)
        s3 = MathTex(b.latex(),        tex_template = myTemplate,)
        igual = MathTex(r"=",          tex_template = myTemplate,)
        s5 = MathTex((a*b).latex(),    tex_template = myTemplate,)
        grp1 = VGroup(s1,por,s3,igual,s5).arrange(RIGHT)
       
        with self.voiceover(text=_("""Además de sumar vectores,""")) as tracker:
            self.pausa_corta(tracker.duration)
            
        self.add(operacionProducto)
        self.add(operacionDescripcion)

        with self.voiceover(text=_("""también podemos reescalarlos, es decir, podemos multiplicarlos
        por algún escalar para obtener un múltiplo del vector original.""")) as tracker:
            self.add(EjR3)
            self.play(FadeIn(grp1[2]), run_time=tracker.duration/4)
            self.play(FadeIn(grp1[:2]), run_time=tracker.duration*3/4)

        with self.voiceover(text=_("""El resultado es otro vector que se define componente a
        componente.""")) as tracker:
            self.pausa_media()
            self.add(grp1[3])
            self.add(grp1[4][0][:2])
            self.add(grp1[4][0][-2:])

        with self.voiceover(text=_("""La primera componente del múltiplo es el producto del escalar
        por la primera componente del vector.""")) as tracker:
            self.play(FadeIn(grp1[4][0][2]), run_time=tracker.duration/3)
            self.play(Circumscribe(grp1[0]),
                      Circumscribe(grp1[2][0][2]),
                      Indicate(grp1[4][0][2]),                      
                      run_time=tracker.duration*2/3)
            self.pausa_corta()
            
        with self.voiceover(text=_("""De manera similar se calculan tanto la segunda
        componente, como las restantes componentes del múltiplo del vector.""")) as tracker:
            self.play(FadeIn(grp1[4][0][3]), run_time=tracker.duration/3)
            self.play(Circumscribe(grp1[0]),
                      Circumscribe(grp1[2][0][3]),
                      Indicate(grp1[4][0][3]),
                      run_time=tracker.duration/3)
            self.play(FadeIn(grp1[4][0][4]),
                      run_time=tracker.duration/6)
            self.play(Circumscribe(grp1[0]),
                      Circumscribe(grp1[2][0][4]),
                      Indicate(grp1[4][0][4]),
                      run_time=tracker.duration/3 )
            self.pausa_muy_corta()
            self.play(FadeOut(grp1))

        escalar = sp.symbols('\lambda')
        vga = MathTex(escalar, tex_template = myTemplate)
        
        v_generico_b  = nc.Vector(sp.symbols('b:5')[1:])
        vgb = MathTex(v_generico_b.latex(), tex_template = myTemplate)

        vgab = MathTex((escalar * v_generico_b).latex(), tex_template = myTemplate)

        grp2 = VGroup(vga,por,vgb,igual,vgab).arrange(RIGHT)
        with self.voiceover(text=_("""Así, la siguiente expresión describe
        el producto de un vector de R 4 por un escalar.""")) as tracker:
            self.play(FadeTransform(EjR3,EjR4))
            self.play(FadeIn(grp2))
            self.pausa()

        with self.voiceover(text=_("""Lo habitual es simplificar la notación,
        omitiendo el punto que denota la operación producto""")) as tracker:
            self.pausa(tracker.duration/3)
            self.play(FadeOut(grp2[1]),
                      grp2[0].animate.move_to(grp2[1]),
                      run_time=2*tracker.duration/3)
            self.pausa_muy_corta()
            
        with self.voiceover(text=_("""Como en el caso de la suma,""")) as tracker:
            self.pausa(tracker.duration)

        with self.voiceover(text=_("""para definir la operación en R n necesitamos una
        estrategia que no requiera escribir la lista de componentes. Recuerde que n puede
        ser muy grande.""")) as tracker:
            self.wait(tracker.duration/6)
            self.play(Indicate(vga[0][4:-4]),
                      Indicate(vgb[0][4:-4]),
                      Indicate(vgab[0][4:-4]),
                      run_time=2*tracker.duration/3)
            self.wait(1.5*tracker.duration/6)

        Defn = Tex(r"\textbf{" + _("Definición") + ":}",
                 tex_template = myTemplate,
                 font_size=50).set_color(RED).next_to(operacionDescripcion,
                                                      DOWN,
                                                      aligned_edge=LEFT)
        
        with self.voiceover(text=_("""Una alternativa es definir el producto usando el operador
        selector. Con ella podemos expresar""")) as tracker:
            self.play(FadeOut(grp2),
                      FadeOut(EjR4),
                      run_time=tracker.duration/3)
            self.add(Defn)

        cvab = MathTex(r"\elemRp{\lambda\Vect{a}}{i}", tex_template = myTemplate)
        cvb  = MathTex(r"\lambda\eleVRpE{a}{i}", tex_template = myTemplate)
        eq_suma = VGroup(cvab,igual,cvb).arrange(RIGHT).scale(1.5)
        
        donde = Tex(_("donde"))
        indices = MathTex(r"i=1:n", tex_template = myTemplate)
        pc_indices = VGroup(donde,indices).arrange(RIGHT, buff=1)
        grp3 = VGroup(eq_suma, pc_indices).arrange(RIGHT, buff=1)

        with self.voiceover(text=_("""que la i-ésima componente del
        múltiplo del vector es igual""")) as tracker:
            
            self.play(FadeIn(grp3[0][0],
                             scale=1.5,
                             rate_func=rate_functions.exponential_decay),
                      run_time=tracker.duration-1.5)            
            self.play(FadeIn(grp3[0][1],
                             scale=1.5,
                             rate_func=rate_functions.exponential_decay))

        with self.voiceover(text=_("""al escalar por la i-ésima
        componente del vector.""")) as tracker:

            self.play(FadeIn(grp3[0][2:],
                             scale=0.5,
                             rate_func=rate_functions.exponential_decay),
                      run_time=tracker.duration+0.2)

        with self.voiceover(text=_(r"""(donde el índice recorre los números naturales entre uno
        y n)""")) as tracker:
            self.play(FadeIn(grp3[1]))
            self.pausa_corta()

        with self.voiceover(text=_(r"""Esta definición abstracta  arroja una segunda regla de
        cálculo simbólico:""")) as tracker:
            self.pausa(tracker.duration*2/3)
            self.play(Indicate(eq_suma[0][0][0]),
                      Indicate(eq_suma[0][0][3]),
                      Indicate(eq_suma[2][0][1]),
                      Indicate(eq_suma[2][0][5]),
                      run_time=tracker.duration/3)
            self.pausa_muy_corta()

        with self.voiceover(text=_(r"""que la i-ésima componente del producto se puede sustituir por
        el producto del escalar por la i-ésima componente.""")) as tracker:            
            source0 = MathTex(r"\elemRp{\lambda\Vect{a}}{i}",
                              tex_template = myTemplate).next_to(grp3, DOWN, buff=1.2).scale(2)[0]
            target0 = MathTex(r"\lambda\eleVRpE{a}{i}",
                              tex_template = myTemplate).next_to(grp3, DOWN, buff=1.2).scale(2)[0]
            source1 = target0.copy()
            target1 = source0.copy()

            source2 = source0.copy()
            target2 = target0.copy()

            VG0 = VGroup(source0,target0)
            self.add(source0)
            transform_index0 = [[0,1,2,3,4,5],
                                [1,0,2,5,3,4]]
            self.play(
                ,*[
                    ReplacementTransform(source0[i],target0[j], rate_func=rate_functions.smooth)
                    for i,j in zip(*transform_index0)
                ],
                run_time=tracker.duration)
            
        with self.voiceover(text=_("""Y que el escalar por la i-ésima componente se puede
        sustituir por la i-ésima componente del producto.""")) as tracker:            
            self.play(ReplacementTransform(target0,source1))
            
            VG1 = VGroup(source1,target1)
            transform_index1 = [[0,1,2,3,4,5],
                                [1,0,2,4,5,3]]
            self.play(
                ,*[
                    ReplacementTransform(source1[i],target1[j], rate_func=rate_functions.smooth)
                    for i,j in zip(*transform_index1)
                ],
                run_time=tracker.duration)
            
        with self.voiceover(text=_("""Es decir, que los paréntesis pueden desplazarse para dejar
        fuera al escalar y dentro el operador selector, y viceversa.""")) as tracker:
            self.play(ReplacementTransform(target1,source2))
            VG2 = VGroup(source2,target2)
            self.play(
                ,*[
                    ReplacementTransform(source2[i],target2[j], rate_func=rate_functions.there_and_back_with_pause)
                    for i,j in zip(*transform_index0)
                ],
                run_time=tracker.duration)
	    
        with self.voiceover(text=_("""Esta regla se denomina propiedad asociativa del operador selector
        respecto del producto.""")) as tracker:            
            self.remove(target1,source2,target2)
            self.play(Indicate(eq_suma[0][0][0]),
                      Indicate(eq_suma[0][0][3]),
                      Indicate(eq_suma[2][0][1]),
                      Indicate(eq_suma[2][0][5]),
                      run_time=tracker.duration)
            self.play(FadeOut(grp3), run_time=0.3)
            self.pausa_muy_corta()

        with self.voiceover(text=_("""Por tanto, los paréntesis no son
        necesarios, pues la expresión sin ellos tiene pleno sentido;
        tal y como ocurre con el producto entre números.""")) as tracker:
            
            target3 = MathTex(r"\lambda\eleVR{a}{i}",
                              tex_template = myTemplate).next_to(grp3, DOWN, buff=0).scale(1.5)[0]
            grp4 = VGroup(cvab,igual,cvb,igual.copy(),target3).arrange(RIGHT, buff=1)

            producto = MathTex(r"(ab)c\;=\;a(bc)\;=\;abc",
                               tex_template = myTemplate).next_to(grp4, DOWN, buff=1.2).scale(1.5)[0]

            self.play(FadeIn(grp4),
                      run_time=tracker.duration/3)
            
            self.play(Indicate(target3), run_time=tracker.duration/3)

            self.play(FadeIn(producto))
            
            self.pausa(tracker.duration/3+1)
                        
#+END_SRC

#+RESULTS: L01_V04_E01_ProductoPorEscalares

# +call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="1")
# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="1")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E01_ProductoPorEscalares.mp4]]

