L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-org9ff8e44" class="outline-3">
<h3 id="org9ff8e44"><span class="section-number-3">1.1.</span> Escena 1 - Producto de vectores de de \(\mathbb{R}^n\) por escalares</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-python" id="org9b139b0">&lt;&lt;Carga de la librer&#237;a Manim y NacAL con AzureService&gt;&gt;
<span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">&lt;&lt;Carga de la librer&#237;a Manim y NacAL&gt;&gt;</span>
&lt;&lt;Definici&#243;n de mi escena con voz&gt;&gt;
&lt;&lt;Definici&#243;n de VectorR2&gt;&gt;
&lt;&lt;Definici&#243;n de VectorR3&gt;&gt;
&lt;&lt;<span style="color: #D0372D;">copyright</span>&gt;&gt;

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V04_E01_ProductoPorEscalares</span>(MiEscenaConVoz):    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )       
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))       </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"""\usepackage{nacal} """</span>)

        <span style="color: #0000FF;">self</span>.creditos()
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Portada</span>
        <span style="color: #BA36A5;">titulo</span> = Title(_(<span style="color: #008000;">"Producto de vectores de "</span>) + r<span style="color: #008000;">"\R[n]"</span> + _(<span style="color: #008000;">"por escalares"</span>),
                     tex_template = myTemplate,
                     font_size=70).set_color(BLUE)
        <span style="color: #0000FF;">self</span>.play(Write(titulo))
        <span style="color: #0000FF;">self</span>.pausa_media()
        <span style="color: #0000FF;">self</span>.play(FadeOut(titulo))
        
        <span style="color: #BA36A5;">operacionProducto</span> = Tex(_(<span style="color: #008000;">"Producto por escalares"</span>),
                         tex_template = myTemplate, font_size=70
                         ).to_edge(UP).set_color(BLUE)

        <span style="color: #BA36A5;">operacionDescripcion</span> = Tex(_(<span style="color: #008000;">"El producto se define componente a componente."</span>),
                         tex_template = myTemplate,
                         ).move_to([0,2.5,0]).to_edge(LEFT)
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Ejemplos</span>
        <span style="color: #BA36A5;">EjR3</span> = Tex(r<span style="color: #008000;">"\textbf{"</span> + _(<span style="color: #008000;">"Ejemplo en "</span>) + r<span style="color: #008000;">"\R[3]:}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(GREEN).next_to(operacionDescripcion, DOWN, aligned_edge=LEFT)

        <span style="color: #BA36A5;">EjR4</span> = Tex(r<span style="color: #008000;">"\textbf{"</span> + _(<span style="color: #008000;">"Ejemplo en "</span>) + r<span style="color: #008000;">"\R[4]:}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(GREEN).next_to(operacionDescripcion, DOWN, aligned_edge=LEFT)
        
        <span style="color: #BA36A5;">a</span>    = 3
        <span style="color: #BA36A5;">b</span>    = nc.Vector( [0, 1, 2])        
        <span style="color: #BA36A5;">s1</span> = MathTex(a,                tex_template = myTemplate,)
        <span style="color: #BA36A5;">por</span>= MathTex(r<span style="color: #008000;">"\cdot"</span>,         tex_template = myTemplate,)
        <span style="color: #BA36A5;">s3</span> = MathTex(b.latex(),        tex_template = myTemplate,)
        <span style="color: #BA36A5;">igual</span> = MathTex(r<span style="color: #008000;">"="</span>,          tex_template = myTemplate,)
        <span style="color: #BA36A5;">s5</span> = MathTex((a*b).latex(),    tex_template = myTemplate,)
        <span style="color: #BA36A5;">grp1</span> = VGroup(s1,por,s3,igual,s5).arrange(RIGHT)
       
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Adem&#225;s de sumar vectores,"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa_corta(tracker.duration)
            
        <span style="color: #0000FF;">self</span>.add(operacionProducto)
        <span style="color: #0000FF;">self</span>.add(operacionDescripcion)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""tambi&#233;n podemos reescalarlos, es decir, podemos multiplicarlos</span>
<span style="color: #008000;">        por alg&#250;n escalar para obtener un m&#250;ltiplo del vector original."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(EjR3)
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1[2]), run_time=tracker.duration/4)
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1[:2]), run_time=tracker.duration*3/4)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""El resultado es otro vector que se define componente a</span>
<span style="color: #008000;">        componente."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa_media()
            <span style="color: #0000FF;">self</span>.add(grp1[3])
            <span style="color: #0000FF;">self</span>.add(grp1[4][0][:2])
            <span style="color: #0000FF;">self</span>.add(grp1[4][0][-2:])

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""La primera componente del m&#250;ltiplo es el producto del escalar</span>
<span style="color: #008000;">        por la primera componente del vector."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1[4][0][2]), run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(Circumscribe(grp1[0]),
                      Circumscribe(grp1[2][0][2]),
                      Indicate(grp1[4][0][2]),                      
                      run_time=tracker.duration*2/3)
            <span style="color: #0000FF;">self</span>.pausa_corta()
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""De manera similar se calculan tanto la segunda</span>
<span style="color: #008000;">        componente, como las restantes componentes del m&#250;ltiplo del vector."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1[4][0][3]), run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(Circumscribe(grp1[0]),
                      Circumscribe(grp1[2][0][3]),
                      Indicate(grp1[4][0][3]),
                      run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1[4][0][4]),
                      run_time=tracker.duration/6)
            <span style="color: #0000FF;">self</span>.play(Circumscribe(grp1[0]),
                      Circumscribe(grp1[2][0][4]),
                      Indicate(grp1[4][0][4]),
                      run_time=tracker.duration/3 )
            <span style="color: #0000FF;">self</span>.pausa_muy_corta()
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp1))

        <span style="color: #BA36A5;">escalar</span> = sp.symbols(<span style="color: #008000;">'\lambda'</span>)
        <span style="color: #BA36A5;">vga</span> = MathTex(escalar, tex_template = myTemplate)
        
        <span style="color: #BA36A5;">v_generico_b</span>  = nc.Vector(sp.symbols(<span style="color: #008000;">'b:5'</span>)[1:])
        <span style="color: #BA36A5;">vgb</span> = MathTex(v_generico_b.latex(), tex_template = myTemplate)

        <span style="color: #BA36A5;">vgab</span> = MathTex((escalar * v_generico_b).latex(), tex_template = myTemplate)

        <span style="color: #BA36A5;">grp2</span> = VGroup(vga,por,vgb,igual,vgab).arrange(RIGHT)
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""As&#237;, la siguiente expresi&#243;n describe</span>
<span style="color: #008000;">        el producto de un vector de R 4 por un escalar."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeTransform(EjR3,EjR4))
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp2))
            <span style="color: #0000FF;">self</span>.pausa()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Lo habitual es simplificar la notaci&#243;n,</span>
<span style="color: #008000;">        omitiendo el punto que denota la operaci&#243;n producto"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp2[1]),
                      grp2[0].animate.move_to(grp2[1]),
                      run_time=2*tracker.duration/3)
            <span style="color: #0000FF;">self</span>.pausa_muy_corta()
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Como en el caso de la suma,"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""para definir la operaci&#243;n en R n necesitamos una</span>
<span style="color: #008000;">        estrategia que no requiera escribir la lista de componentes. Recuerde que n puede</span>
<span style="color: #008000;">        ser muy grande."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/6)
            <span style="color: #0000FF;">self</span>.play(Indicate(vga[0][4:-4]),
                      Indicate(vgb[0][4:-4]),
                      Indicate(vgab[0][4:-4]),
                      run_time=2*tracker.duration/3)
            <span style="color: #0000FF;">self</span>.wait(1.5*tracker.duration/6)

        <span style="color: #BA36A5;">Defn</span> = Tex(r<span style="color: #008000;">"\textbf{"</span> + _(<span style="color: #008000;">"Definici&#243;n"</span>) + <span style="color: #008000;">":}"</span>,
                 tex_template = myTemplate,
                 font_size=50).set_color(RED).next_to(operacionDescripcion,
                                                      DOWN,
                                                      aligned_edge=LEFT)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Una alternativa es definir el producto usando el operador</span>
<span style="color: #008000;">        selector. Con ella podemos expresar"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp2),
                      FadeOut(EjR4),
                      run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.add(Defn)

        <span style="color: #BA36A5;">cvab</span> = MathTex(r<span style="color: #008000;">"\elemRp{\lambda\Vect{a}}{i}"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">cvb</span>  = MathTex(r<span style="color: #008000;">"\lambda\eleVRpE{a}{i}"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">eq_suma</span> = VGroup(cvab,igual,cvb).arrange(RIGHT).scale(1.5)
        
        <span style="color: #BA36A5;">donde</span> = Tex(_(<span style="color: #008000;">"donde"</span>))
        <span style="color: #BA36A5;">indices</span> = MathTex(r<span style="color: #008000;">"i=1:n"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">pc_indices</span> = VGroup(donde,indices).arrange(RIGHT, buff=1)
        <span style="color: #BA36A5;">grp3</span> = VGroup(eq_suma, pc_indices).arrange(RIGHT, buff=1)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""que la i-&#233;sima componente del</span>
<span style="color: #008000;">        m&#250;ltiplo del vector es igual"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp3[0][0],
                             scale=1.5,
                             rate_func=rate_functions.exponential_decay),
                      run_time=tracker.duration-1.5)            
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp3[0][1],
                             scale=1.5,
                             rate_func=rate_functions.exponential_decay))

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""al escalar por la i-&#233;sima</span>
<span style="color: #008000;">        componente del vector."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.play(FadeIn(grp3[0][2:],
                             scale=0.5,
                             rate_func=rate_functions.exponential_decay),
                      run_time=tracker.duration+0.2)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(r<span style="color: #008000;">"""(donde el &#237;ndice recorre los n&#250;meros naturales entre uno</span>
<span style="color: #008000;">        y n)"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp3[1]))
            <span style="color: #0000FF;">self</span>.pausa_corta()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(r<span style="color: #008000;">"""Esta definici&#243;n abstracta  arroja una segunda regla de</span>
<span style="color: #008000;">        c&#225;lculo simb&#243;lico:"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration*2/3)
            <span style="color: #0000FF;">self</span>.play(Indicate(eq_suma[0][0][0]),
                      Indicate(eq_suma[0][0][3]),
                      Indicate(eq_suma[2][0][1]),
                      Indicate(eq_suma[2][0][5]),
                      run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.pausa_muy_corta()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(r<span style="color: #008000;">"""que la i-&#233;sima componente del producto se puede sustituir por</span>
<span style="color: #008000;">        el producto del escalar por la i-&#233;sima componente."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #BA36A5;">source0</span> = MathTex(r<span style="color: #008000;">"\elemRp{\lambda\Vect{a}}{i}"</span>,
                              tex_template = myTemplate).next_to(grp3, DOWN, buff=1.2).scale(2)[0]
            <span style="color: #BA36A5;">target0</span> = MathTex(r<span style="color: #008000;">"\lambda\eleVRpE{a}{i}"</span>,
                              tex_template = myTemplate).next_to(grp3, DOWN, buff=1.2).scale(2)[0]
            <span style="color: #BA36A5;">source1</span> = target0.copy()
            <span style="color: #BA36A5;">target1</span> = source0.copy()

            <span style="color: #BA36A5;">source2</span> = source0.copy()
            <span style="color: #BA36A5;">target2</span> = target0.copy()

            <span style="color: #BA36A5;">VG0</span> = VGroup(source0,target0)
            <span style="color: #0000FF;">self</span>.add(source0)
            <span style="color: #BA36A5;">transform_index0</span> = [[0,1,2,3,4,5],
                                [1,0,2,5,3,4]]
            <span style="color: #0000FF;">self</span>.play(
                *[
                    ReplacementTransform(source0[i],target0[j], rate_func=rate_functions.smooth)
                    <span style="color: #0000FF;">for</span> i,j <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(*transform_index0)
                ],
                run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y que el escalar por la i-&#233;sima componente se puede</span>
<span style="color: #008000;">        sustituir por la i-&#233;sima componente del producto."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.play(ReplacementTransform(target0,source1))
            
            <span style="color: #BA36A5;">VG1</span> = VGroup(source1,target1)
            <span style="color: #BA36A5;">transform_index1</span> = [[0,1,2,3,4,5],
                                [1,0,2,4,5,3]]
            <span style="color: #0000FF;">self</span>.play(
                *[
                    ReplacementTransform(source1[i],target1[j], rate_func=rate_functions.smooth)
                    <span style="color: #0000FF;">for</span> i,j <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(*transform_index1)
                ],
                run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Es decir, que los par&#233;ntesis pueden desplazarse para dejar</span>
<span style="color: #008000;">        fuera al escalar y dentro el operador selector, y viceversa."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(ReplacementTransform(target1,source2))
            <span style="color: #BA36A5;">VG2</span> = VGroup(source2,target2)
            <span style="color: #0000FF;">self</span>.play(
                *[
                    ReplacementTransform(source2[i],target2[j], rate_func=rate_functions.there_and_back_with_pause)
                    <span style="color: #0000FF;">for</span> i,j <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">zip</span>(*transform_index0)
                ],
                run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Esta regla se denomina propiedad asociativa del operador selector</span>
<span style="color: #008000;">        respecto del producto."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.remove(target1,source2,target2)
            <span style="color: #0000FF;">self</span>.play(Indicate(eq_suma[0][0][0]),
                      Indicate(eq_suma[0][0][3]),
                      Indicate(eq_suma[2][0][1]),
                      Indicate(eq_suma[2][0][5]),
                      run_time=tracker.duration)
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp3), run_time=0.3)
            <span style="color: #0000FF;">self</span>.pausa_muy_corta()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por tanto, los par&#233;ntesis no son</span>
<span style="color: #008000;">        necesarios, pues la expresi&#243;n sin ellos tiene pleno sentido;</span>
<span style="color: #008000;">        tal y como ocurre con el producto entre n&#250;meros."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">target3</span> = MathTex(r<span style="color: #008000;">"\lambda\eleVR{a}{i}"</span>,
                              tex_template = myTemplate).next_to(grp3, DOWN, buff=0).scale(1.5)[0]
            <span style="color: #BA36A5;">grp4</span> = VGroup(cvab,igual,cvb,igual.copy(),target3).arrange(RIGHT, buff=1)

            <span style="color: #BA36A5;">producto</span> = MathTex(r<span style="color: #008000;">"(ab)c\;=\;a(bc)\;=\;abc"</span>,
                               tex_template = myTemplate).next_to(grp4, DOWN, buff=1.2).scale(1.5)[0]

            <span style="color: #0000FF;">self</span>.play(FadeIn(grp4),
                      run_time=tracker.duration/3)
            
            <span style="color: #0000FF;">self</span>.play(Indicate(target3), run_time=tracker.duration/3)

            <span style="color: #0000FF;">self</span>.play(FadeIn(producto))
            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/3+1)
                        
</pre>
</div>
</div>
</div>
