L01_V04-ProductoDeUnVectorPorUnEscalar.org
** Escena 2 - Interpretación geométrica del producto de números

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena=" 2")

# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="2")

# file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E02_InterpretacionGeometricaDelProductoDeDosNumeros.mp4]]

#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V04_ProductoDeUnVectorPorUnEscalar.py
class L01_V04_E02_InterpretacionGeometricaDelProductoDeDosNumeros(MiEscenaConVoz):   
    
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )       
        #self.set_speech_service(GTTSService(lang="es", tld="com"))        
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"""\usepackage{nacal} """)
       
        cabecera = Tex(_("Interpretación geométrica del producto"),
                            tex_template = myTemplate,
                            font_size=70).to_edge(UP).set_color(BLUE)

        cabecera2 = Tex(_("Interpretación geométrica del producto de números"),
                       tex_template = myTemplate,
                       font_size=70).to_edge(UP).set_color(BLUE).scale(0.6).shift(0.1*UP)
        
        def coordenada_x(x,ax, label='', pos=0):
            if x==int(x):
                xlabel = (ax[0][2][int(x)-1]).copy()
            else:
                label = label if label else f"{x}"
                xlabel = Tex(label, font_size=30)
                pos_label = UP if pos else DOWN
                xlabel.next_to(ax.c2p(x,0), pos_label, buff=0.6)
            return xlabel

        def coordenada_y(y,ax, label='', pos=0):
            if y==int(y):
                ylabel = (ax[1][2][int(y)-1]).copy()
            else:
                label = label if label else f"{y}"
                ylabel = Tex(label, font_size=30)
                pos_label = RIGHT if pos else LEFT
                ylabel.next_to(ax.c2p(0,y), pos_label, buff=0.5)
            return ylabel
                
        coordenadas_xy = lambda x,y,ax,labelx='',labely='',posx=0,posy=0: (coordenada_x(x,ax,labelx,posx),
                                                                           coordenada_y(y,ax,labely,posy))
        
        def retículaProducto(a, b: int, ax: Axes) -> VGroup:
            def cuadricula(a: int, b: int, ax: Axes):
                base = VGroup(*[Square().scale(0.5) for s in range(0,int(a*b))])
                base.arrange_in_grid(rows=b,
                                     flow_order="ru",
                                     buff=0).next_to(ax.coords_to_point(0, 0),
                                                     UR,
                                                     buff=0)
                return Group(*[base[c[0]:c[1]] for c in [(a*i,a*(i+1)) for i in range(b)]])
            
            def rectangulo(a, b: int, ax: Axes):
                base  = VGroup(*[Rectangle(height=2.0, width=2.0*a).scale(0.5) for s in range(0,b)])
                posicion = UR if a>0 else UL
                tabla = base.arrange_in_grid(rows=b,
                                             flow_order="ru",
                                             buff=0).next_to(ax.coords_to_point(0, 0),
                                                             posicion,
                                                             buff=0)
                return tabla
            return cuadricula(a, b, ax) if isinstance(a, int) else rectangulo(a, b, ax)

        def productoEnteros(a,b,ax,tabla,duración=2):
            self.play([fila.animate.shift(i*a*RIGHT) for i,fila in enumerate(tabla)], run_time=duración/2)
            self.play([fila.animate.shift(i*DOWN) for i,fila in enumerate(tabla)], run_time=duración/2)
        
        def producto(a,b,ax,tabla,duración=3):
            self.play([fila.animate.shift(i*a*RIGHT) for i,fila in enumerate(tabla)], run_time=duración/3)
            self.play([fila.animate.shift(i*DOWN) for i,fila in enumerate(tabla)], run_time=duración/3)
            self.play([fila.animate.shift(i*UP) for i,fila in enumerate(tabla)], run_time=duración/3)

        def multiplicación(a, b: int, ax: Axes, tabla: VGroup, xtext='', ytext='', duración_de_las_rectas=1):
            h_line =ax.get_horizontal_line(ax.c2p(a*b,b), color=YELLOW)
            v_line =ax.get_vertical_line(ax.c2p(a*b,b), color=YELLOW)
            xlabel = Tex(xtext, font_size=32, color=YELLOW)
            pos_x  = DOWN if a*b >0 else UP
            xlabel.next_to(ax.c2p(a,0), pos_x, buff=0.5)
            ylabel = Tex(ytext, font_size=32, color=YELLOW)
            pos_y  = LEFT if a*b >0 else RIGHT
            ylabel.next_to(ax.c2p(0,b), pos_y, buff=0.5)
            prod_label = Tex(f"{b}"+xtext, font_size=32, color=YELLOW) if xtext else Tex('')
            prod_label.next_to(ax.c2p(a*b,0), DOWN, buff=0.5)
            self.add(xlabel)
            self.add(ylabel)
            self.add(prod_label)            
            self.play(Indicate(xlabel,
                               run_time=1),
                      Indicate(tabla[0],
                               run_time=1))
            
            self.play(Indicate(h_line, scale_factor=2),
                      run_time=1)
            self.play(Indicate(v_line, scale_factor=2),
                      run_time=2)
            self.wait(duración_de_las_rectas)
            self.play(FadeOut(v_line),
                      FadeOut(h_line))
            

        self.creditos(1)
        
        ax = Axes(
            x_length=12,
            y_length=6,
            x_range=[0, 12, 1],
            y_range=[0, 6, 1],
            tips=False,
            axis_config={"include_numbers": True}
        )        
        

        resumen1 = Tex(_(r"""Para interpretar geométricamente el producto por escalares en \R[2],"""),
                       tex_template = myTemplate).scale_to_fit_width(config.frame_width*.9)
        
        resumen2 = Tex(_(r"""antes interpretaremos geométricamente el producto de dos números."""),
                       tex_template = myTemplate).next_to(resumen1, DOWN).scale_to_fit_width(config.frame_width*.9)
        
        with self.voiceover(text=_("""Antes de ver la interpretación
        geométrica del reescalado de vectores en R2,""")) as tracker:
            
            self.add(cabecera)            
            self.play(Write(resumen1), run_time=tracker.duration+0.2)
            
        with self.voiceover(text=_("""debemos dar una interpretación
        geométrica al producto entre números reales.""")) as tracker:
            
            self.play(Write(resumen2), run_time=tracker.duration)
            self.play(FadeOut(resumen1),
                      FadeOut(resumen2))
            
            
        with self.voiceover(text=_("""Cuando los números son naturales
        es habitual asociar sus magnitudes con longitudes, y los
        productos con superficies""")) as tracker:

            self.play(FadeIn(ax),
                      FadeTransform(cabecera, cabecera2),
                      run_time=tracker.duration/3)

        with self.voiceover(text=_("""Así, el producto de uno por uno
        se asocia con un cuadrado de lado 1""")) as tracker:
            
            a=1
            b=1
            tabla = retículaProducto(a,b,ax)
            self.pausa(tracker.duration/6)
            xlabel,ylabel=coordenadas_xy(a,b,ax)
            self.play(Indicate(xlabel,scale_factor=2.5))
            self.play(Indicate(ylabel,scale_factor=2.5))
            self.remove(xlabel,
                        ylabel)
            [self.play(FadeIn(base), run_time=.5) for base in tabla]
            self.play(Indicate(tabla), run_time=tracker.duration/3)

        with self.voiceover(text=_("""Evidentemente el área del
        cuadrado coincide con la longitud de la base.""")) as tracker:            
            self.pausa(tracker.duration/2)
            self.play(tabla.animate.fade(0.8), run_time=tracker.duration/2)

            
        with self.voiceover(text=_("""Podemos asociar el producto tres
        por uno con un rectángulo de base tres y altura uno.""")) as tracker:
            
            a=3.
            b=1
            tabla2 = retículaProducto(a,b,ax)
            xlabel,ylabel=coordenadas_xy(a,b,ax)
            self.play(Indicate(xlabel,scale_factor=2.5))
            self.play(Indicate(ylabel,scale_factor=2.5))
            self.remove(xlabel,
                        ylabel)
            [self.play(FadeIn(base), run_time=.5) for base in tabla2]
            self.play(Indicate(tabla2), run_time=tracker.duration/3)
            self.pausa(tracker.duration/4)

        with self.voiceover(text=_("""Y de nuevo el área coincide con
        la longitud de la base, pues la altura es uno.""")) as tracker:
            self.play(FadeOut(tabla), run_time=tracker.duration/2)
            self.play(tabla2.animate.set_opacity(0.15), run_time=tracker.duration/2)
            
        with self.voiceover(text=_("""Multiplicar uno por tres
        corresponde a apilar tres cuadrados de base uno. Si los
        alineamos en una fila de altura uno, podemos comprobar que el
        área total (así como la longitud) es igual a la del rectángulo
        tres por uno.""")) as tracker:
            
            a=1
            b=3
            tabla = retículaProducto(a,b,ax)
            xlabel,ylabel=coordenadas_xy(a,b,ax)
            self.play(Indicate(xlabel,scale_factor=2.5))
            self.play(Indicate(ylabel,scale_factor=2.5))
            self.remove(xlabel,
                        ylabel)
            self.play([FadeIn(base) for base in tabla],
                      run_time=tracker.duration/3)
            productoEnteros(a,b,ax,tabla)
            self.pausa(tracker.duration/3)
            self.play(FadeOut(tabla),
                      FadeOut(tabla2))
                                        
        with self.voiceover(text=_("""Para multiplicar tres por cuatro
        apilamos cuatro rectángulos de base tres y altura uno. De
        nuevo, si los alineamos en una fila de altura 1, su longitud
        total es el valor del producto.""")) as tracker:
            
            a=3.
            b=4
            tabla = retículaProducto(a,b,ax)
            xlabel,ylabel=coordenadas_xy(a,b,ax)
            self.play(Indicate(xlabel,scale_factor=2.5))
            self.play(Indicate(ylabel,scale_factor=2.5))
            self.remove(xlabel,
                        ylabel)
            self.play([FadeIn(base) for base in tabla], run_time=tracker.duration/3)
            productoEnteros(a,b,ax,tabla,duración=tracker.duration/2)
            self.pausa(tracker.duration/6)
            self.play(FadeOut(tabla))

        with self.voiceover(text=_("""Esta forma de multiplicar, donde
        apilamos cierta cantidad de rectángulos con altura uno y base
        un número natural, para luego disponerlos horizontalmente y
        medir la longitud total, se puede generalizar a rectángulos
        cuya base es un número real, pero solo si lo hacemos con
        rectángulos de altura uno.""")) as tracker:
            
            a=2.
            b=3
            tabla = retículaProducto(a,b,ax)
            xlabel,ylabel=coordenadas_xy(a,b,ax)
            self.play(Indicate(xlabel,scale_factor=2.5))
            self.play(Indicate(ylabel,scale_factor=2.5))
            self.remove(xlabel,
                        ylabel)
            self.play([FadeIn(base) for base in tabla], run_time=tracker.duration/3)
            productoEnteros(a,b,ax,tabla,duración=tracker.duration/4)
            self.play(FadeOut(tabla),
                      run_time=tracker.duration*4/12)
            
        with self.voiceover(text=_("""Por ejemplo, podemos multiplicar
        raíz de dos por cinco.""")) as tracker:
            a=np.sqrt(2)
            a_label=r"$\sqrt{2}$"
            b=5
            tabla = retículaProducto(a,b,ax)
            self.pausa(tracker.duration/3)           
            xlabel,ylabel=coordenadas_xy(a, b, ax, labelx=a_label)
            self.play(Indicate(xlabel,scale_factor=2.5))
            self.play(Indicate(ylabel,scale_factor=2.5))
            self.remove(ylabel)
            self.play([FadeIn(base) for base in tabla], run_time=tracker.duration/3)
            productoEnteros(a,b,ax,tabla)
            
        with self.voiceover(text=_("""El resultado es algo mayor que
        siete.""")) as tracker:
            
            self.pausa(tracker.duration)           

        with self.voiceover(text=_("""Pero ¿cómo podemos multiplicar
        dos numeros reales?""")) as tracker:
            
            self.pausa(tracker.duration)           
            
        with self.voiceover(text=_("""Para hacerlo debemos dar una
        nueva interpretación del producto. Fijémonos en lo que pasa si
        nos quedamos a mitad de camino entre la pila inicial y la fila
        final.""")) as tracker:
            
            self.pausa(tracker.duration/3)
            self.play([fila.animate.shift(i*UP) for i,fila in enumerate(tabla)],
                      run_time=tracker.duration/3)

        with self.voiceover(text=_("""En esta posición los rectángulos
        también están alineados.""")) as tracker:
            
            recta =  Line(start = tabla.get_corner(DL),
                          end   = tabla.get_corner(UR),
                          color = RED_B)
            self.play(FadeIn(recta))
            self.pausa(tracker.duration)           
            self.play(FadeOut(tabla,
                              recta,
                              xlabel)) 
            
        with self.voiceover(text=_("""Usaremos este hecho para dar una
        nueva interpretación geométrica del producto entre números.""")) as tracker:
            self.pausa(tracker.duration)
            
        with self.voiceover(text=_("""Para verlo, volvamos primero a
        un ejemplo con números enteros.""")) as tracker:

            a=3.
            b=4
            tabla = retículaProducto(a,b,ax)
            xlabel,ylabel=coordenadas_xy(a, b, ax, labelx=a_label)
            self.play(Indicate(xlabel,scale_factor=2.5))
            self.play(Indicate(ylabel,scale_factor=2.5))
            self.remove(xlabel,
                        ylabel)
            self.add(tabla)
            producto(a,b,ax,tabla,duración=tracker.duration)
            
            recta =  Line(start = tabla.get_corner(DL),
                          end   = tabla.get_corner(UR),
                          color = RED_B)
            
            self.play(FadeIn(recta)) 
            self.play(FadeOut(tabla[1:]))
           
        with self.voiceover(text=_("""tres por cuatro es doce, y se puede
        calcular directamente en la recta roja, pues la recta a la
        altura 4 está sobre 12.""")) as tracker:
            
            multiplicación(a, b, ax, tabla, duración_de_las_rectas=4)
            
        with self.voiceover(text=_("""Pero también se puede ver que
        tres por dos es seis""")) as tracker:
            
            a=3.
            b=2
            multiplicación(a, b, ax, tabla)

        with self.voiceover(text=_("""O que tres por cuatro tercios es
        cuatro""")) as tracker:           
            a=3.
            b=4/3            
            b_label=r"$\frac{4}{3}$"
            xlabel,ylabel=coordenadas_xy(a, b, ax, labely=b_label)
            self.add(ylabel)
            multiplicación(a, b, ax, tabla, duración_de_las_rectas=0.4)
            self.play(FadeOut(tabla[0],
                              recta,
                              ylabel))
            
        with self.voiceover(text=_("""De este modo podemos multiplicar
        dos numeros reales cualesquiera. Por ejemplo, dos veces raíz
        de dos por raíz de diez.""")) as tracker:
            
            a=2*np.sqrt(2)
            a_label=r"$2\sqrt{2}$"
            b=1
            tabla = retículaProducto(a,b,ax)
            c=np.sqrt(10)
            c_label=r"$\sqrt{10}$"
            xlabel,ylabel=coordenadas_xy(a, c, ax, labelx=a_label, labely=c_label)
            self.pausa(tracker.duration/2)
            self.play(Indicate(xlabel,scale_factor=2.5))
            self.play(Indicate(ylabel,scale_factor=2.5))
            self.add(tabla)

        with self.voiceover(text=_("""El resultado es algo menor que
        9.""")) as tracker:
     
            recta =  Line(start = tabla.get_corner(DL),
                          end   = ax.c2p(12,12/a),
                          color = RED_B)
            self.play(FadeIn(recta))
            multiplicación(a, c, ax, tabla, duración_de_las_rectas=1)
            self.play(FadeOut(tabla,
                              recta,
                              xlabel,
                              ylabel,
                              ax,
                              cabecera2))
            
        ax = Axes(
            x_length=12,
            y_length=6,
            x_range=[-6, 6, 1],
            y_range=[-3, 3, 1],
            tips=False,
            axis_config={"include_numbers": True}
        )        
        self.add(ax)
            
        a=-2.5
        a_label=r"$\alpha$"
        b=1
        tabla = retículaProducto(a,b,ax)
        c=-1.5
        c_label=r"$\beta$"
        xlabel,ylabel=coordenadas_xy(a, c, ax, labelx=a_label, labely=c_label)
        xlabel.scale(1.5)
        ylabel.scale(1.5)
        
        with self.voiceover(text=_("""Por tanto, para multiplicar
        gráficamente un número alfa;""")) as tracker:
            
            self.pausa(tracker.duration*2/3)
            self.play(Indicate(xlabel,scale_factor=1.5))
            
        with self.voiceover(text=_("""por un número beta:""")) as tracker:
            self.play(Indicate(ylabel,scale_factor=1.5))
            
        with self.voiceover(text=_("""Pintamos un rectángulo cuya base
        va desde cero hasta alfa, y con altura uno.""")) as tracker:
            
            self.play(Indicate(tabla))

            
        with self.voiceover(text=_("""Extendemos la diagonal que pasa
        por el origen para obtener una recta infinita.""")) as tracker:
            
            recta =  Line(start = ax.c2p(-6,-6/a),
                          end   = ax.c2p( 6, 6/a),
                          color = RED_B)
            self.play(FadeIn(recta),
                      run_time=tracker.duration/3)

        with self.voiceover(text=_("""El punto de la recta cuya
        coordenada vertical es beta""")) as tracker:
            
            prod_label = Tex(r"$\alpha\beta$", font_size=30).scale(1.5)
            prod_label.next_to(ax.c2p(a*c,0), UP, buff=0.3)

            h_line =ax.get_horizontal_line(ax.c2p(a*c,c), color=BLUE)
            v_line =ax.get_vertical_line(ax.c2p(a*c,c), color=BLUE)
            self.play(FadeIn(h_line),
                      Indicate(ylabel))
                      
        with self.voiceover(text=_("""tiene como coordenada horizontal
        el valor alfa por beta""")) as tracker:
            
            self.play(FadeIn(v_line),
                      Indicate(prod_label,
                               scale_factor=1.5))
            self.pausa_larga()

        with self.voiceover(text=_("""Esta nueva interpretación de
        producto implica que, los puntos de una recta que pasa por el
        origen son aquellos que mantienen una proporción constante
        entre sus cordenadas vertical y horizontal.""")) as tracker:
            
            c=2.2
            c_label=r"$y$"
            xlabel2,ylabel2=coordenadas_xy(a, c, ax, labelx=a_label, labely=c_label,posy=1)
            xlabel2.scale(1.5)
            ylabel2.scale(1.5)
            prod_label2 = Tex(r"$x=\alpha y$", font_size=30).scale(1.5)
            prod_label2.next_to(ax.c2p(a*c,0), DOWN, buff=0.6)
            h_line2 =ax.get_horizontal_line(ax.c2p(a*c,c), color=GREEN)
            v_line2 =ax.get_vertical_line(ax.c2p(a*c,c), color=GREEN)

            eq_recta = Tex(r"$\frac{\beta}{\alpha\beta}\;=\;\frac{1}{\alpha}$",
                       tex_template = myTemplate,
                       font_size=30).scale(2.5).set_color(BLUE_A).to_corner(UR)

            self.play(FadeIn(eq_recta))
            self.pausa(tracker.duration/3)
            self.play(Circumscribe(eq_recta[0][-3:]),
                      Circumscribe(eq_recta[0][:3]),
                      run_time=tracker.duration/2)

        with self.voiceover(text=_("""Fíjese que esta representación
        respeta los signos del producto:""")) as tracker:            
            self.pausa(tracker.duration)
            
        with self.voiceover(text=_("""menos por más es menos.""")) as tracker:
            self.pausa(tracker.duration)
            
        with self.voiceover(text=_("""Y menos por menos es más. Por
        eso alpha por beta es positivo en la figura.""")) as tracker:
            self.play(Indicate(xlabel,scale_factor=2),
                      Indicate(ylabel,scale_factor=2),
                      Indicate(prod_label,scale_factor=2),
                      run_time=tracker.duration*2/3)
            self.play(FadeOut(tabla,
                              recta,
                              h_line,
                              v_line,
                              xlabel,
                              ylabel,
                              prod_label,
                              eq_recta),
                      run_time=tracker.duration/2)
                
        eje_y =  Line(start = ax.c2p(0,3),
                      end   = ax.c2p(0,-3),
                      color = RED_B)
        cerolabel = Tex('$0$', font_size=32, color=YELLOW).scale(1.3)
        cerolabel.next_to(ax.c2p(0,0), DOWN)
        
        with self.voiceover(text=_("""Nótese que en el caso en que
        alfa es cero, empleamos como recta el eje vertical.""")) as tracker:
            
            self.play(FadeIn(eje_y),
                      Indicate(cerolabel),
                      run_time=tracker.duration/2)
            self.play(Indicate(eje_y),
                      run_time=tracker.duration/2)
            self.play(FadeOut(eje_y),
                      FadeOut(cerolabel))
            
        with self.voiceover(text=_("""Esta interpretación del producto
        entre números reales, que caracteriza las rectas en función de
        la proporción entre las coordenadas de sus puntos, nos va a
        permitir interpretar el producto de un vector por un
        escalar. Veámoslo""")) as tracker:
            
            self.play(FadeIn(recta,
                             h_line,
                             v_line,
                             xlabel,
                             ylabel,
                             prod_label,
                             eq_recta))

#+END_SRC

 #+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena=" 2")

# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="2")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E02_InterpretacionGeometricaDelProductoDeDosNumeros.mp4]]


