L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-orgb15b133" class="outline-3">
<h3 id="orgb15b133"><span class="section-number-3">1.2.</span> Escena 2 - Interpretación geométrica del producto de números</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V04_E02_InterpretacionGeometricaDelProductoDeDosNumeros</span>(MiEscenaConVoz):   
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )       
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))        </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"""\usepackage{nacal} """</span>)
       
        <span style="color: #BA36A5;">cabecera</span> = Tex(_(<span style="color: #008000;">"Interpretaci&#243;n geom&#233;trica del producto"</span>),
                            tex_template = myTemplate,
                            font_size=70).to_edge(UP).set_color(BLUE)

        <span style="color: #BA36A5;">cabecera2</span> = Tex(_(<span style="color: #008000;">"Interpretaci&#243;n geom&#233;trica del producto de n&#250;meros"</span>),
                       tex_template = myTemplate,
                       font_size=70).to_edge(UP).set_color(BLUE).scale(0.6).shift(0.1*UP)
        
        <span style="color: #0000FF;">def</span> <span style="color: #006699;">coordenada_x</span>(x,ax, label=<span style="color: #008000;">''</span>, pos=0):
            <span style="color: #0000FF;">if</span> x==<span style="color: #006FE0;">int</span>(x):
                <span style="color: #BA36A5;">xlabel</span> = (ax[0][2][<span style="color: #006FE0;">int</span>(x)-1]).copy()
            <span style="color: #0000FF;">else</span>:
                <span style="color: #BA36A5;">label</span> = label <span style="color: #0000FF;">if</span> label <span style="color: #0000FF;">else</span> f<span style="color: #008000;">"</span>{x}<span style="color: #008000;">"</span>
                <span style="color: #BA36A5;">xlabel</span> = Tex(label, font_size=30)
                <span style="color: #BA36A5;">pos_label</span> = UP <span style="color: #0000FF;">if</span> pos <span style="color: #0000FF;">else</span> DOWN
                xlabel.next_to(ax.c2p(x,0), pos_label, buff=0.6)
            <span style="color: #0000FF;">return</span> xlabel

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">coordenada_y</span>(y,ax, label=<span style="color: #008000;">''</span>, pos=0):
            <span style="color: #0000FF;">if</span> y==<span style="color: #006FE0;">int</span>(y):
                <span style="color: #BA36A5;">ylabel</span> = (ax[1][2][<span style="color: #006FE0;">int</span>(y)-1]).copy()
            <span style="color: #0000FF;">else</span>:
                <span style="color: #BA36A5;">label</span> = label <span style="color: #0000FF;">if</span> label <span style="color: #0000FF;">else</span> f<span style="color: #008000;">"</span>{y}<span style="color: #008000;">"</span>
                <span style="color: #BA36A5;">ylabel</span> = Tex(label, font_size=30)
                <span style="color: #BA36A5;">pos_label</span> = RIGHT <span style="color: #0000FF;">if</span> pos <span style="color: #0000FF;">else</span> LEFT
                ylabel.next_to(ax.c2p(0,y), pos_label, buff=0.5)
            <span style="color: #0000FF;">return</span> ylabel
                
        <span style="color: #BA36A5;">coordenadas_xy</span> = <span style="color: #0000FF;">lambda</span> <span style="color: #BA36A5;">x</span>,<span style="color: #BA36A5;">y</span>,<span style="color: #BA36A5;">ax</span>,<span style="color: #BA36A5;">labelx</span>=<span style="color: #008000;">''</span>,<span style="color: #BA36A5;">labely</span>=<span style="color: #008000;">''</span>,<span style="color: #BA36A5;">posx</span>=0,<span style="color: #BA36A5;">posy</span>=0: (coordenada_x(x,ax,labelx,posx),
                                                                           coordenada_y(y,ax,labely,posy))
        
        <span style="color: #0000FF;">def</span> <span style="color: #006699;">ret&#237;culaProducto</span>(a, b: <span style="color: #006FE0;">int</span>, ax: Axes) -&gt; VGroup:
            <span style="color: #0000FF;">def</span> <span style="color: #006699;">cuadricula</span>(a: <span style="color: #006FE0;">int</span>, b: <span style="color: #006FE0;">int</span>, ax: Axes):
                <span style="color: #BA36A5;">base</span> = VGroup(*[Square().scale(0.5) <span style="color: #0000FF;">for</span> s <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(0,<span style="color: #006FE0;">int</span>(a*b))])
                base.arrange_in_grid(rows=b,
                                     flow_order=<span style="color: #008000;">"ru"</span>,
                                     buff=0).next_to(ax.coords_to_point(0, 0),
                                                     UR,
                                                     buff=0)
                <span style="color: #0000FF;">return</span> Group(*[base[c[0]:c[1]] <span style="color: #0000FF;">for</span> c <span style="color: #0000FF;">in</span> [(a*i,a*(i+1)) <span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(b)]])
            
            <span style="color: #0000FF;">def</span> <span style="color: #006699;">rectangulo</span>(a, b: <span style="color: #006FE0;">int</span>, ax: Axes):
                <span style="color: #BA36A5;">base</span>  = VGroup(*[Rectangle(height=2.0, width=2.0*a).scale(0.5) <span style="color: #0000FF;">for</span> s <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(0,b)])
                <span style="color: #BA36A5;">posicion</span> = UR <span style="color: #0000FF;">if</span> a&gt;0 <span style="color: #0000FF;">else</span> UL
                <span style="color: #BA36A5;">tabla</span> = base.arrange_in_grid(rows=b,
                                             flow_order=<span style="color: #008000;">"ru"</span>,
                                             buff=0).next_to(ax.coords_to_point(0, 0),
                                                             posicion,
                                                             buff=0)
                <span style="color: #0000FF;">return</span> tabla
            <span style="color: #0000FF;">return</span> cuadricula(a, b, ax) <span style="color: #0000FF;">if</span> <span style="color: #006FE0;">isinstance</span>(a, <span style="color: #006FE0;">int</span>) <span style="color: #0000FF;">else</span> rectangulo(a, b, ax)

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">productoEnteros</span>(a,b,ax,tabla,duraci&#243;n=2):
            <span style="color: #0000FF;">self</span>.play([fila.animate.shift(i*a*RIGHT) <span style="color: #0000FF;">for</span> i,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(tabla)], run_time=duraci&#243;n/2)
            <span style="color: #0000FF;">self</span>.play([fila.animate.shift(i*DOWN) <span style="color: #0000FF;">for</span> i,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(tabla)], run_time=duraci&#243;n/2)
        
        <span style="color: #0000FF;">def</span> <span style="color: #006699;">producto</span>(a,b,ax,tabla,duraci&#243;n=3):
            <span style="color: #0000FF;">self</span>.play([fila.animate.shift(i*a*RIGHT) <span style="color: #0000FF;">for</span> i,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(tabla)], run_time=duraci&#243;n/3)
            <span style="color: #0000FF;">self</span>.play([fila.animate.shift(i*DOWN) <span style="color: #0000FF;">for</span> i,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(tabla)], run_time=duraci&#243;n/3)
            <span style="color: #0000FF;">self</span>.play([fila.animate.shift(i*UP) <span style="color: #0000FF;">for</span> i,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(tabla)], run_time=duraci&#243;n/3)

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">multiplicaci&#243;n</span>(a, b: <span style="color: #006FE0;">int</span>, ax: Axes, tabla: VGroup, xtext=<span style="color: #008000;">''</span>, ytext=<span style="color: #008000;">''</span>, duraci&#243;n_de_las_rectas=1):
            <span style="color: #BA36A5;">h_line</span> =ax.get_horizontal_line(ax.c2p(a*b,b), color=YELLOW)
            <span style="color: #BA36A5;">v_line</span> =ax.get_vertical_line(ax.c2p(a*b,b), color=YELLOW)
            <span style="color: #BA36A5;">xlabel</span> = Tex(xtext, font_size=32, color=YELLOW)
            <span style="color: #BA36A5;">pos_x</span>  = DOWN <span style="color: #0000FF;">if</span> a*b &gt;0 <span style="color: #0000FF;">else</span> UP
            xlabel.next_to(ax.c2p(a,0), pos_x, buff=0.5)
            <span style="color: #BA36A5;">ylabel</span> = Tex(ytext, font_size=32, color=YELLOW)
            <span style="color: #BA36A5;">pos_y</span>  = LEFT <span style="color: #0000FF;">if</span> a*b &gt;0 <span style="color: #0000FF;">else</span> RIGHT
            ylabel.next_to(ax.c2p(0,b), pos_y, buff=0.5)
            <span style="color: #BA36A5;">prod_label</span> = Tex(f<span style="color: #008000;">"</span>{b}<span style="color: #008000;">"</span>+xtext, font_size=32, color=YELLOW) <span style="color: #0000FF;">if</span> xtext <span style="color: #0000FF;">else</span> Tex(<span style="color: #008000;">''</span>)
            prod_label.next_to(ax.c2p(a*b,0), DOWN, buff=0.5)
            <span style="color: #0000FF;">self</span>.add(xlabel)
            <span style="color: #0000FF;">self</span>.add(ylabel)
            <span style="color: #0000FF;">self</span>.add(prod_label)            
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,
                               run_time=1),
                      Indicate(tabla[0],
                               run_time=1))
            
            <span style="color: #0000FF;">self</span>.play(Indicate(h_line, scale_factor=2),
                      run_time=1)
            <span style="color: #0000FF;">self</span>.play(Indicate(v_line, scale_factor=2),
                      run_time=2)
            <span style="color: #0000FF;">self</span>.wait(duraci&#243;n_de_las_rectas)
            <span style="color: #0000FF;">self</span>.play(FadeOut(v_line),
                      FadeOut(h_line))
            

        <span style="color: #0000FF;">self</span>.creditos(1)
        
        <span style="color: #BA36A5;">ax</span> = Axes(
            x_length=12,
            y_length=6,
            x_range=[0, 12, 1],
            y_range=[0, 6, 1],
            tips=<span style="color: #D0372D;">False</span>,
            axis_config={<span style="color: #008000;">"include_numbers"</span>: <span style="color: #D0372D;">True</span>}
        )        
        

        <span style="color: #BA36A5;">resumen1</span> = Tex(_(r<span style="color: #008000;">"""Para interpretar geom&#233;tricamente el producto por escalares en \R[2],"""</span>),
                       tex_template = myTemplate).scale_to_fit_width(config.frame_width*.9)
        
        <span style="color: #BA36A5;">resumen2</span> = Tex(_(r<span style="color: #008000;">"""antes interpretaremos geom&#233;tricamente el producto de dos n&#250;meros."""</span>),
                       tex_template = myTemplate).next_to(resumen1, DOWN).scale_to_fit_width(config.frame_width*.9)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Antes de ver la interpretaci&#243;n</span>
<span style="color: #008000;">        geom&#233;trica del reescalado de vectores en R2,"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.add(cabecera)            
            <span style="color: #0000FF;">self</span>.play(Write(resumen1), run_time=tracker.duration+0.2)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""debemos dar una interpretaci&#243;n</span>
<span style="color: #008000;">        geom&#233;trica al producto entre n&#250;meros reales."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(Write(resumen2), run_time=tracker.duration)
            <span style="color: #0000FF;">self</span>.play(FadeOut(resumen1),
                      FadeOut(resumen2))
            
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Cuando los n&#250;meros son naturales</span>
<span style="color: #008000;">        es habitual asociar sus magnitudes con longitudes, y los</span>
<span style="color: #008000;">        productos con superficies"""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.play(FadeIn(ax),
                      FadeTransform(cabecera, cabecera2),
                      run_time=tracker.duration/3)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""As&#237;, el producto de uno por uno</span>
<span style="color: #008000;">        se asocia con un cuadrado de lado 1"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">a</span>=1
            <span style="color: #BA36A5;">b</span>=1
            <span style="color: #BA36A5;">tabla</span> = ret&#237;culaProducto(a,b,ax)
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/6)
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a,b,ax)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.remove(xlabel,
                        ylabel)
            [<span style="color: #0000FF;">self</span>.play(FadeIn(base), run_time=.5) <span style="color: #0000FF;">for</span> base <span style="color: #0000FF;">in</span> tabla]
            <span style="color: #0000FF;">self</span>.play(Indicate(tabla), run_time=tracker.duration/3)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Evidentemente el &#225;rea del</span>
<span style="color: #008000;">        cuadrado coincide con la longitud de la base."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(tabla.animate.fade(0.8), run_time=tracker.duration/2)

            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Podemos asociar el producto tres</span>
<span style="color: #008000;">        por uno con un rect&#225;ngulo de base tres y altura uno."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">a</span>=3.
            <span style="color: #BA36A5;">b</span>=1
            <span style="color: #BA36A5;">tabla2</span> = ret&#237;culaProducto(a,b,ax)
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a,b,ax)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.remove(xlabel,
                        ylabel)
            [<span style="color: #0000FF;">self</span>.play(FadeIn(base), run_time=.5) <span style="color: #0000FF;">for</span> base <span style="color: #0000FF;">in</span> tabla2]
            <span style="color: #0000FF;">self</span>.play(Indicate(tabla2), run_time=tracker.duration/3)
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/4)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y de nuevo el &#225;rea coincide con</span>
<span style="color: #008000;">        la longitud de la base, pues la altura es uno."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla), run_time=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(tabla2.animate.set_opacity(0.15), run_time=tracker.duration/2)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Multiplicar uno por tres</span>
<span style="color: #008000;">        corresponde a apilar tres cuadrados de base uno. Si los</span>
<span style="color: #008000;">        alineamos en una fila de altura uno, podemos comprobar que el</span>
<span style="color: #008000;">        &#225;rea total (as&#237; como la longitud) es igual a la del rect&#225;ngulo</span>
<span style="color: #008000;">        tres por uno."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">a</span>=1
            <span style="color: #BA36A5;">b</span>=3
            <span style="color: #BA36A5;">tabla</span> = ret&#237;culaProducto(a,b,ax)
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a,b,ax)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.remove(xlabel,
                        ylabel)
            <span style="color: #0000FF;">self</span>.play([FadeIn(base) <span style="color: #0000FF;">for</span> base <span style="color: #0000FF;">in</span> tabla],
                      run_time=tracker.duration/3)
            productoEnteros(a,b,ax,tabla)
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla),
                      FadeOut(tabla2))
                                        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Para multiplicar tres por cuatro</span>
<span style="color: #008000;">        apilamos cuatro rect&#225;ngulos de base tres y altura uno. De</span>
<span style="color: #008000;">        nuevo, si los alineamos en una fila de altura 1, su longitud</span>
<span style="color: #008000;">        total es el valor del producto."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">a</span>=3.
            <span style="color: #BA36A5;">b</span>=4
            <span style="color: #BA36A5;">tabla</span> = ret&#237;culaProducto(a,b,ax)
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a,b,ax)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.remove(xlabel,
                        ylabel)
            <span style="color: #0000FF;">self</span>.play([FadeIn(base) <span style="color: #0000FF;">for</span> base <span style="color: #0000FF;">in</span> tabla], run_time=tracker.duration/3)
            productoEnteros(a,b,ax,tabla,duraci&#243;n=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/6)
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla))

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Esta forma de multiplicar, donde</span>
<span style="color: #008000;">        apilamos cierta cantidad de rect&#225;ngulos con altura uno y base</span>
<span style="color: #008000;">        un n&#250;mero natural, para luego disponerlos horizontalmente y</span>
<span style="color: #008000;">        medir la longitud total, se puede generalizar a rect&#225;ngulos</span>
<span style="color: #008000;">        cuya base es un n&#250;mero real, pero solo si lo hacemos con</span>
<span style="color: #008000;">        rect&#225;ngulos de altura uno."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">a</span>=2.
            <span style="color: #BA36A5;">b</span>=3
            <span style="color: #BA36A5;">tabla</span> = ret&#237;culaProducto(a,b,ax)
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a,b,ax)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.remove(xlabel,
                        ylabel)
            <span style="color: #0000FF;">self</span>.play([FadeIn(base) <span style="color: #0000FF;">for</span> base <span style="color: #0000FF;">in</span> tabla], run_time=tracker.duration/3)
            productoEnteros(a,b,ax,tabla,duraci&#243;n=tracker.duration/4)
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla),
                      run_time=tracker.duration*4/12)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por ejemplo, podemos multiplicar</span>
<span style="color: #008000;">        ra&#237;z de dos por cinco."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #BA36A5;">a</span>=np.sqrt(2)
            <span style="color: #BA36A5;">a_label</span>=r<span style="color: #008000;">"$\sqrt{2}$"</span>
            <span style="color: #BA36A5;">b</span>=5
            <span style="color: #BA36A5;">tabla</span> = ret&#237;culaProducto(a,b,ax)
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/3)           
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a, b, ax, labelx=a_label)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.remove(ylabel)
            <span style="color: #0000FF;">self</span>.play([FadeIn(base) <span style="color: #0000FF;">for</span> base <span style="color: #0000FF;">in</span> tabla], run_time=tracker.duration/3)
            productoEnteros(a,b,ax,tabla)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""El resultado es algo mayor que</span>
<span style="color: #008000;">        siete."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)           

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Pero &#191;c&#243;mo podemos multiplicar</span>
<span style="color: #008000;">        dos numeros reales?"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)           
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Para hacerlo debemos dar una</span>
<span style="color: #008000;">        nueva interpretaci&#243;n del producto. Fij&#233;monos en lo que pasa si</span>
<span style="color: #008000;">        nos quedamos a mitad de camino entre la pila inicial y la fila</span>
<span style="color: #008000;">        final."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play([fila.animate.shift(i*UP) <span style="color: #0000FF;">for</span> i,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(tabla)],
                      run_time=tracker.duration/3)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""En esta posici&#243;n los rect&#225;ngulos</span>
<span style="color: #008000;">        tambi&#233;n est&#225;n alineados."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">recta</span> =  Line(start = tabla.get_corner(DL),
                          end   = tabla.get_corner(UR),
                          color = RED_B)
            <span style="color: #0000FF;">self</span>.play(FadeIn(recta))
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)           
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla,
                              recta,
                              xlabel)) 
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Usaremos este hecho para dar una</span>
<span style="color: #008000;">        nueva interpretaci&#243;n geom&#233;trica del producto entre n&#250;meros."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Para verlo, volvamos primero a</span>
<span style="color: #008000;">        un ejemplo con n&#250;meros enteros."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #BA36A5;">a</span>=3.
            <span style="color: #BA36A5;">b</span>=4
            <span style="color: #BA36A5;">tabla</span> = ret&#237;culaProducto(a,b,ax)
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a, b, ax, labelx=a_label)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.remove(xlabel,
                        ylabel)
            <span style="color: #0000FF;">self</span>.add(tabla)
            producto(a,b,ax,tabla,duraci&#243;n=tracker.duration)
            
            <span style="color: #BA36A5;">recta</span> =  Line(start = tabla.get_corner(DL),
                          end   = tabla.get_corner(UR),
                          color = RED_B)
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(recta)) 
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla[1:]))
           
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""tres por cuatro es doce, y se puede</span>
<span style="color: #008000;">        calcular directamente en la recta roja, pues la recta a la</span>
<span style="color: #008000;">        altura 4 est&#225; sobre 12."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            multiplicaci&#243;n(a, b, ax, tabla, duraci&#243;n_de_las_rectas=4)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Pero tambi&#233;n se puede ver que</span>
<span style="color: #008000;">        tres por dos es seis"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">a</span>=3.
            <span style="color: #BA36A5;">b</span>=2
            multiplicaci&#243;n(a, b, ax, tabla)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""O que tres por cuatro tercios es</span>
<span style="color: #008000;">        cuatro"""</span>)) <span style="color: #0000FF;">as</span> tracker:           
            <span style="color: #BA36A5;">a</span>=3.
            <span style="color: #BA36A5;">b</span>=4/3            
            <span style="color: #BA36A5;">b_label</span>=r<span style="color: #008000;">"$\frac{4}{3}$"</span>
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a, b, ax, labely=b_label)
            <span style="color: #0000FF;">self</span>.add(ylabel)
            multiplicaci&#243;n(a, b, ax, tabla, duraci&#243;n_de_las_rectas=0.4)
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla[0],
                              recta,
                              ylabel))
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""De este modo podemos multiplicar</span>
<span style="color: #008000;">        dos numeros reales cualesquiera. Por ejemplo, dos veces ra&#237;z</span>
<span style="color: #008000;">        de dos por ra&#237;z de diez."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">a</span>=2*np.sqrt(2)
            <span style="color: #BA36A5;">a_label</span>=r<span style="color: #008000;">"$2\sqrt{2}$"</span>
            <span style="color: #BA36A5;">b</span>=1
            <span style="color: #BA36A5;">tabla</span> = ret&#237;culaProducto(a,b,ax)
            <span style="color: #BA36A5;">c</span>=np.sqrt(10)
            <span style="color: #BA36A5;">c_label</span>=r<span style="color: #008000;">"$\sqrt{10}$"</span>
            <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a, c, ax, labelx=a_label, labely=c_label)
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=2.5))
            <span style="color: #0000FF;">self</span>.add(tabla)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""El resultado es algo menor que</span>
<span style="color: #008000;">        9."""</span>)) <span style="color: #0000FF;">as</span> tracker:
     
            <span style="color: #BA36A5;">recta</span> =  Line(start = tabla.get_corner(DL),
                          end   = ax.c2p(12,12/a),
                          color = RED_B)
            <span style="color: #0000FF;">self</span>.play(FadeIn(recta))
            multiplicaci&#243;n(a, c, ax, tabla, duraci&#243;n_de_las_rectas=1)
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla,
                              recta,
                              xlabel,
                              ylabel,
                              ax,
                              cabecera2))
            
        <span style="color: #BA36A5;">ax</span> = Axes(
            x_length=12,
            y_length=6,
            x_range=[-6, 6, 1],
            y_range=[-3, 3, 1],
            tips=<span style="color: #D0372D;">False</span>,
            axis_config={<span style="color: #008000;">"include_numbers"</span>: <span style="color: #D0372D;">True</span>}
        )        
        <span style="color: #0000FF;">self</span>.add(ax)
            
        <span style="color: #BA36A5;">a</span>=-2.5
        <span style="color: #BA36A5;">a_label</span>=r<span style="color: #008000;">"$\alpha$"</span>
        <span style="color: #BA36A5;">b</span>=1
        <span style="color: #BA36A5;">tabla</span> = ret&#237;culaProducto(a,b,ax)
        <span style="color: #BA36A5;">c</span>=-1.5
        <span style="color: #BA36A5;">c_label</span>=r<span style="color: #008000;">"$\beta$"</span>
        <span style="color: #BA36A5;">xlabel</span>,<span style="color: #BA36A5;">ylabel</span>=coordenadas_xy(a, c, ax, labelx=a_label, labely=c_label)
        xlabel.scale(1.5)
        ylabel.scale(1.5)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por tanto, para multiplicar</span>
<span style="color: #008000;">        gr&#225;ficamente un n&#250;mero alfa;"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration*2/3)
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=1.5))
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""por un n&#250;mero beta:"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=1.5))
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Pintamos un rect&#225;ngulo cuya base</span>
<span style="color: #008000;">        va desde cero hasta alfa, y con altura uno."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(Indicate(tabla))

            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Extendemos la diagonal que pasa</span>
<span style="color: #008000;">        por el origen para obtener una recta infinita."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">recta</span> =  Line(start = ax.c2p(-6,-6/a),
                          end   = ax.c2p( 6, 6/a),
                          color = RED_B)
            <span style="color: #0000FF;">self</span>.play(FadeIn(recta),
                      run_time=tracker.duration/3)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""El punto de la recta cuya</span>
<span style="color: #008000;">        coordenada vertical es beta"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">prod_label</span> = Tex(r<span style="color: #008000;">"$\alpha\beta$"</span>, font_size=30).scale(1.5)
            prod_label.next_to(ax.c2p(a*c,0), UP, buff=0.3)

            <span style="color: #BA36A5;">h_line</span> =ax.get_horizontal_line(ax.c2p(a*c,c), color=BLUE)
            <span style="color: #BA36A5;">v_line</span> =ax.get_vertical_line(ax.c2p(a*c,c), color=BLUE)
            <span style="color: #0000FF;">self</span>.play(FadeIn(h_line),
                      Indicate(ylabel))
                      
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""tiene como coordenada horizontal</span>
<span style="color: #008000;">        el valor alfa por beta"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(v_line),
                      Indicate(prod_label,
                               scale_factor=1.5))
            <span style="color: #0000FF;">self</span>.pausa_larga()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Esta nueva interpretaci&#243;n de</span>
<span style="color: #008000;">        producto implica que, los puntos de una recta que pasa por el</span>
<span style="color: #008000;">        origen son aquellos que mantienen una proporci&#243;n constante</span>
<span style="color: #008000;">        entre sus cordenadas vertical y horizontal."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #BA36A5;">c</span>=2.2
            <span style="color: #BA36A5;">c_label</span>=r<span style="color: #008000;">"$y$"</span>
            <span style="color: #BA36A5;">xlabel2</span>,<span style="color: #BA36A5;">ylabel2</span>=coordenadas_xy(a, c, ax, labelx=a_label, labely=c_label,posy=1)
            xlabel2.scale(1.5)
            ylabel2.scale(1.5)
            <span style="color: #BA36A5;">prod_label2</span> = Tex(r<span style="color: #008000;">"$x=\alpha y$"</span>, font_size=30).scale(1.5)
            prod_label2.next_to(ax.c2p(a*c,0), DOWN, buff=0.6)
            <span style="color: #BA36A5;">h_line2</span> =ax.get_horizontal_line(ax.c2p(a*c,c), color=GREEN)
            <span style="color: #BA36A5;">v_line2</span> =ax.get_vertical_line(ax.c2p(a*c,c), color=GREEN)

            <span style="color: #BA36A5;">eq_recta</span> = Tex(r<span style="color: #008000;">"$\frac{\beta}{\alpha\beta}\;=\;\frac{1}{\alpha}$"</span>,
                       tex_template = myTemplate,
                       font_size=30).scale(2.5).set_color(BLUE_A).to_corner(UR)

            <span style="color: #0000FF;">self</span>.play(FadeIn(eq_recta))
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/3)
            <span style="color: #0000FF;">self</span>.play(Circumscribe(eq_recta[0][-3:]),
                      Circumscribe(eq_recta[0][:3]),
                      run_time=tracker.duration/2)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""F&#237;jese que esta representaci&#243;n</span>
<span style="color: #008000;">        respeta los signos del producto:"""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""menos por m&#225;s es menos."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y menos por menos es m&#225;s. Por</span>
<span style="color: #008000;">        eso alpha por beta es positivo en la figura."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=2),
                      Indicate(ylabel,scale_factor=2),
                      Indicate(prod_label,scale_factor=2),
                      run_time=tracker.duration*2/3)
            <span style="color: #0000FF;">self</span>.play(FadeOut(tabla,
                              recta,
                              h_line,
                              v_line,
                              xlabel,
                              ylabel,
                              prod_label,
                              eq_recta),
                      run_time=tracker.duration/2)
                
        <span style="color: #BA36A5;">eje_y</span> =  Line(start = ax.c2p(0,3),
                      end   = ax.c2p(0,-3),
                      color = RED_B)
        <span style="color: #BA36A5;">cerolabel</span> = Tex(<span style="color: #008000;">'$0$'</span>, font_size=32, color=YELLOW).scale(1.3)
        cerolabel.next_to(ax.c2p(0,0), DOWN)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""N&#243;tese que en el caso en que</span>
<span style="color: #008000;">        alfa es cero, empleamos como recta el eje vertical."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(eje_y),
                      Indicate(cerolabel),
                      run_time=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(Indicate(eje_y),
                      run_time=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(FadeOut(eje_y),
                      FadeOut(cerolabel))
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Esta interpretaci&#243;n del producto</span>
<span style="color: #008000;">        entre n&#250;meros reales, que caracteriza las rectas en funci&#243;n de</span>
<span style="color: #008000;">        la proporci&#243;n entre las coordenadas de sus puntos, nos va a</span>
<span style="color: #008000;">        permitir interpretar el producto de un vector por un</span>
<span style="color: #008000;">        escalar. Ve&#225;moslo"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(recta,
                             h_line,
                             v_line,
                             xlabel,
                             ylabel,
                             prod_label,
                             eq_recta))

</pre>
</div>
</div>
</div>
