L01_V04-ProductoDeUnVectorPorUnEscalar.org
** Escena 3 - Interpretación geométrica del producto de vectores de de $\mathbb{R}^2$

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena=" 3")

# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="3")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E03_InterpretacionGeometricaDelProductoPorEscalaresR2.mp4]]

#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V04_ProductoDeUnVectorPorUnEscalar.py
class L01_V04_E03_InterpretacionGeometricaDelProductoPorEscalaresR2(MiEscenaConVoz):    
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )       
        #self.set_speech_service(GTTSService(lang="es", tld="com"))        
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"""\usepackage{nacal} """)

        self.creditos(7)
        	
        cabecera = Tex(_("Interpretación geométrica del producto de vectores en $\R[2]$"),
                            tex_template = myTemplate,
                            font_size=60).scale_to_fit_width(config.frame_width*.9).to_edge(UP).set_color(BLUE)        
        self.add(cabecera)
        self.pausa_corta()

        axes = NumberPlane(x_range=(-8, 8, 1),
                           y_range=(-7, 7, 1),
                           background_line_style={
                               "stroke_width":  3,
                               "stroke_opacity": 0.4 }
                           ).add_coordinates()

        with self.voiceover(text=_("""Ahora ya podemos dar una
        sencilla interpretación geométrica del reescalado de
        vectores""")) as tracker: self.pausa(tracker.duration)

        with self.voiceover(text=_("""Comencemos por el producto de un vector no nulo de
        R 2. Consideremos dos casos.""")) as tracker:
            self.play(FadeIn(axes),
                      FadeOut(cabecera),
                      run_time=tracker.duration)

        eje_y =  Line(start = [0, -5, 0.],
                      end   = [0,  5, 0.],
                      color = RED_B)
        
        b  = nc.Vector([0,sp.symbols('a_2')])
        escalar = sp.symbols('\lambda')
        w  = b*escalar
        lv = MathTex(r"\lambda\,\Vect{a} = ",  tex_template = myTemplate)
        s4 = MathTex(w.latex(),  tex_template = myTemplate)
        s5 = MathTex(r";\qquad a_2\ne0",  tex_template = myTemplate)
        grp2 = VGroup(lv, s4, s5).arrange(RIGHT).to_corner(UL)
        
        c       = VectorR2([0,2.5], color=RED_A)
        dotc = c.dot(axes)
        dotc2 = dotc.copy()
        flechac = c.arrow(axes)
        flechac2 = flechac.copy()
        d       = VectorR2([0,4.5], color=RED_A)
        dotd = d.dot(axes)
        flechad = d.arrow(axes)
        e       = VectorR2([0,-4.5], color=RED_A)
        dote = e.dot(axes)
        flechae = e.arrow(axes)

        with self.voiceover(text=_("""Por una parte, si la primera componente de un vector no nulo es
        cero,  el conjunto de sus múltiplos constituye el eje vertical.""")) as tracker:
            self.play(FadeIn(grp2),
                      FadeIn(dotc),
                      run_time=tracker.duration/2)
            self.play(Transform(dotc,
                                dotd),
                      run_time=tracker.duration/7)
            self.play(Transform(dotc,
                                dote),
                      run_time=tracker.duration/7)
            self.play(Transform(dotc,
                                dotc2),
                      run_time=tracker.duration/7)
            self.remove(dotc),
            self.play(Wiggle(eje_y),
                      run_time=1.5)
            self.pausa()
            self.play(FadeOut(grp2,eje_y))

        Vect1 = nc.Vector([4,2])
        vect1 = VectorR2(Vect1.lista, rpr='colum', color=BLUE_B)
        vect1_dot = vect1.dot(axes, radio=0.05)
        vect1_tex = vect1.tex
        vgr_vect1 = VGroup(vect1.tex).next_to(vect1_dot, RIGHT, buff=0.25)
        vect1_v_line = vect1.v_line(axes)
        vect1_h_line = vect1.h_line(axes)
        vect1_flecha = vect1.arrow(axes)

        a = nc.Vector(sp.symbols('a:3')[1:])
        escalar = sp.symbols('\lambda')
        v  = a*escalar
        lv = MathTex(r"\lambda\,\Vect{a} = ",  tex_template = myTemplate)
        s1 = MathTex(v.latex(),  tex_template = myTemplate)
        s2 = MathTex(r";\qquad",  tex_template = myTemplate)
        s3 = MathTex(r"a_1\ne0",  tex_template = myTemplate)
        grp1 = VGroup(lv, s1, s2, s3).arrange(RIGHT).to_corner(UL)
        
        with self.voiceover(text=_("""Y ahora consideremos cualquier otro vector no nulo de
        R 2.""")) as tracker:
            self.play(FadeIn(grp1))
            self.pausa()

        with self.voiceover(text=_("""Por ejemplo el 4 2""")) as tracker:
            self.play(FadeIn(vect1_dot, vect1_tex, vect1_v_line, vect1_h_line))
            self.pausa()
    
        with self.voiceover(text=_("""Al reescalarlo, aplicamos el mismo factor a todas sus
        componentes""")) as tracker:
            self.play(Indicate(grp1[1][0][1]),
                      Indicate(grp1[1][0][4]),
                      run_time=tracker.duration)
            self.pausa()

        Vect2 = Vect1*(nc.fracc(1,2))
        vect2 = VectorR2(Vect2.lista, rpr='colum', color=BLUE_B)
        vect2_dot = vect2.dot(axes, radio=0.05)
        vect2_tex = vect2.tex
        vgr_vect2 = VGroup(vect2.tex).next_to(vect2_dot, RIGHT, buff=0.25)
        vect2_v_line = vect2.v_line(axes)
        vect2_h_line = vect2.h_line(axes)
        vect2_flecha = vect2.arrow(axes)

        with self.voiceover(text=_("""Así, si multiplicamos el vector por un medio, reducimos sus
        componentes a la mitad.""")) as tracker:
            self.play(TransformFromCopy(vect1_dot,
                                        vect2_dot),
                      TransformFromCopy(vect1_tex,
                                        vect2_tex),
                      TransformFromCopy(vect1_v_line,
                                        vect2_v_line),
                      TransformFromCopy(vect1_h_line,
                                        vect2_h_line),
                      run_time=tracker.duration/2)            

        Vect3 = Vect2*3
        vect3 = VectorR2(Vect3.lista, rpr='colum', color=BLUE_B)
        vect3_dot = vect3.dot(axes, radio=0.05)
        vect3_tex = vect3.tex
        vgr_vect3 = VGroup(vect3.tex).next_to(vect3_dot, RIGHT, buff=0.25)
        vect3_v_line = vect3.v_line(axes)
        vect3_h_line = vect3.h_line(axes)
        vect3_flecha = vect3.arrow(axes)

        with self.voiceover(text=_("""Si ahora lo multiplicamos por tres, triplicamos sus
        componentes.""")) as tracker:
            self.play(TransformFromCopy(vect2_dot,
                                        vect3_dot),
                      TransformFromCopy(vect2_tex,
                                        vect3_tex),
                      TransformFromCopy(vect2_v_line,
                                        vect3_v_line),
                      TransformFromCopy(vect2_h_line,
                                        vect3_h_line),
                      run_time=tracker.duration/2)

        Vect4 = Vect3*nc.fracc(-2,3)
        vect4 = VectorR2(Vect4.lista, rpr='colum', color=BLUE_B)
        vect4_dot = vect4.dot(axes, radio=0.05)
        vect4_tex = vect4.tex
        vgr_vect4 = VGroup(vect4.tex).next_to(vect4_dot, LEFT, buff=0.25)
        vect4_v_line = vect4.v_line(axes)
        vect4_h_line = vect4.h_line(axes)
        vect4_flecha = vect4.arrow(axes)

        Vect5 = Vect3*nc.fracc(-1,3)
        vect5 = VectorR2(Vect5.lista, rpr='colum', color=BLUE_B)
        vect5_dot = vect5.dot(axes, radio=0.05)
        vect5_tex = vect5.tex
        vgr_vect5 = VGroup(vect5.tex).next_to(vect5_dot, LEFT, buff=0.25)
        vect5_v_line = vect5.v_line(axes)
        vect5_h_line = vect5.h_line(axes)
        vect5_flecha = vect5.arrow(axes)

        Vect6 = Vect3*(-1)
        vect6 = VectorR2(Vect6.lista, rpr='colum', color=BLUE_B)
        vect6_dot = vect6.dot(axes, radio=0.06)
        vect6_tex = vect6.tex
        vgr_vect6 = VGroup(vect6.tex).next_to(vect6_dot, LEFT, buff=0.26)
        vect6_v_line = vect6.v_line(axes)
        vect6_h_line = vect6.h_line(axes)
        vect6_flecha = vect6.arrow(axes)

        with self.voiceover(text=_("""Y si lo multiplicamos por algún número negativo, cambiamos el
        signo de sus componentes.""")) as tracker:
            self.play(TransformFromCopy(vect3_dot,
                                        vect4_dot),
                      TransformFromCopy(vect3_tex,
                                        vect4_tex),
                      TransformFromCopy(vect3_v_line,
                                        vect4_v_line),
                      TransformFromCopy(vect3_h_line,
                                        vect4_h_line),
                      TransformFromCopy(vect3_dot,
                                        vect5_dot),
                      TransformFromCopy(vect3_tex,
                                        vect5_tex),
                      TransformFromCopy(vect3_v_line,
                                        vect5_v_line),
                      TransformFromCopy(vect3_h_line,
                                        vect5_h_line),
                      TransformFromCopy(vect3_dot,
                                        vect6_dot),
                      TransformFromCopy(vect3_tex,
                                        vect6_tex),
                      TransformFromCopy(vect3_v_line,
                                        vect6_v_line),
                      TransformFromCopy(vect3_h_line,
                                        vect6_h_line),
                      run_time=tracker.duration/2)
            
        Vect0 = Vect3*0
        vect0 = VectorR2(Vect0.lista, rpr='colum', color=BLUE_B)
        vect0_dot = vect0.dot(axes, radio=0.05)
        vect0_tex = vect0.tex
        vgr_vect0 = VGroup(vect0.tex).next_to(vect0_dot, RIGHT, buff=0.25)
        
        with self.voiceover(text=_("""Además, cualquier vector
        multiplicado por cero es un vector nulo.""")) as tracker:            
            self.play(TransformFromCopy(vect1_dot,
                                vect0_dot),
                      TransformFromCopy(vect1_tex,
                                vect0_tex),
                      run_time=tracker.duration/2)
            
        p1 = MathTex(r"\frac{\lambda a_2}{\lambda a_1}=",
                     tex_template = myTemplate)
        p2 = MathTex(r"\frac{a_2}{a_1};\qquad ",
                     tex_template = myTemplate)
        p3 = MathTex(r"\lambda\ne0",
                     tex_template = myTemplate)
        pendiente = VGroup(p1,
                           p2,
                           p3).arrange(RIGHT).next_to(grp1,
                                                      DOWN,
                                                      buff=0.7).scale(.9)
        
        with self.voiceover(text=_("""Nótese que si el escalar es distinto de cero, la
        proporcionalidad entre ambas componentes se mantiene, pues ambas componentes se
        multiplican por el mismo número.""")) as tracker:
            self.add(pendiente[-1])
            self.wait(tracker.duration/2)
            self.pausa(tracker.duration/6)
            self.play(Flash(grp1[1][0][1]),
                      Flash(grp1[1][0][4]),
                      run_time=tracker.duration/3)
                    
        with self.voiceover(text=_("""En el ejemplo, las primeras componentes son el doble de las
        segundas.""")) as tracker:
            self.wait(tracker.duration/2)
            
        with self.voiceover(text=_("""Atendiendo a la interpretación
        geométrica del producto entre números reales que vimos
        anteriormente,""")) as tracker:
            
            self.wait(tracker.duration)
            
        with self.voiceover(text=_("""sabemos que, los puntos que comparten
        idéntica proporción entre sus coordenadas vertical y
        horizontal, constituyen una recta que pasa por el origen.""")) as tracker:
            
            self.play(FadeIn(pendiente[0:-1]),
                      run_time=tracker.duration/6)
            self.wait(tracker.duration/6)
            self.play(Indicate(vect1_h_line),
                      Indicate(vect2_h_line),
                      Indicate(vect3_h_line),
                      Indicate(vect4_h_line),
                      Indicate(vect5_h_line),
                      Indicate(vect6_h_line),
                      Circumscribe(pendiente[0][0][:3]),
                      run_time=tracker.duration/6)
            self.play(Indicate(vect1_v_line),
                      Indicate(vect2_v_line),
                      Indicate(vect3_v_line),
                      Indicate(vect4_v_line),
                      Indicate(vect5_v_line),
                      Indicate(vect6_v_line),
                      Circumscribe(pendiente[0][0][4:-1]),
                      run_time=tracker.duration/6)
            self.play(FadeOut(vect1_v_line,
                              vect2_v_line,
                              vect3_v_line,
                              vect4_v_line,
                              vect5_v_line,
                              vect6_v_line,
                              vect1_h_line,
                              vect2_h_line,
                              vect3_h_line,
                              vect4_h_line,
                              vect5_h_line,
                              vect6_h_line,
                              vect0_tex,
                              vect1_tex,
                              vect2_tex,
                              vect3_tex,
                              vect4_tex,
                              vect5_tex,
                              vect6_tex),
                      run_time=tracker.duration*1/6)
                

            a = nc.Vector(sp.symbols('a:3')[1:])
            escalar = sp.symbols('\lambda')
            v  = a*escalar
            lv = MathTex(r"\lambda\,\Vect{a} = ",  tex_template = myTemplate)
            s1 = MathTex(v.latex(),  tex_template = myTemplate)
            s2 = MathTex(r";\qquad",  tex_template = myTemplate)
            s3 = MathTex(r"a_1\ne0",  tex_template = myTemplate)
            grp1 = VGroup(lv, s1, s2, s3).arrange(RIGHT).to_corner(UL).scale(.9)
            
            b  = nc.Vector([0,sp.symbols('a_2')])
            w  = b*escalar
            s4 = MathTex(w.latex(),  tex_template = myTemplate)
            s5 = MathTex(r"a_1=0",  tex_template = myTemplate)
            grp2 = VGroup(lv, s4).arrange(RIGHT).to_corner(UL).scale(.9)
            
            recta =  Line(start = [-8, -4, 0.],
                          end   = [8, 4, 0.],
                          color = BLUE_B)
        
            self.play(FadeOut(vect1_dot,
                              vect2_dot,
                              vect3_dot,
                              vect4_dot,
                              vect5_dot,
                              vect6_dot),
                      Indicate(recta, scale_factor=5))

        self.pausa()

        resumen1 = Tex(_(r"""El conjunto de múltiplos de un vector no nulo de \R[2]"""),
                       tex_template = myTemplate)
        resumen2 = Tex(_(r"""se corresponde con una recta que pasa por el origen."""),
                       tex_template = myTemplate).next_to(resumen1, DOWN)
            
        with self.voiceover(text=_("""Por tanto, el conjunto de
        múltiplos de cualquier vector no nulo de R 2 corresponde a
        una recta que pasa por el origen.""")) as tracker:
            
            self.play(*[FadeOut(mob)for mob in self.mobjects] )            
            self.play(Write(resumen1))
            self.play(Write(resumen2))
            
        self.pausa(3)
            
#+END_SRC


#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena=" 3")

# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="3")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E03_InterpretacionGeometricaDelProductoPorEscalaresR2.mp4]]


