L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-org702ea04" class="outline-3">
<h3 id="org702ea04"><span class="section-number-3">1.3.</span> Escena 3 - Interpretación geométrica del producto de vectores de de \(\mathbb{R}^2\)</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V04_E03_InterpretacionGeometricaDelProductoPorEscalaresR2</span>(MiEscenaConVoz):    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )       
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))        </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"""\usepackage{nacal} """</span>)

        <span style="color: #0000FF;">self</span>.creditos(7)
                
        <span style="color: #BA36A5;">cabecera</span> = Tex(_(<span style="color: #008000;">"Interpretaci&#243;n geom&#233;trica del producto de vectores en $\R[2]$"</span>),
                            tex_template = myTemplate,
                            font_size=60).scale_to_fit_width(config.frame_width*.9).to_edge(UP).set_color(BLUE)        
        <span style="color: #0000FF;">self</span>.add(cabecera)
        <span style="color: #0000FF;">self</span>.pausa_corta()

        <span style="color: #BA36A5;">axes</span> = NumberPlane(x_range=(-8, 8, 1),
                           y_range=(-7, 7, 1),
                           background_line_style={
                               <span style="color: #008000;">"stroke_width"</span>:  3,
                               <span style="color: #008000;">"stroke_opacity"</span>: 0.4 }
                           ).add_coordinates()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Ahora ya podemos dar una</span>
<span style="color: #008000;">        sencilla interpretaci&#243;n geom&#233;trica del reescalado de</span>
<span style="color: #008000;">        vectores"""</span>)) <span style="color: #0000FF;">as</span> tracker: <span style="color: #0000FF;">self</span>.pausa(tracker.duration)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Comencemos por el producto de un vector no nulo de</span>
<span style="color: #008000;">        R 2. Consideremos dos casos."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(axes),
                      FadeOut(cabecera),
                      run_time=tracker.duration)

        <span style="color: #BA36A5;">eje_y</span> =  Line(start = [0, -5, 0.],
                      end   = [0,  5, 0.],
                      color = RED_B)
        
        <span style="color: #BA36A5;">b</span>  = nc.Vector([0,sp.symbols(<span style="color: #008000;">'a_2'</span>)])
        <span style="color: #BA36A5;">escalar</span> = sp.symbols(<span style="color: #008000;">'\lambda'</span>)
        <span style="color: #BA36A5;">w</span>  = b*escalar
        <span style="color: #BA36A5;">lv</span> = MathTex(r<span style="color: #008000;">"\lambda\,\Vect{a} = "</span>,  tex_template = myTemplate)
        <span style="color: #BA36A5;">s4</span> = MathTex(w.latex(),  tex_template = myTemplate)
        <span style="color: #BA36A5;">s5</span> = MathTex(r<span style="color: #008000;">";\qquad a_2\ne0"</span>,  tex_template = myTemplate)
        <span style="color: #BA36A5;">grp2</span> = VGroup(lv, s4, s5).arrange(RIGHT).to_corner(UL)
        
        <span style="color: #BA36A5;">c</span>       = VectorR2([0,2.5], color=RED_A)
        <span style="color: #BA36A5;">dotc</span> = c.dot(axes)
        <span style="color: #BA36A5;">dotc2</span> = dotc.copy()
        <span style="color: #BA36A5;">flechac</span> = c.arrow(axes)
        <span style="color: #BA36A5;">flechac2</span> = flechac.copy()
        <span style="color: #BA36A5;">d</span>       = VectorR2([0,4.5], color=RED_A)
        <span style="color: #BA36A5;">dotd</span> = d.dot(axes)
        <span style="color: #BA36A5;">flechad</span> = d.arrow(axes)
        <span style="color: #BA36A5;">e</span>       = VectorR2([0,-4.5], color=RED_A)
        <span style="color: #BA36A5;">dote</span> = e.dot(axes)
        <span style="color: #BA36A5;">flechae</span> = e.arrow(axes)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por una parte, si la primera componente de un vector no nulo es</span>
<span style="color: #008000;">        cero,  el conjunto de sus m&#250;ltiplos constituye el eje vertical."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp2),
                      FadeIn(dotc),
                      run_time=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(Transform(dotc,
                                dotd),
                      run_time=tracker.duration/7)
            <span style="color: #0000FF;">self</span>.play(Transform(dotc,
                                dote),
                      run_time=tracker.duration/7)
            <span style="color: #0000FF;">self</span>.play(Transform(dotc,
                                dotc2),
                      run_time=tracker.duration/7)
            <span style="color: #0000FF;">self</span>.remove(dotc),
            <span style="color: #0000FF;">self</span>.play(Wiggle(eje_y),
                      run_time=1.5)
            <span style="color: #0000FF;">self</span>.pausa()
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp2,eje_y))

        <span style="color: #BA36A5;">Vect1</span> = nc.Vector([4,2])
        <span style="color: #BA36A5;">vect1</span> = VectorR2(Vect1.lista, rpr=<span style="color: #008000;">'colum'</span>, color=BLUE_B)
        <span style="color: #BA36A5;">vect1_dot</span> = vect1.dot(axes, radio=0.05)
        <span style="color: #BA36A5;">vect1_tex</span> = vect1.tex
        <span style="color: #BA36A5;">vgr_vect1</span> = VGroup(vect1.tex).next_to(vect1_dot, RIGHT, buff=0.25)
        <span style="color: #BA36A5;">vect1_v_line</span> = vect1.v_line(axes)
        <span style="color: #BA36A5;">vect1_h_line</span> = vect1.h_line(axes)
        <span style="color: #BA36A5;">vect1_flecha</span> = vect1.arrow(axes)

        <span style="color: #BA36A5;">a</span> = nc.Vector(sp.symbols(<span style="color: #008000;">'a:3'</span>)[1:])
        <span style="color: #BA36A5;">escalar</span> = sp.symbols(<span style="color: #008000;">'\lambda'</span>)
        <span style="color: #BA36A5;">v</span>  = a*escalar
        <span style="color: #BA36A5;">lv</span> = MathTex(r<span style="color: #008000;">"\lambda\,\Vect{a} = "</span>,  tex_template = myTemplate)
        <span style="color: #BA36A5;">s1</span> = MathTex(v.latex(),  tex_template = myTemplate)
        <span style="color: #BA36A5;">s2</span> = MathTex(r<span style="color: #008000;">";\qquad"</span>,  tex_template = myTemplate)
        <span style="color: #BA36A5;">s3</span> = MathTex(r<span style="color: #008000;">"a_1\ne0"</span>,  tex_template = myTemplate)
        <span style="color: #BA36A5;">grp1</span> = VGroup(lv, s1, s2, s3).arrange(RIGHT).to_corner(UL)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y ahora consideremos cualquier otro vector no nulo de</span>
<span style="color: #008000;">        R 2."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1))
            <span style="color: #0000FF;">self</span>.pausa()

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por ejemplo el 4 2"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(FadeIn(vect1_dot, vect1_tex, vect1_v_line, vect1_h_line))
            <span style="color: #0000FF;">self</span>.pausa()
    
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Al reescalarlo, aplicamos el mismo factor a todas sus</span>
<span style="color: #008000;">        componentes"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Indicate(grp1[1][0][1]),
                      Indicate(grp1[1][0][4]),
                      run_time=tracker.duration)
            <span style="color: #0000FF;">self</span>.pausa()

        <span style="color: #BA36A5;">Vect2</span> = Vect1*(nc.fracc(1,2))
        <span style="color: #BA36A5;">vect2</span> = VectorR2(Vect2.lista, rpr=<span style="color: #008000;">'colum'</span>, color=BLUE_B)
        <span style="color: #BA36A5;">vect2_dot</span> = vect2.dot(axes, radio=0.05)
        <span style="color: #BA36A5;">vect2_tex</span> = vect2.tex
        <span style="color: #BA36A5;">vgr_vect2</span> = VGroup(vect2.tex).next_to(vect2_dot, RIGHT, buff=0.25)
        <span style="color: #BA36A5;">vect2_v_line</span> = vect2.v_line(axes)
        <span style="color: #BA36A5;">vect2_h_line</span> = vect2.h_line(axes)
        <span style="color: #BA36A5;">vect2_flecha</span> = vect2.arrow(axes)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""As&#237;, si multiplicamos el vector por un medio, reducimos sus</span>
<span style="color: #008000;">        componentes a la mitad."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(TransformFromCopy(vect1_dot,
                                        vect2_dot),
                      TransformFromCopy(vect1_tex,
                                        vect2_tex),
                      TransformFromCopy(vect1_v_line,
                                        vect2_v_line),
                      TransformFromCopy(vect1_h_line,
                                        vect2_h_line),
                      run_time=tracker.duration/2)            

        <span style="color: #BA36A5;">Vect3</span> = Vect2*3
        <span style="color: #BA36A5;">vect3</span> = VectorR2(Vect3.lista, rpr=<span style="color: #008000;">'colum'</span>, color=BLUE_B)
        <span style="color: #BA36A5;">vect3_dot</span> = vect3.dot(axes, radio=0.05)
        <span style="color: #BA36A5;">vect3_tex</span> = vect3.tex
        <span style="color: #BA36A5;">vgr_vect3</span> = VGroup(vect3.tex).next_to(vect3_dot, RIGHT, buff=0.25)
        <span style="color: #BA36A5;">vect3_v_line</span> = vect3.v_line(axes)
        <span style="color: #BA36A5;">vect3_h_line</span> = vect3.h_line(axes)
        <span style="color: #BA36A5;">vect3_flecha</span> = vect3.arrow(axes)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Si ahora lo multiplicamos por tres, triplicamos sus</span>
<span style="color: #008000;">        componentes."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(TransformFromCopy(vect2_dot,
                                        vect3_dot),
                      TransformFromCopy(vect2_tex,
                                        vect3_tex),
                      TransformFromCopy(vect2_v_line,
                                        vect3_v_line),
                      TransformFromCopy(vect2_h_line,
                                        vect3_h_line),
                      run_time=tracker.duration/2)

        <span style="color: #BA36A5;">Vect4</span> = Vect3*nc.fracc(-2,3)
        <span style="color: #BA36A5;">vect4</span> = VectorR2(Vect4.lista, rpr=<span style="color: #008000;">'colum'</span>, color=BLUE_B)
        <span style="color: #BA36A5;">vect4_dot</span> = vect4.dot(axes, radio=0.05)
        <span style="color: #BA36A5;">vect4_tex</span> = vect4.tex
        <span style="color: #BA36A5;">vgr_vect4</span> = VGroup(vect4.tex).next_to(vect4_dot, LEFT, buff=0.25)
        <span style="color: #BA36A5;">vect4_v_line</span> = vect4.v_line(axes)
        <span style="color: #BA36A5;">vect4_h_line</span> = vect4.h_line(axes)
        <span style="color: #BA36A5;">vect4_flecha</span> = vect4.arrow(axes)

        <span style="color: #BA36A5;">Vect5</span> = Vect3*nc.fracc(-1,3)
        <span style="color: #BA36A5;">vect5</span> = VectorR2(Vect5.lista, rpr=<span style="color: #008000;">'colum'</span>, color=BLUE_B)
        <span style="color: #BA36A5;">vect5_dot</span> = vect5.dot(axes, radio=0.05)
        <span style="color: #BA36A5;">vect5_tex</span> = vect5.tex
        <span style="color: #BA36A5;">vgr_vect5</span> = VGroup(vect5.tex).next_to(vect5_dot, LEFT, buff=0.25)
        <span style="color: #BA36A5;">vect5_v_line</span> = vect5.v_line(axes)
        <span style="color: #BA36A5;">vect5_h_line</span> = vect5.h_line(axes)
        <span style="color: #BA36A5;">vect5_flecha</span> = vect5.arrow(axes)

        <span style="color: #BA36A5;">Vect6</span> = Vect3*(-1)
        <span style="color: #BA36A5;">vect6</span> = VectorR2(Vect6.lista, rpr=<span style="color: #008000;">'colum'</span>, color=BLUE_B)
        <span style="color: #BA36A5;">vect6_dot</span> = vect6.dot(axes, radio=0.06)
        <span style="color: #BA36A5;">vect6_tex</span> = vect6.tex
        <span style="color: #BA36A5;">vgr_vect6</span> = VGroup(vect6.tex).next_to(vect6_dot, LEFT, buff=0.26)
        <span style="color: #BA36A5;">vect6_v_line</span> = vect6.v_line(axes)
        <span style="color: #BA36A5;">vect6_h_line</span> = vect6.h_line(axes)
        <span style="color: #BA36A5;">vect6_flecha</span> = vect6.arrow(axes)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y si lo multiplicamos por alg&#250;n n&#250;mero negativo, cambiamos el</span>
<span style="color: #008000;">        signo de sus componentes."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(TransformFromCopy(vect3_dot,
                                        vect4_dot),
                      TransformFromCopy(vect3_tex,
                                        vect4_tex),
                      TransformFromCopy(vect3_v_line,
                                        vect4_v_line),
                      TransformFromCopy(vect3_h_line,
                                        vect4_h_line),
                      TransformFromCopy(vect3_dot,
                                        vect5_dot),
                      TransformFromCopy(vect3_tex,
                                        vect5_tex),
                      TransformFromCopy(vect3_v_line,
                                        vect5_v_line),
                      TransformFromCopy(vect3_h_line,
                                        vect5_h_line),
                      TransformFromCopy(vect3_dot,
                                        vect6_dot),
                      TransformFromCopy(vect3_tex,
                                        vect6_tex),
                      TransformFromCopy(vect3_v_line,
                                        vect6_v_line),
                      TransformFromCopy(vect3_h_line,
                                        vect6_h_line),
                      run_time=tracker.duration/2)
            
        <span style="color: #BA36A5;">Vect0</span> = Vect3*0
        <span style="color: #BA36A5;">vect0</span> = VectorR2(Vect0.lista, rpr=<span style="color: #008000;">'colum'</span>, color=BLUE_B)
        <span style="color: #BA36A5;">vect0_dot</span> = vect0.dot(axes, radio=0.05)
        <span style="color: #BA36A5;">vect0_tex</span> = vect0.tex
        <span style="color: #BA36A5;">vgr_vect0</span> = VGroup(vect0.tex).next_to(vect0_dot, RIGHT, buff=0.25)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Adem&#225;s, cualquier vector</span>
<span style="color: #008000;">        multiplicado por cero es un vector nulo."""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            <span style="color: #0000FF;">self</span>.play(TransformFromCopy(vect1_dot,
                                vect0_dot),
                      TransformFromCopy(vect1_tex,
                                vect0_tex),
                      run_time=tracker.duration/2)
            
        <span style="color: #BA36A5;">p1</span> = MathTex(r<span style="color: #008000;">"\frac{\lambda a_2}{\lambda a_1}="</span>,
                     tex_template = myTemplate)
        <span style="color: #BA36A5;">p2</span> = MathTex(r<span style="color: #008000;">"\frac{a_2}{a_1};\qquad "</span>,
                     tex_template = myTemplate)
        <span style="color: #BA36A5;">p3</span> = MathTex(r<span style="color: #008000;">"\lambda\ne0"</span>,
                     tex_template = myTemplate)
        <span style="color: #BA36A5;">pendiente</span> = VGroup(p1,
                           p2,
                           p3).arrange(RIGHT).next_to(grp1,
                                                      DOWN,
                                                      buff=0.7).scale(.9)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""N&#243;tese que si el escalar es distinto de cero, la</span>
<span style="color: #008000;">        proporcionalidad entre ambas componentes se mantiene, pues ambas componentes se</span>
<span style="color: #008000;">        multiplican por el mismo n&#250;mero."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.add(pendiente[-1])
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/2)
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/6)
            <span style="color: #0000FF;">self</span>.play(Flash(grp1[1][0][1]),
                      Flash(grp1[1][0][4]),
                      run_time=tracker.duration/3)
                    
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""En el ejemplo, las primeras componentes son el doble de las</span>
<span style="color: #008000;">        segundas."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/2)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Atendiendo a la interpretaci&#243;n</span>
<span style="color: #008000;">        geom&#233;trica del producto entre n&#250;meros reales que vimos</span>
<span style="color: #008000;">        anteriormente,"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.wait(tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""sabemos que, los puntos que comparten</span>
<span style="color: #008000;">        id&#233;ntica proporci&#243;n entre sus coordenadas vertical y</span>
<span style="color: #008000;">        horizontal, constituyen una recta que pasa por el origen."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(pendiente[0:-1]),
                      run_time=tracker.duration/6)
            <span style="color: #0000FF;">self</span>.wait(tracker.duration/6)
            <span style="color: #0000FF;">self</span>.play(Indicate(vect1_h_line),
                      Indicate(vect2_h_line),
                      Indicate(vect3_h_line),
                      Indicate(vect4_h_line),
                      Indicate(vect5_h_line),
                      Indicate(vect6_h_line),
                      Circumscribe(pendiente[0][0][:3]),
                      run_time=tracker.duration/6)
            <span style="color: #0000FF;">self</span>.play(Indicate(vect1_v_line),
                      Indicate(vect2_v_line),
                      Indicate(vect3_v_line),
                      Indicate(vect4_v_line),
                      Indicate(vect5_v_line),
                      Indicate(vect6_v_line),
                      Circumscribe(pendiente[0][0][4:-1]),
                      run_time=tracker.duration/6)
            <span style="color: #0000FF;">self</span>.play(FadeOut(vect1_v_line,
                              vect2_v_line,
                              vect3_v_line,
                              vect4_v_line,
                              vect5_v_line,
                              vect6_v_line,
                              vect1_h_line,
                              vect2_h_line,
                              vect3_h_line,
                              vect4_h_line,
                              vect5_h_line,
                              vect6_h_line,
                              vect0_tex,
                              vect1_tex,
                              vect2_tex,
                              vect3_tex,
                              vect4_tex,
                              vect5_tex,
                              vect6_tex),
                      run_time=tracker.duration*1/6)
                

            <span style="color: #BA36A5;">a</span> = nc.Vector(sp.symbols(<span style="color: #008000;">'a:3'</span>)[1:])
            <span style="color: #BA36A5;">escalar</span> = sp.symbols(<span style="color: #008000;">'\lambda'</span>)
            <span style="color: #BA36A5;">v</span>  = a*escalar
            <span style="color: #BA36A5;">lv</span> = MathTex(r<span style="color: #008000;">"\lambda\,\Vect{a} = "</span>,  tex_template = myTemplate)
            <span style="color: #BA36A5;">s1</span> = MathTex(v.latex(),  tex_template = myTemplate)
            <span style="color: #BA36A5;">s2</span> = MathTex(r<span style="color: #008000;">";\qquad"</span>,  tex_template = myTemplate)
            <span style="color: #BA36A5;">s3</span> = MathTex(r<span style="color: #008000;">"a_1\ne0"</span>,  tex_template = myTemplate)
            <span style="color: #BA36A5;">grp1</span> = VGroup(lv, s1, s2, s3).arrange(RIGHT).to_corner(UL).scale(.9)
            
            <span style="color: #BA36A5;">b</span>  = nc.Vector([0,sp.symbols(<span style="color: #008000;">'a_2'</span>)])
            <span style="color: #BA36A5;">w</span>  = b*escalar
            <span style="color: #BA36A5;">s4</span> = MathTex(w.latex(),  tex_template = myTemplate)
            <span style="color: #BA36A5;">s5</span> = MathTex(r<span style="color: #008000;">"a_1=0"</span>,  tex_template = myTemplate)
            <span style="color: #BA36A5;">grp2</span> = VGroup(lv, s4).arrange(RIGHT).to_corner(UL).scale(.9)
            
            <span style="color: #BA36A5;">recta</span> =  Line(start = [-8, -4, 0.],
                          end   = [8, 4, 0.],
                          color = BLUE_B)
        
            <span style="color: #0000FF;">self</span>.play(FadeOut(vect1_dot,
                              vect2_dot,
                              vect3_dot,
                              vect4_dot,
                              vect5_dot,
                              vect6_dot),
                      Indicate(recta, scale_factor=5))

        <span style="color: #0000FF;">self</span>.pausa()

        <span style="color: #BA36A5;">resumen1</span> = Tex(_(r<span style="color: #008000;">"""El conjunto de m&#250;ltiplos de un vector no nulo de \R[2]"""</span>),
                       tex_template = myTemplate)
        <span style="color: #BA36A5;">resumen2</span> = Tex(_(r<span style="color: #008000;">"""se corresponde con una recta que pasa por el origen."""</span>),
                       tex_template = myTemplate).next_to(resumen1, DOWN)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por tanto, el conjunto de</span>
<span style="color: #008000;">        m&#250;ltiplos de cualquier vector no nulo de R 2 corresponde a</span>
<span style="color: #008000;">        una recta que pasa por el origen."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(*[FadeOut(mob)<span style="color: #0000FF;">for</span> mob <span style="color: #0000FF;">in</span> <span style="color: #0000FF;">self</span>.mobjects] )            
            <span style="color: #0000FF;">self</span>.play(Write(resumen1))
            <span style="color: #0000FF;">self</span>.play(Write(resumen2))
            
        <span style="color: #0000FF;">self</span>.pausa(3)
            
</pre>
</div>
</div>
</div>
