L01_V04-ProductoDeUnVectorPorUnEscalar.org
** Escena 4 - Interpretación geométrica del producto de tres números (3D)

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena=" 4")

# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="4")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E04_3D_InterpretacionGeometricaDelProductoDeTresNumeros.mp4]]

