L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-org76fb258" class="outline-3">
<h3 id="org76fb258"><span class="section-number-3">1.4.</span> Escena 4 - Interpretación geométrica del producto de tres números (3D)</h3>
<div class="outline-text-3" id="text-1-4">
</div>
