L01_V04-ProductoDeUnVectorPorUnEscalar.org
*** Escena 3D

#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V04_ProductoDeUnVectorPorUnEscalar.py
class L01_V04_E04_3D_InterpretacionGeometricaDelProductoDeTresNumeros(ThreeDScene):
    
    <<Créditos en distintas partes de la pantalla>>
    
    def construct(self):
        lado = 0.25
        ejes = ThreeDAxes(
            x_range=(-28, 28, 1),
            y_range=(-15, 15, 1),
            z_range=(-10, 10, 1),
            z_length=5,
            x_length=lado*28*2,
            y_length=lado*15*2,
            tips=False,
            axis_config={"include_numbers": True,
                         "font_size": 12},
        )

        def coordenada_x(x, ax, label='', pos=0):
            label = label if label else f"{x}"
            xlabel = Tex(label, font_size=30)
            pos_label = UP if pos else DOWN
            xlabel.next_to(ax.c2p(x,0,0), pos_label, buff=0.35)
            return xlabel

        def coordenada_y(y, ax, label='', pos=0):
            label = label if label else f"{y}"
            ylabel = Tex(label, font_size=30)
            pos_label = RIGHT if pos else LEFT
            ylabel.next_to(ax.c2p(0,y,0), pos_label, buff=0.35)
            return ylabel

        def coordenada_z(z, ax, label='', pos=0):
            label = label if label else f"{z}"
            zlabel = Tex(label, font_size=30)
            pos_label = RIGHT if pos else LEFT
            zlabel.rotate(PI/2, axis=RIGHT).next_to(ax.c2p(0,0,z), pos_label, buff=0.35)
            return zlabel
        
        coordenadas_xy = lambda x,y,ax,labelx='',labely='',posx=0,posy=0: (coordenada_x(x,ax,labelx,posx),
                                                                           coordenada_y(y,ax,labely,posy))

        def ladrillo(a, b, ax: Axes) -> VGroup:
            prisma = Prism(dimensions=[float(a*b*lado), float(b*lado), float(1*lado)],
                         fill_opacity=0.6,
                         stroke_width=1).next_to(ax.coords_to_point(0, 0),
                                                 UR,
                                                 buff=0)
            return Group(*[prisma.copy()])
        
        def pila(a, b, c: int, ax: Axes) -> VGroup:
            columna = Group(*[ladrillo(a, b, ax).shift(s*lado*OUT) for s in range(0,c)]).shift([0, 0, lado/2])
            columna.a = a
            columna.b = b
            columna.c = c
            return columna 
                
        def producto(pila,ritmo=0.6, pausa=8):
            a = float(pila.a)
            b = float(pila.b)
            c = pila.c
            [self.play(piso.animate.shift([0, p*b*lado, 0]), run_time=ritmo) for p,piso in enumerate(pila)]
            for p,piso in enumerate(pila):
                self.play([fila.animate.shift([f*a*lado+p*a*b*lado, 0, 0]) for f,fila in enumerate(piso)], run_time=ritmo) # alineados
            for p,piso in enumerate(pila):
                self.play(piso.animate.shift([0, 0, -p*lado]), run_time=ritmo)
            for p,piso in enumerate(pila):
                self.play([fila.animate.shift([0, -(p*b+f)*lado, 0]) for f,fila in enumerate(piso)], run_time=ritmo)
            self.wait(pausa)
            for p,piso in enumerate(pila):
                self.play(piso.animate.shift([0, 0, p*lado]), run_time=ritmo)
            for p,piso in enumerate(pila):
                self.play([fila.animate.shift([0, (p*b+f)*lado, 0]) for f,fila in enumerate(piso)], run_time=ritmo)
                
        def multiplicación(a, b, c, ax: Axes, pila: VGroup):
            v_line =ax.get_vertical_line(ax.c2p(float(a*b*c),float(b*c),float(c)), color=YELLOW)
            recta =  Line(start = ax.c2p(0,0,float(c)),
                          end   = ax.c2p(float(a*b*c),float(b*c),float(c)))

            self.play(Indicate(recta, scale_factor=2),
                      run_time=2)
            self.play(Indicate(v_line, scale_factor=2),
                      run_time=2)
            self.wait()
            self.play(FadeOut(v_line))

        def multiplicacion3Num(a, b, c, ax: Axes, pila: VGroup):
                Vect = nc.Vector([a*b*c,b*c,c])
                v = VectorR3(Vect.lista, rpr='colum', color=TEAL_A)
                line_x = v.x_line(ejes)
                line_y = v.y_line(ejes)
                line_z = v.z_line(ejes)
                line_xy = v.xy_line(ejes)
                line_v = v.v_line(ejes)
                return line_x,line_y,line_z,line_xy,line_v
        
        self.add(ejes)
        a=2
        b=3
        c=4
        columna = pila(a, b, c, ejes)

        # Set the camera orientation for a better view
        self.set_camera_orientation(theta=-90 * DEGREES,
                                    zoom=3)

        rectangulo = Rectangle(height=lado,
                               width=lado*a).next_to(ejes.coords_to_point(0, 0, 0),
                                                     UR,
                                                     buff=0)
        self.play(FadeIn(rectangulo))

        xlabel=coordenada_x(a, ejes, label=r"$\alpha$")        
        self.play(Indicate(xlabel,scale_factor=1.5),
                  run_time=.5)

        ylabel=coordenada_y(b, ejes, label=r"$\beta$")
        self.play(Indicate(ylabel,scale_factor=1.5),
                  run_time=.5)

        recta0 =  Line(start = ejes.c2p(-10,-5,0),
                      end   = ejes.c2p( 10, 5,0),
                      color = RED_B,).set_opacity(0.5)

        self.wait(2)
        self.play(Indicate(rectangulo),
                  run_time=2)
        
        self.wait(1)
        self.play(FadeIn(recta0))
        self.wait(6)

        pila = columna.copy()

        prodxylabel=coordenada_x(a*b, ejes, label=r"$\alpha\beta$")
        self.play(FadeIn(pila[0][0][0]))
        self.play(Indicate(ylabel,scale_factor=1.5),
                  run_time=1.5)
        self.play(Indicate(prodxylabel,scale_factor=1.5),
                  run_time=1.5)

        self.wait(5) 
        self.move_camera(phi=65 * DEGREES, theta=-65 * DEGREES, zoom=2.5, run_time=2)
        #self.set_camera_orientation(phi=65 * DEGREES, theta=-65 * DEGREES, zoom=2.5)
        
        self.play(Indicate(pila[0][0][0], run_time=1.8),
                  FadeOut(recta0),
                  FadeOut(xlabel),
                  FadeOut(rectangulo))

        self.wait(1)
        self.play(Indicate(prodxylabel,scale_factor=1.5),
                  run_time=1.5)
                
        self.wait(1.5)
        self.play(Indicate(ylabel,scale_factor=1.5),
                  run_time=1.5)
        
        self.wait(1.5)

        # mostramos el prisma
        self.play(FadeIn(pila[0][0][1:]),
                  run_time=1)                

        self.wait(2)
        self.move_camera(zoom=1, run_time=2)
        #self.set_camera_orientation(phi=65 * DEGREES, theta=-65 * DEGREES, zoom=1)
                        
        # mostramos una pila de prismas
        [self.play(FadeIn(piso)) for piso in columna[0:]]
        
        prodZlabel=coordenada_z(c, ejes, label=r"$\gamma$").set_color(YELLOW)
        prodXYZlabel=coordenada_x(a*b*c, ejes, label=r"$\alpha\beta\gamma$").set_color(YELLOW)
        prodYZlabel=coordenada_y(b*c, ejes, label=r"$\beta\gamma$").set_color(YELLOW)
        self.add(prodXYZlabel)
        
        producto(columna, pausa=7)
        self.wait(3)
        
        recta =  Line(start = [float(-a*b*c*lado),float(-b*c*lado),float(-c*lado)],
                      end   = [float(a*b*c*lado),float(b*c*lado),float(c*lado)],
                      color = RED_B)
        self.add(recta)
        
        self.wait(6)
        
        self.play(FadeOut(columna))

        self.wait(3)

        line_x,line_y,line_z,line_xy,line_v = multiplicacion3Num(a, b, c, ejes, columna)        
        self.add(line_x)
        self.add(line_z)
        self.add(line_v)
        self.add(prodZlabel)

        self.wait(3)
        self.play(Indicate(line_z,
                           scale_factor=1.5),
                  Indicate(prodZlabel,
                           scale_factor=2.5))
        self.wait(1.5)        
        self.play(Indicate(line_x,
                           scale_factor=1.5,
                           run_time=2),
                  Indicate(prodXYZlabel,
                           scale_factor=2.5,
                           run_time=2))
        self.wait(12.5)

        self.play(Indicate(line_x,scale_factor=2),
                  Indicate(line_v,scale_factor=2),
                  Indicate(prodXYZlabel,scale_factor=2.5),
                  Indicate(prodZlabel,scale_factor=3),
                  run_time=4)

        self.play(Indicate(line_y,scale_factor=2),
                  Indicate(prodYZlabel,scale_factor=3),
                  Indicate(prodZlabel,scale_factor=3),
                  Indicate(line_v,scale_factor=2),
                  run_time=3.5)
        
        rectaPlanoXY =  Line(start = ejes.c2p(     0,   0, 0),
                             end   = ejes.c2p( a*b*c, b*c, 0),
                             color = BLUE_B).set_opacity(0.5)
        self.add(rectaPlanoXY)
        self.play(Indicate(line_y,scale_factor=2),
                  Indicate(prodXYZlabel,scale_factor=2.5),
                  Indicate(prodYZlabel,scale_factor=3),
                  Indicate(line_x,scale_factor=2),
                  run_time=4)
        
        self.wait(7)

        self.play(Indicate(recta,
                           scale_factor=2.5,
                           run_time=2))

        self.wait(3)
 
        #+END_SRC
       
#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena=" 4")

# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="4")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E04_3D_InterpretacionGeometricaDelProductoDeTresNumeros.mp4]]


