L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-org6f84c31" class="outline-4">
<h4 id="org6f84c31"><span class="section-number-4">1.4.1.</span> Escena 3D</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V04_E04_3D_InterpretacionGeometricaDelProductoDeTresNumeros</span>(ThreeDScene):
    
    &lt;&lt;Cr&#233;ditos en distintas partes de la pantalla&gt;&gt;
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #BA36A5;">lado</span> = 0.25
        <span style="color: #BA36A5;">ejes</span> = ThreeDAxes(
            x_range=(-28, 28, 1),
            y_range=(-15, 15, 1),
            z_range=(-10, 10, 1),
            z_length=5,
            x_length=lado*28*2,
            y_length=lado*15*2,
            tips=<span style="color: #D0372D;">False</span>,
            axis_config={<span style="color: #008000;">"include_numbers"</span>: <span style="color: #D0372D;">True</span>,
                         <span style="color: #008000;">"font_size"</span>: 12},
        )

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">coordenada_x</span>(x, ax, label=<span style="color: #008000;">''</span>, pos=0):
            <span style="color: #BA36A5;">label</span> = label <span style="color: #0000FF;">if</span> label <span style="color: #0000FF;">else</span> f<span style="color: #008000;">"</span>{x}<span style="color: #008000;">"</span>
            <span style="color: #BA36A5;">xlabel</span> = Tex(label, font_size=30)
            <span style="color: #BA36A5;">pos_label</span> = UP <span style="color: #0000FF;">if</span> pos <span style="color: #0000FF;">else</span> DOWN
            xlabel.next_to(ax.c2p(x,0,0), pos_label, buff=0.35)
            <span style="color: #0000FF;">return</span> xlabel

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">coordenada_y</span>(y, ax, label=<span style="color: #008000;">''</span>, pos=0):
            <span style="color: #BA36A5;">label</span> = label <span style="color: #0000FF;">if</span> label <span style="color: #0000FF;">else</span> f<span style="color: #008000;">"</span>{y}<span style="color: #008000;">"</span>
            <span style="color: #BA36A5;">ylabel</span> = Tex(label, font_size=30)
            <span style="color: #BA36A5;">pos_label</span> = RIGHT <span style="color: #0000FF;">if</span> pos <span style="color: #0000FF;">else</span> LEFT
            ylabel.next_to(ax.c2p(0,y,0), pos_label, buff=0.35)
            <span style="color: #0000FF;">return</span> ylabel

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">coordenada_z</span>(z, ax, label=<span style="color: #008000;">''</span>, pos=0):
            <span style="color: #BA36A5;">label</span> = label <span style="color: #0000FF;">if</span> label <span style="color: #0000FF;">else</span> f<span style="color: #008000;">"</span>{z}<span style="color: #008000;">"</span>
            <span style="color: #BA36A5;">zlabel</span> = Tex(label, font_size=30)
            <span style="color: #BA36A5;">pos_label</span> = RIGHT <span style="color: #0000FF;">if</span> pos <span style="color: #0000FF;">else</span> LEFT
            zlabel.rotate(PI/2, axis=RIGHT).next_to(ax.c2p(0,0,z), pos_label, buff=0.35)
            <span style="color: #0000FF;">return</span> zlabel
        
        <span style="color: #BA36A5;">coordenadas_xy</span> = <span style="color: #0000FF;">lambda</span> <span style="color: #BA36A5;">x</span>,<span style="color: #BA36A5;">y</span>,<span style="color: #BA36A5;">ax</span>,<span style="color: #BA36A5;">labelx</span>=<span style="color: #008000;">''</span>,<span style="color: #BA36A5;">labely</span>=<span style="color: #008000;">''</span>,<span style="color: #BA36A5;">posx</span>=0,<span style="color: #BA36A5;">posy</span>=0: (coordenada_x(x,ax,labelx,posx),
                                                                           coordenada_y(y,ax,labely,posy))

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">ladrillo</span>(a, b, ax: Axes) -&gt; VGroup:
            <span style="color: #BA36A5;">prisma</span> = Prism(dimensions=[<span style="color: #006FE0;">float</span>(a*b*lado), <span style="color: #006FE0;">float</span>(b*lado), <span style="color: #006FE0;">float</span>(1*lado)],
                         fill_opacity=0.6,
                         stroke_width=1).next_to(ax.coords_to_point(0, 0),
                                                 UR,
                                                 buff=0)
            <span style="color: #0000FF;">return</span> Group(*[prisma.copy()])
        
        <span style="color: #0000FF;">def</span> <span style="color: #006699;">pila</span>(a, b, c: <span style="color: #006FE0;">int</span>, ax: Axes) -&gt; VGroup:
            <span style="color: #BA36A5;">columna</span> = Group(*[ladrillo(a, b, ax).shift(s*lado*OUT) <span style="color: #0000FF;">for</span> s <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">range</span>(0,c)]).shift([0, 0, lado/2])
            columna.<span style="color: #BA36A5;">a</span> = a
            columna.<span style="color: #BA36A5;">b</span> = b
            columna.<span style="color: #BA36A5;">c</span> = c
            <span style="color: #0000FF;">return</span> columna 
                
        <span style="color: #0000FF;">def</span> <span style="color: #006699;">producto</span>(pila,ritmo=0.6, pausa=8):
            <span style="color: #BA36A5;">a</span> = <span style="color: #006FE0;">float</span>(pila.a)
            <span style="color: #BA36A5;">b</span> = <span style="color: #006FE0;">float</span>(pila.b)
            <span style="color: #BA36A5;">c</span> = pila.c
            [<span style="color: #0000FF;">self</span>.play(piso.animate.shift([0, p*b*lado, 0]), run_time=ritmo) <span style="color: #0000FF;">for</span> p,piso <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(pila)]
            <span style="color: #0000FF;">for</span> p,piso <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(pila):
                <span style="color: #0000FF;">self</span>.play([fila.animate.shift([f*a*lado+p*a*b*lado, 0, 0]) <span style="color: #0000FF;">for</span> f,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(piso)], run_time=ritmo) <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">alineados</span>
            <span style="color: #0000FF;">for</span> p,piso <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(pila):
                <span style="color: #0000FF;">self</span>.play(piso.animate.shift([0, 0, -p*lado]), run_time=ritmo)
            <span style="color: #0000FF;">for</span> p,piso <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(pila):
                <span style="color: #0000FF;">self</span>.play([fila.animate.shift([0, -(p*b+f)*lado, 0]) <span style="color: #0000FF;">for</span> f,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(piso)], run_time=ritmo)
            <span style="color: #0000FF;">self</span>.wait(pausa)
            <span style="color: #0000FF;">for</span> p,piso <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(pila):
                <span style="color: #0000FF;">self</span>.play(piso.animate.shift([0, 0, p*lado]), run_time=ritmo)
            <span style="color: #0000FF;">for</span> p,piso <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(pila):
                <span style="color: #0000FF;">self</span>.play([fila.animate.shift([0, (p*b+f)*lado, 0]) <span style="color: #0000FF;">for</span> f,fila <span style="color: #0000FF;">in</span> <span style="color: #006FE0;">enumerate</span>(piso)], run_time=ritmo)
                
        <span style="color: #0000FF;">def</span> <span style="color: #006699;">multiplicaci&#243;n</span>(a, b, c, ax: Axes, pila: VGroup):
            <span style="color: #BA36A5;">v_line</span> =ax.get_vertical_line(ax.c2p(<span style="color: #006FE0;">float</span>(a*b*c),<span style="color: #006FE0;">float</span>(b*c),<span style="color: #006FE0;">float</span>(c)), color=YELLOW)
            <span style="color: #BA36A5;">recta</span> =  Line(start = ax.c2p(0,0,<span style="color: #006FE0;">float</span>(c)),
                          end   = ax.c2p(<span style="color: #006FE0;">float</span>(a*b*c),<span style="color: #006FE0;">float</span>(b*c),<span style="color: #006FE0;">float</span>(c)))

            <span style="color: #0000FF;">self</span>.play(Indicate(recta, scale_factor=2),
                      run_time=2)
            <span style="color: #0000FF;">self</span>.play(Indicate(v_line, scale_factor=2),
                      run_time=2)
            <span style="color: #0000FF;">self</span>.wait()
            <span style="color: #0000FF;">self</span>.play(FadeOut(v_line))

        <span style="color: #0000FF;">def</span> <span style="color: #006699;">multiplicacion3Num</span>(a, b, c, ax: Axes, pila: VGroup):
                <span style="color: #BA36A5;">Vect</span> = nc.Vector([a*b*c,b*c,c])
                <span style="color: #BA36A5;">v</span> = VectorR3(Vect.lista, rpr=<span style="color: #008000;">'colum'</span>, color=TEAL_A)
                <span style="color: #BA36A5;">line_x</span> = v.x_line(ejes)
                <span style="color: #BA36A5;">line_y</span> = v.y_line(ejes)
                <span style="color: #BA36A5;">line_z</span> = v.z_line(ejes)
                <span style="color: #BA36A5;">line_xy</span> = v.xy_line(ejes)
                <span style="color: #BA36A5;">line_v</span> = v.v_line(ejes)
                <span style="color: #0000FF;">return</span> line_x,line_y,line_z,line_xy,line_v
        
        <span style="color: #0000FF;">self</span>.add(ejes)
        <span style="color: #BA36A5;">a</span>=2
        <span style="color: #BA36A5;">b</span>=3
        <span style="color: #BA36A5;">c</span>=4
        <span style="color: #BA36A5;">columna</span> = pila(a, b, c, ejes)

        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">Set the camera orientation for a better view</span>
        <span style="color: #0000FF;">self</span>.set_camera_orientation(theta=-90 * DEGREES,
                                    zoom=3)

        <span style="color: #BA36A5;">rectangulo</span> = Rectangle(height=lado,
                               width=lado*a).next_to(ejes.coords_to_point(0, 0, 0),
                                                     UR,
                                                     buff=0)
        <span style="color: #0000FF;">self</span>.play(FadeIn(rectangulo))

        <span style="color: #BA36A5;">xlabel</span>=coordenada_x(a, ejes, label=r<span style="color: #008000;">"$\alpha$"</span>)        
        <span style="color: #0000FF;">self</span>.play(Indicate(xlabel,scale_factor=1.5),
                  run_time=.5)

        <span style="color: #BA36A5;">ylabel</span>=coordenada_y(b, ejes, label=r<span style="color: #008000;">"$\beta$"</span>)
        <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=1.5),
                  run_time=.5)

        <span style="color: #BA36A5;">recta0</span> =  Line(start = ejes.c2p(-10,-5,0),
                      end   = ejes.c2p( 10, 5,0),
                      color = RED_B,).set_opacity(0.5)

        <span style="color: #0000FF;">self</span>.wait(2)
        <span style="color: #0000FF;">self</span>.play(Indicate(rectangulo),
                  run_time=2)
        
        <span style="color: #0000FF;">self</span>.wait(1)
        <span style="color: #0000FF;">self</span>.play(FadeIn(recta0))
        <span style="color: #0000FF;">self</span>.wait(6)

        <span style="color: #BA36A5;">pila</span> = columna.copy()

        <span style="color: #BA36A5;">prodxylabel</span>=coordenada_x(a*b, ejes, label=r<span style="color: #008000;">"$\alpha\beta$"</span>)
        <span style="color: #0000FF;">self</span>.play(FadeIn(pila[0][0][0]))
        <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=1.5),
                  run_time=1.5)
        <span style="color: #0000FF;">self</span>.play(Indicate(prodxylabel,scale_factor=1.5),
                  run_time=1.5)

        <span style="color: #0000FF;">self</span>.wait(5) 
        <span style="color: #0000FF;">self</span>.move_camera(phi=65 * DEGREES, theta=-65 * DEGREES, zoom=2.5, run_time=2)
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_camera_orientation(phi=65 * DEGREES, theta=-65 * DEGREES, zoom=2.5)</span>
        
        <span style="color: #0000FF;">self</span>.play(Indicate(pila[0][0][0], run_time=1.8),
                  FadeOut(recta0),
                  FadeOut(xlabel),
                  FadeOut(rectangulo))

        <span style="color: #0000FF;">self</span>.wait(1)
        <span style="color: #0000FF;">self</span>.play(Indicate(prodxylabel,scale_factor=1.5),
                  run_time=1.5)
                
        <span style="color: #0000FF;">self</span>.wait(1.5)
        <span style="color: #0000FF;">self</span>.play(Indicate(ylabel,scale_factor=1.5),
                  run_time=1.5)
        
        <span style="color: #0000FF;">self</span>.wait(1.5)

        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">mostramos el prisma</span>
        <span style="color: #0000FF;">self</span>.play(FadeIn(pila[0][0][1:]),
                  run_time=1)                

        <span style="color: #0000FF;">self</span>.wait(2)
        <span style="color: #0000FF;">self</span>.move_camera(zoom=1, run_time=2)
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_camera_orientation(phi=65 * DEGREES, theta=-65 * DEGREES, zoom=1)</span>
                        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">mostramos una pila de prismas</span>
        [<span style="color: #0000FF;">self</span>.play(FadeIn(piso)) <span style="color: #0000FF;">for</span> piso <span style="color: #0000FF;">in</span> columna[0:]]
        
        <span style="color: #BA36A5;">prodZlabel</span>=coordenada_z(c, ejes, label=r<span style="color: #008000;">"$\gamma$"</span>).set_color(YELLOW)
        <span style="color: #BA36A5;">prodXYZlabel</span>=coordenada_x(a*b*c, ejes, label=r<span style="color: #008000;">"$\alpha\beta\gamma$"</span>).set_color(YELLOW)
        <span style="color: #BA36A5;">prodYZlabel</span>=coordenada_y(b*c, ejes, label=r<span style="color: #008000;">"$\beta\gamma$"</span>).set_color(YELLOW)
        <span style="color: #0000FF;">self</span>.add(prodXYZlabel)
        
        producto(columna, pausa=7)
        <span style="color: #0000FF;">self</span>.wait(3)
        
        <span style="color: #BA36A5;">recta</span> =  Line(start = [<span style="color: #006FE0;">float</span>(-a*b*c*lado),<span style="color: #006FE0;">float</span>(-b*c*lado),<span style="color: #006FE0;">float</span>(-c*lado)],
                      end   = [<span style="color: #006FE0;">float</span>(a*b*c*lado),<span style="color: #006FE0;">float</span>(b*c*lado),<span style="color: #006FE0;">float</span>(c*lado)],
                      color = RED_B)
        <span style="color: #0000FF;">self</span>.add(recta)
        
        <span style="color: #0000FF;">self</span>.wait(6)
        
        <span style="color: #0000FF;">self</span>.play(FadeOut(columna))

        <span style="color: #0000FF;">self</span>.wait(3)

        <span style="color: #BA36A5;">line_x</span>,<span style="color: #BA36A5;">line_y</span>,<span style="color: #BA36A5;">line_z</span>,<span style="color: #BA36A5;">line_xy</span>,<span style="color: #BA36A5;">line_v</span> = multiplicacion3Num(a, b, c, ejes, columna)        
        <span style="color: #0000FF;">self</span>.add(line_x)
        <span style="color: #0000FF;">self</span>.add(line_z)
        <span style="color: #0000FF;">self</span>.add(line_v)
        <span style="color: #0000FF;">self</span>.add(prodZlabel)

        <span style="color: #0000FF;">self</span>.wait(3)
        <span style="color: #0000FF;">self</span>.play(Indicate(line_z,
                           scale_factor=1.5),
                  Indicate(prodZlabel,
                           scale_factor=2.5))
        <span style="color: #0000FF;">self</span>.wait(1.5)        
        <span style="color: #0000FF;">self</span>.play(Indicate(line_x,
                           scale_factor=1.5,
                           run_time=2),
                  Indicate(prodXYZlabel,
                           scale_factor=2.5,
                           run_time=2))
        <span style="color: #0000FF;">self</span>.wait(12.5)

        <span style="color: #0000FF;">self</span>.play(Indicate(line_x,scale_factor=2),
                  Indicate(line_v,scale_factor=2),
                  Indicate(prodXYZlabel,scale_factor=2.5),
                  Indicate(prodZlabel,scale_factor=3),
                  run_time=4)

        <span style="color: #0000FF;">self</span>.play(Indicate(line_y,scale_factor=2),
                  Indicate(prodYZlabel,scale_factor=3),
                  Indicate(prodZlabel,scale_factor=3),
                  Indicate(line_v,scale_factor=2),
                  run_time=3.5)
        
        <span style="color: #BA36A5;">rectaPlanoXY</span> =  Line(start = ejes.c2p(     0,   0, 0),
                             end   = ejes.c2p( a*b*c, b*c, 0),
                             color = BLUE_B).set_opacity(0.5)
        <span style="color: #0000FF;">self</span>.add(rectaPlanoXY)
        <span style="color: #0000FF;">self</span>.play(Indicate(line_y,scale_factor=2),
                  Indicate(prodXYZlabel,scale_factor=2.5),
                  Indicate(prodYZlabel,scale_factor=3),
                  Indicate(line_x,scale_factor=2),
                  run_time=4)
        
        <span style="color: #0000FF;">self</span>.wait(7)

        <span style="color: #0000FF;">self</span>.play(Indicate(recta,
                           scale_factor=2.5,
                           run_time=2))

        <span style="color: #0000FF;">self</span>.wait(3)
 
</pre>
</div>
</div>
</div>
</div>
