L01_V04-ProductoDeUnVectorPorUnEscalar.org
** Escena 4 - Interpretación geométrica del producto de tres números (explicación)

Antes es necesario compilar la escena anterior y mover el fichero
~mp4~ a =aux_movie_files=.

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="5")
# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="5")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E04_InterpretacionGeometricaDelProductoDeTresNumeros.mp4]]

#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V04_ProductoDeUnVectorPorUnEscalar.py
class L01_V04_E04_InterpretacionGeometricaDelProductoDeTresNumeros(MiEscenaConVoz):    
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )       
        #self.set_speech_service(GTTSService(lang="es", tld="com"))        
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"""\usepackage{nacal} """)

        self.creditos(1)

        cabecera = Tex(_("Interpretación geométrica del producto por escalares en ") + r"$\R[3]$",
                       tex_template = myTemplate,
                       font_size=60).scale_to_fit_width(config.frame_width*.9).to_edge(UP).set_color(BLUE)

        self.add(cabecera)
        self.pausa_corta()

        video1 = VideoMobject(
            filename=r"./media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/aux_movie_files/L01_V04_E04_3D_InterpretacionGeometricaDelProductoDeTresNumeros.mp4",
            #filename=r"./media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/1080p60/aux_movie_files/L01_V04_E04_3D_InterpretacionGeometricaDelProductoDeTresNumeros.mp4",
            speed=1.0
        ).scale_to_fit_width(config.frame_width*.95)

        resumen1 = Tex(_(r"""Para interpretar geométricamente el producto por escalares en \R[3],"""),
        tex_template = myTemplate).scale_to_fit_width(config.frame_width*.9)
        
        resumen2 = Tex(_(r"""antes interpretaremos geométricamente el producto de tres números."""),
                       tex_template = myTemplate).next_to(resumen1, DOWN).scale_to_fit_width(config.frame_width*.9)

        with self.voiceover(text=_("""Para interpretar geométricamente
        el producto por escalares en R3,""")) as tracker:
            
            self.play(Write(resumen1), run_time=tracker.duration+0.2)

        with self.voiceover(text=_("""antes interpretaremos
        geométricamente el producto de tres números.""")) as tracker:
            
            self.play(Write(resumen2), run_time=tracker.duration+0.2)


        with self.voiceover(text=_("""Recordemos que, para multiplicar
        alfa por beta, comenzamos con un rectángulo con una base que
        va desde cero hasta alfa y altura uno""")) as tracker:
            self.play(*[FadeOut(mob)for mob in self.mobjects])
            self.add(video1)
            
        with self.voiceover(text=_("""Y extendemos la diagonal que
        pasa por el origen de coordenadas para obtener una recta
        infinita.""")) as tracker:

            self.wait(tracker.duration)
            print(tracker.duration)

        with self.voiceover(text=_("""El punto de la recta con
        coordenada beta en el eje y, tiene coordenada alfa por beta en
        el eje x.""")) as tracker:

            self.wait(tracker.duration)

        with self.voiceover(text=_("""Pero para multiplicar tres
        números (alfa, beta y gamma) comenzaremos con un prisma cuya
        base rectangular tiene un lado sobre el eje x, que va desde
        cero hasta alfa por beta, y el otro lado sobre el eje 'y', que
        va desde cero hasta beta.""")) as tracker:

            self.wait(tracker.duration)
            
        with self.voiceover(text=_("""Además, la altura del prisma
        será uno.""")) as tracker:
            
            self.wait(tracker.duration)

        with self.voiceover(text=_("""Así, para multiplicar alfa beta
        por un número natural gamma, apilaremos gamma copias del
        citado prisma.""")) as tracker:

            self.wait(tracker.duration)

        with self.voiceover(text=_("""Y luego alinearemos dichos
        prismas a lo largo del eje x sin cambiar su orientación. La
        longitud de la fila creada a lo largo del eje x es igual al
        producto de los tres números. Pero este procedimiento solo
        vale cuando apilamos un número  natural de prismas.""")) as tracker:

            self.wait(tracker.duration)            

        with self.voiceover(text=_("""De nuevo, generalizaremos el
        procedimiento alineando los prismas en una posición intermedia
        entre la pila inicial y la fila final.""")) as tracker:
            
            self.wait(7)

        with self.voiceover(text=_("""Si extendemos la diagonal del
        primer prisma, obtenemos la recta a lo largo de la cual hemos
        alineado los prismas. Dicha recta nos sirve para describir
        geométricamente el producto. El punto de la recta, cuya
        coordenada en el eje z es gamma, tiene coordenada en el eje x
        igual al producto de los tres números.""")) as tracker:
            
            self.wait(9)

        xz = MathTex(r"\frac{z}{x}=\frac{\gamma}{\alpha\beta\gamma}=\frac{1}{\alpha\beta}",
                     tex_template = myTemplate).to_corner(UL)
        
        yz = MathTex(r"\frac{z}{y}=\frac{\gamma}{\beta\gamma}=\frac{1}{\beta}",
                     tex_template = myTemplate).next_to(xz,
                                                        DOWN,
                                                        aligned_edge=LEFT,
                                                        buff=1.3)
        
        xy = MathTex(r"\frac{y}{x}=\frac{\beta\gamma}{\alpha\beta\gamma}=\frac{1}{\alpha}",
                     tex_template = myTemplate).next_to(yz,
                                                        DOWN,
                                                        aligned_edge=LEFT,
                                                        buff=1.3)
        
        with self.voiceover(text=_("""De manera similar a lo visto con
        el producto de dos números, para cada punto de la recta que
        extiende la diagonal del prisma, la proporcionalidad entre las
        coordenadas se mantiene. Así:""")) as tracker:
            
            self.play(video1.animate.scale(.7).to_corner(UR))
            self.play(Write(xz))
            self.play(Write(yz))
            self.play(Write(xy))

        with self.voiceover(text=_("""los ratios
        entre la coordenada z y la coordenada x;""")) as tracker:            
            
            self.play(Indicate(xz),
                      run_time=tracker.duration)
            
        with self.voiceover(text=_("""la coordenada z y la
        coordenada y;""")) as tracker:
            
            self.play(Indicate(yz),
                  run_time=tracker.duration)
            
        with self.voiceover(text=_("""y la coordenada 'y' y la
        cooordenada x""")) as tracker:
            
            self.play(Indicate(xy),
                  run_time=tracker.duration)
            
        with self.voiceover(text=_("""se mantienen en todos los puntos
        de la recta. Es decir, los puntos que mantienen la misma
        proporción entre sus coordenadas se disponen a lo largo de una
        recta que pasa por el origen.""")) as tracker:

            self.wait(tracker.duration+2)

#+END_SRC

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="5")
# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="5")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E04_InterpretacionGeometricaDelProductoDeTresNumeros.mp4]]

