L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-orgf197b98" class="outline-3">
<h3 id="orgf197b98"><span class="section-number-3">1.5.</span> Escena 4 - Interpretación geométrica del producto de tres números (explicación)</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Antes es necesario compilar la escena anterior y mover el fichero
<code>mp4</code> a <code>aux_movie_files</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V04_E04_InterpretacionGeometricaDelProductoDeTresNumeros</span>(MiEscenaConVoz):    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )       
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))        </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"""\usepackage{nacal} """</span>)

        <span style="color: #0000FF;">self</span>.creditos(1)

        <span style="color: #BA36A5;">cabecera</span> = Tex(_(<span style="color: #008000;">"Interpretaci&#243;n geom&#233;trica del producto por escalares en "</span>) + r<span style="color: #008000;">"$\R[3]$"</span>,
                       tex_template = myTemplate,
                       font_size=60).scale_to_fit_width(config.frame_width*.9).to_edge(UP).set_color(BLUE)

        <span style="color: #0000FF;">self</span>.add(cabecera)
        <span style="color: #0000FF;">self</span>.pausa_corta()

        <span style="color: #BA36A5;">video1</span> = VideoMobject(
            filename=r<span style="color: #008000;">"./media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/aux_movie_files/L01_V04_E04_3D_InterpretacionGeometricaDelProductoDeTresNumeros.mp4"</span>,
            <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">filename=r"./media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/1080p60/aux_movie_files/L01_V04_E04_3D_InterpretacionGeometricaDelProductoDeTresNumeros.mp4",</span>
            speed=1.0
        ).scale_to_fit_width(config.frame_width*.95)

        <span style="color: #BA36A5;">resumen1</span> = Tex(_(r<span style="color: #008000;">"""Para interpretar geom&#233;tricamente el producto por escalares en \R[3],"""</span>),
        tex_template = myTemplate).scale_to_fit_width(config.frame_width*.9)
        
        <span style="color: #BA36A5;">resumen2</span> = Tex(_(r<span style="color: #008000;">"""antes interpretaremos geom&#233;tricamente el producto de tres n&#250;meros."""</span>),
                       tex_template = myTemplate).next_to(resumen1, DOWN).scale_to_fit_width(config.frame_width*.9)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Para interpretar geom&#233;tricamente</span>
<span style="color: #008000;">        el producto por escalares en R3,"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(Write(resumen1), run_time=tracker.duration+0.2)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""antes interpretaremos</span>
<span style="color: #008000;">        geom&#233;tricamente el producto de tres n&#250;meros."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(Write(resumen2), run_time=tracker.duration+0.2)


        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Recordemos que, para multiplicar</span>
<span style="color: #008000;">        alfa por beta, comenzamos con un rect&#225;ngulo con una base que</span>
<span style="color: #008000;">        va desde cero hasta alfa y altura uno"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(*[FadeOut(mob)<span style="color: #0000FF;">for</span> mob <span style="color: #0000FF;">in</span> <span style="color: #0000FF;">self</span>.mobjects])
            <span style="color: #0000FF;">self</span>.add(video1)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y extendemos la diagonal que</span>
<span style="color: #008000;">        pasa por el origen de coordenadas para obtener una recta</span>
<span style="color: #008000;">        infinita."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.wait(tracker.duration)
            <span style="color: #006FE0;">print</span>(tracker.duration)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""El punto de la recta con</span>
<span style="color: #008000;">        coordenada beta en el eje y, tiene coordenada alfa por beta en</span>
<span style="color: #008000;">        el eje x."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.wait(tracker.duration)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Pero para multiplicar tres</span>
<span style="color: #008000;">        n&#250;meros (alfa, beta y gamma) comenzaremos con un prisma cuya</span>
<span style="color: #008000;">        base rectangular tiene un lado sobre el eje x, que va desde</span>
<span style="color: #008000;">        cero hasta alfa por beta, y el otro lado sobre el eje 'y', que</span>
<span style="color: #008000;">        va desde cero hasta beta."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.wait(tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Adem&#225;s, la altura del prisma</span>
<span style="color: #008000;">        ser&#225; uno."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.wait(tracker.duration)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""As&#237;, para multiplicar alfa beta</span>
<span style="color: #008000;">        por un n&#250;mero natural gamma, apilaremos gamma copias del</span>
<span style="color: #008000;">        citado prisma."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.wait(tracker.duration)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y luego alinearemos dichos</span>
<span style="color: #008000;">        prismas a lo largo del eje x sin cambiar su orientaci&#243;n. La</span>
<span style="color: #008000;">        longitud de la fila creada a lo largo del eje x es igual al</span>
<span style="color: #008000;">        producto de los tres n&#250;meros. Pero este procedimiento solo</span>
<span style="color: #008000;">        vale cuando apilamos un n&#250;mero  natural de prismas."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.wait(tracker.duration)            

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""De nuevo, generalizaremos el</span>
<span style="color: #008000;">        procedimiento alineando los prismas en una posici&#243;n intermedia</span>
<span style="color: #008000;">        entre la pila inicial y la fila final."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.wait(7)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Si extendemos la diagonal del</span>
<span style="color: #008000;">        primer prisma, obtenemos la recta a lo largo de la cual hemos</span>
<span style="color: #008000;">        alineado los prismas. Dicha recta nos sirve para describir</span>
<span style="color: #008000;">        geom&#233;tricamente el producto. El punto de la recta, cuya</span>
<span style="color: #008000;">        coordenada en el eje z es gamma, tiene coordenada en el eje x</span>
<span style="color: #008000;">        igual al producto de los tres n&#250;meros."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.wait(9)

        <span style="color: #BA36A5;">xz</span> = MathTex(r<span style="color: #008000;">"\frac{z}{x}=\frac{\gamma}{\alpha\beta\gamma}=\frac{1}{\alpha\beta}"</span>,
                     tex_template = myTemplate).to_corner(UL)
        
        <span style="color: #BA36A5;">yz</span> = MathTex(r<span style="color: #008000;">"\frac{z}{y}=\frac{\gamma}{\beta\gamma}=\frac{1}{\beta}"</span>,
                     tex_template = myTemplate).next_to(xz,
                                                        DOWN,
                                                        aligned_edge=LEFT,
                                                        buff=1.3)
        
        <span style="color: #BA36A5;">xy</span> = MathTex(r<span style="color: #008000;">"\frac{y}{x}=\frac{\beta\gamma}{\alpha\beta\gamma}=\frac{1}{\alpha}"</span>,
                     tex_template = myTemplate).next_to(yz,
                                                        DOWN,
                                                        aligned_edge=LEFT,
                                                        buff=1.3)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""De manera similar a lo visto con</span>
<span style="color: #008000;">        el producto de dos n&#250;meros, para cada punto de la recta que</span>
<span style="color: #008000;">        extiende la diagonal del prisma, la proporcionalidad entre las</span>
<span style="color: #008000;">        coordenadas se mantiene. As&#237;:"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(video1.animate.scale(.7).to_corner(UR))
            <span style="color: #0000FF;">self</span>.play(Write(xz))
            <span style="color: #0000FF;">self</span>.play(Write(yz))
            <span style="color: #0000FF;">self</span>.play(Write(xy))

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""los ratios</span>
<span style="color: #008000;">        entre la coordenada z y la coordenada x;"""</span>)) <span style="color: #0000FF;">as</span> tracker:            
            
            <span style="color: #0000FF;">self</span>.play(Indicate(xz),
                      run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""la coordenada z y la</span>
<span style="color: #008000;">        coordenada y;"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(Indicate(yz),
                  run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""y la coordenada 'y' y la</span>
<span style="color: #008000;">        cooordenada x"""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(Indicate(xy),
                  run_time=tracker.duration)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""se mantienen en todos los puntos</span>
<span style="color: #008000;">        de la recta. Es decir, los puntos que mantienen la misma</span>
<span style="color: #008000;">        proporci&#243;n entre sus coordenadas se disponen a lo largo de una</span>
<span style="color: #008000;">        recta que pasa por el origen."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.wait(tracker.duration+2)

</pre>
</div>
</div>
</div>
