L01_V04-ProductoDeUnVectorPorUnEscalar.org
** Escena 5 - Interpretación geométrica del producto por escalares en de $\mathbb{R}^3$ (3D)

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="6")
# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="6")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4]]
# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/aux_movie_files/L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4]]

*** Escena 3D

#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V04_ProductoDeUnVectorPorUnEscalar.py
class L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3(ThreeDScene):
    <<Créditos en distintas partes de la pantalla>>
    
    def construct(self):
        axes = ThreeDAxes()
        x_label = axes.get_x_axis_label(Tex("1ª comp."))
        y_label = axes.get_y_axis_label(Tex("2ª comp.")).shift(UP * 2.4).shift(LEFT * 0.6)
       	
        # zoom out so we see the axes
        self.set_camera_orientation(zoom=0.5)
        
        c       = VectorR3([0,0, 2.5], color=RED_B)
        d       = VectorR3([0,0, 4.5], color=RED_B)
        e       = VectorR3([0,0,-4.5], color=RED_B)
        flechac = c.arrow(axes)
        flechad = d.arrow(axes)
        flechae = e.arrow(axes)
        flechac2= flechac.copy()
        c_dot = c.dot(axes)
        d_dot = d.dot(axes)
        e_dot = e.dot(axes)
        c_dot2 = c_dot.copy()
        
        eje_z =  Line(start = [0, 0, -5],
                      end   = [0, 0,  5],
                      color = RED_B)
        
	
        self.play(FadeIn(axes), FadeIn(x_label), FadeIn(y_label))
        self.wait(1)
        self.play(Indicate(c_dot,
                           scale_factor=3,
                           run_time=1.5))
	
        # animate the move of the camera to properly see the axes
        self.move_camera(phi=75 * DEGREES, theta=60 * DEGREES, zoom=1, run_time=1.5)
	
        # built-in updater which begins camera rotation
        self.begin_ambient_camera_rotation(rate=0.2)
        self.wait(2)
        
        # caso 1
        self.wait(.5)
	
        self.play(Transform(c_dot,
                            d_dot),
                  run_time=1)
        self.play(Transform(c_dot,
                            e_dot),
                  run_time=1)
        self.play(Transform(c_dot,
                            c_dot2),
                  run_time=1)
        self.play(FadeOut(c_dot)),
		
        self.play(Indicate(eje_z),
                  run_time=1.5)
        self.wait(2)
        self.play(FadeOut(eje_z))
	
        self.wait(2)
        
        Vect = nc.Vector([3,2,3])
        b = VectorR3(Vect.lista, rpr='colum', color=TEAL_A)
        b1 = VectorR3((Vect*nc.fracc(3,2)).lista, rpr='colum', color=TEAL_A)
        b2 = VectorR3((Vect*nc.fracc(1,2)).lista, rpr='colum', color=TEAL_A)
        b3 = VectorR3((Vect*(-1)).lista, rpr='colum', color=TEAL_A)
        b4 = VectorR3((Vect*nc.fracc(-1,2)).lista, rpr='colum', color=TEAL_A)
        b5 = VectorR3((Vect*nc.fracc(-3,2)).lista, rpr='colum', color=TEAL_A)
        b0 = VectorR3((Vect*0).lista, rpr='colum', color=YELLOW)

        b_dot  = b.dot(axes)
        b_dot1 = b1.dot(axes)
        b_dot2 = b2.dot(axes)
        b_dot3 = b3.dot(axes)
        b_dot4 = b4.dot(axes)
        b_dot5 = b5.dot(axes)
        b_dot0 = b0.dot(axes, radio=0.12)

        extremo1 = VectorR3((Vect*5).lista).dot(axes)
        extremo2 = VectorR3((Vect*(-5)).lista).dot(axes)
        recta =  Line(start = extremo1.get_center(),
                      end   = extremo2.get_center(),
                      color = BLUE_B)

        self.play(Indicate(b_dot))
        line_x = b.x_line(axes)
        self.add(line_x)
        line_y = b.y_line(axes)
        self.add(line_y)
        line_z = b.z_line(axes)
        self.add(line_z)
        line_xy = b.xy_line(axes)
        self.add(line_xy)

        line_v = b.v_line(axes)
        self.add(line_v)

        self.wait(2.5)
                
        self.play(TransformFromCopy(b_dot,
                                    b_dot1), run_time=3)
        
        self.play(TransformFromCopy(b_dot,
                                    b_dot2), run_time=3)
 
        self.play(TransformFromCopy(b_dot,
                                    b_dot3),
                  TransformFromCopy(b_dot,
                                    b_dot4),
                  TransformFromCopy(b_dot,
                                    b_dot5), run_time=4.5)

        self.wait(1)

        self.play(TransformFromCopy(b_dot,
                                    b_dot0), run_time=3.5)
       
        self.wait(15)
        
        self.play(FadeOut(b_dot),
                  #FadeOut(b_dot0),
                  FadeOut(b_dot1),
                  FadeOut(b_dot2),
                  FadeOut(b_dot3),
                  FadeOut(b_dot4),
                  FadeOut(b_dot5),
                  FadeIn(recta))

        self.wait(10)
        
#+END_SRC


#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="6")
# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="6")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4]]
# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/aux_movie_files/L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4]]


