L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-org03d8bcc" class="outline-3">
<h3 id="org03d8bcc"><span class="section-number-3">1.6.</span> Escena 5 - Interpretación geométrica del producto por escalares en de \(\mathbb{R}^3\) (3D)</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org223b840" class="outline-4">
<h4 id="org223b840"><span class="section-number-4">1.6.1.</span> Escena 3D</h4>
<div class="outline-text-4" id="text-1-6-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3</span>(ThreeDScene):
    &lt;&lt;Cr&#233;ditos en distintas partes de la pantalla&gt;&gt;
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #BA36A5;">axes</span> = ThreeDAxes()
        <span style="color: #BA36A5;">x_label</span> = axes.get_x_axis_label(Tex(<span style="color: #008000;">"1&#170; comp."</span>))
        <span style="color: #BA36A5;">y_label</span> = axes.get_y_axis_label(Tex(<span style="color: #008000;">"2&#170; comp."</span>)).shift(UP * 2.4).shift(LEFT * 0.6)
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">zoom out so we see the axes</span>
        <span style="color: #0000FF;">self</span>.set_camera_orientation(zoom=0.5)
        
        <span style="color: #BA36A5;">c</span>       = VectorR3([0,0, 2.5], color=RED_B)
        <span style="color: #BA36A5;">d</span>       = VectorR3([0,0, 4.5], color=RED_B)
        <span style="color: #BA36A5;">e</span>       = VectorR3([0,0,-4.5], color=RED_B)
        <span style="color: #BA36A5;">flechac</span> = c.arrow(axes)
        <span style="color: #BA36A5;">flechad</span> = d.arrow(axes)
        <span style="color: #BA36A5;">flechae</span> = e.arrow(axes)
        <span style="color: #BA36A5;">flechac2</span>= flechac.copy()
        <span style="color: #BA36A5;">c_dot</span> = c.dot(axes)
        <span style="color: #BA36A5;">d_dot</span> = d.dot(axes)
        <span style="color: #BA36A5;">e_dot</span> = e.dot(axes)
        <span style="color: #BA36A5;">c_dot2</span> = c_dot.copy()
        
        <span style="color: #BA36A5;">eje_z</span> =  Line(start = [0, 0, -5],
                      end   = [0, 0,  5],
                      color = RED_B)
        
        
        <span style="color: #0000FF;">self</span>.play(FadeIn(axes), FadeIn(x_label), FadeIn(y_label))
        <span style="color: #0000FF;">self</span>.wait(1)
        <span style="color: #0000FF;">self</span>.play(Indicate(c_dot,
                           scale_factor=3,
                           run_time=1.5))
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">animate the move of the camera to properly see the axes</span>
        <span style="color: #0000FF;">self</span>.move_camera(phi=75 * DEGREES, theta=60 * DEGREES, zoom=1, run_time=1.5)
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">built-in updater which begins camera rotation</span>
        <span style="color: #0000FF;">self</span>.begin_ambient_camera_rotation(rate=0.2)
        <span style="color: #0000FF;">self</span>.wait(2)
        
        <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">caso 1</span>
        <span style="color: #0000FF;">self</span>.wait(.5)
        
        <span style="color: #0000FF;">self</span>.play(Transform(c_dot,
                            d_dot),
                  run_time=1)
        <span style="color: #0000FF;">self</span>.play(Transform(c_dot,
                            e_dot),
                  run_time=1)
        <span style="color: #0000FF;">self</span>.play(Transform(c_dot,
                            c_dot2),
                  run_time=1)
        <span style="color: #0000FF;">self</span>.play(FadeOut(c_dot)),
                
        <span style="color: #0000FF;">self</span>.play(Indicate(eje_z),
                  run_time=1.5)
        <span style="color: #0000FF;">self</span>.wait(2)
        <span style="color: #0000FF;">self</span>.play(FadeOut(eje_z))
        
        <span style="color: #0000FF;">self</span>.wait(2)
        
        <span style="color: #BA36A5;">Vect</span> = nc.Vector([3,2,3])
        <span style="color: #BA36A5;">b</span> = VectorR3(Vect.lista, rpr=<span style="color: #008000;">'colum'</span>, color=TEAL_A)
        <span style="color: #BA36A5;">b1</span> = VectorR3((Vect*nc.fracc(3,2)).lista, rpr=<span style="color: #008000;">'colum'</span>, color=TEAL_A)
        <span style="color: #BA36A5;">b2</span> = VectorR3((Vect*nc.fracc(1,2)).lista, rpr=<span style="color: #008000;">'colum'</span>, color=TEAL_A)
        <span style="color: #BA36A5;">b3</span> = VectorR3((Vect*(-1)).lista, rpr=<span style="color: #008000;">'colum'</span>, color=TEAL_A)
        <span style="color: #BA36A5;">b4</span> = VectorR3((Vect*nc.fracc(-1,2)).lista, rpr=<span style="color: #008000;">'colum'</span>, color=TEAL_A)
        <span style="color: #BA36A5;">b5</span> = VectorR3((Vect*nc.fracc(-3,2)).lista, rpr=<span style="color: #008000;">'colum'</span>, color=TEAL_A)
        <span style="color: #BA36A5;">b0</span> = VectorR3((Vect*0).lista, rpr=<span style="color: #008000;">'colum'</span>, color=YELLOW)

        <span style="color: #BA36A5;">b_dot</span>  = b.dot(axes)
        <span style="color: #BA36A5;">b_dot1</span> = b1.dot(axes)
        <span style="color: #BA36A5;">b_dot2</span> = b2.dot(axes)
        <span style="color: #BA36A5;">b_dot3</span> = b3.dot(axes)
        <span style="color: #BA36A5;">b_dot4</span> = b4.dot(axes)
        <span style="color: #BA36A5;">b_dot5</span> = b5.dot(axes)
        <span style="color: #BA36A5;">b_dot0</span> = b0.dot(axes, radio=0.12)

        <span style="color: #BA36A5;">extremo1</span> = VectorR3((Vect*5).lista).dot(axes)
        <span style="color: #BA36A5;">extremo2</span> = VectorR3((Vect*(-5)).lista).dot(axes)
        <span style="color: #BA36A5;">recta</span> =  Line(start = extremo1.get_center(),
                      end   = extremo2.get_center(),
                      color = BLUE_B)

        <span style="color: #0000FF;">self</span>.play(Indicate(b_dot))
        <span style="color: #BA36A5;">line_x</span> = b.x_line(axes)
        <span style="color: #0000FF;">self</span>.add(line_x)
        <span style="color: #BA36A5;">line_y</span> = b.y_line(axes)
        <span style="color: #0000FF;">self</span>.add(line_y)
        <span style="color: #BA36A5;">line_z</span> = b.z_line(axes)
        <span style="color: #0000FF;">self</span>.add(line_z)
        <span style="color: #BA36A5;">line_xy</span> = b.xy_line(axes)
        <span style="color: #0000FF;">self</span>.add(line_xy)

        <span style="color: #BA36A5;">line_v</span> = b.v_line(axes)
        <span style="color: #0000FF;">self</span>.add(line_v)

        <span style="color: #0000FF;">self</span>.wait(2.5)
                
        <span style="color: #0000FF;">self</span>.play(TransformFromCopy(b_dot,
                                    b_dot1), run_time=3)
        
        <span style="color: #0000FF;">self</span>.play(TransformFromCopy(b_dot,
                                    b_dot2), run_time=3)
 
        <span style="color: #0000FF;">self</span>.play(TransformFromCopy(b_dot,
                                    b_dot3),
                  TransformFromCopy(b_dot,
                                    b_dot4),
                  TransformFromCopy(b_dot,
                                    b_dot5), run_time=4.5)

        <span style="color: #0000FF;">self</span>.wait(1)

        <span style="color: #0000FF;">self</span>.play(TransformFromCopy(b_dot,
                                    b_dot0), run_time=3.5)
       
        <span style="color: #0000FF;">self</span>.wait(15)
        
        <span style="color: #0000FF;">self</span>.play(FadeOut(b_dot),
                  <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">FadeOut(b_dot0),</span>
                  FadeOut(b_dot1),
                  FadeOut(b_dot2),
                  FadeOut(b_dot3),
                  FadeOut(b_dot4),
                  FadeOut(b_dot5),
                  FadeIn(recta))

        <span style="color: #0000FF;">self</span>.wait(10)
        
</pre>
</div>
</div>
</div>
</div>
