L01_V04-ProductoDeUnVectorPorUnEscalar.org
** Escena 5 - Interpretación geométrica del producto por escalares en de $\mathbb{R}^3$ (explicación)

Antes es necesario compilar la escena anterior y mover el fichero
~mp4~ a =aux_movie_files=.

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="7")
# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="7")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E05_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4]]

#+BEGIN_SRC python :noweb tangle :tangle ./lib/L01_V04_ProductoDeUnVectorPorUnEscalar.py
<<Definición de VideoStatus y VideoMobject>>

class L01_V04_E05_InterpretacionGeometricaDelProductoPorEscalaresEnR3(MiEscenaConVoz):
    def construct(self):
        self.set_speech_service( AzureService(voice="es-ES-AlvaroNeural" ) )       
        #self.set_speech_service(GTTSService(lang="es", tld="com"))        
        myTemplate = TexTemplate()
        myTemplate.add_to_preamble(r"""\usepackage{nacal} """)

        self.creditos(1)

        titulo = Tex(_("Interpretación geométrica del producto en ") + r"$\R[3]$",
                       tex_template = myTemplate,
                       font_size=60).set_color(BLUE).to_edge(UP)

        video1 = VideoMobject(
            filename=r"./media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/aux_movie_files/L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4",
            #filename=r"./media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/1080p60/aux_movie_files/L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4",
           speed=1.0
        ).scale_to_fit_width(6.5).next_to(titulo, DOWN, buff=0)

        escalar = sp.symbols('\lambda')
        c3      = sp.symbols('a_3')
        c       = nc.Vector([0,0,c3])
        s0      = MathTex(r"\lambda " + c.latex(),   tex_template = myTemplate,)
        igual   = MathTex(r"=",        tex_template = myTemplate,)
        s05     = MathTex((escalar*c).latex(), tex_template = myTemplate,)
        grp0 = VGroup(s0,
                      igual,
                      s05).arrange(RIGHT).next_to(video1, DOWN).scale(.9)
       
        escalar = sp.symbols('\lambda')
        a  = nc.Vector(sp.symbols('a:4')[1:])
        s1 = MathTex(r"\lambda " + a.latex(),
                     tex_template = myTemplate,)
        s5 = MathTex((escalar*a).latex(),
                     tex_template = myTemplate,)
        grp1 = VGroup(s1,
                      igual.copy(),
                      s5).arrange(RIGHT).next_to(video1, DOWN).scale(.9)
        
        self.creditos(17)
      
        with self.voiceover(text=_("""La interpretación geométrica del
        producto por escalares en R3 es similar a la de R2.""")) as tracker:
            
            self.add(titulo)
            self.add(video1)
            self.pausa(4)

        with self.voiceover(text=_("""En el caso en el que todas las
        componentes salvo la última son cero.""")) as tracker:
            
            self.play(FadeIn(grp0))
            self.pausa(3)
                        
        with self.voiceover(text=_("""El conjunto de múltiplos
        constituye el eje vertical.""")) as tracker:
            
            self.pausa(7.7)
            self.play(FadeOut(grp0))
            
        with self.voiceover(text=_("""En cuanto a cualquier otro tipo
        de vector no nulo.""")) as tracker:
            
            self.play(FadeIn(grp1))

        with self.voiceover(text=_("""Dependiendo del valor del
        escalar, las componentes del múltiplo serán mayores o
        menores.""")) as tracker:
            
            self.pausa(1)

        with self.voiceover(text=_("""Y si el escalar es negativo,
        cambiará el signo de las componentes del vector.""")) as tracker:

            self.pausa(tracker.duration)

        with self.voiceover(text=_("""Además, cualquier vector
        multiplicado por cero es un vector nulo.""")) as tracker:
            
            self.pausa(tracker.duration)
            self.play(FadeOut(grp1))
            self.pausa(1)

        cvab = MathTex(r"\elemRp{\lambda\Vect{a}}{i}", tex_template = myTemplate)
        cvb  = MathTex(r"\lambda\eleVRpE{a}{i}", tex_template = myTemplate)
        eq_suma = VGroup(cvab,igual,cvb).arrange(RIGHT).scale(1.5)
        
        grp3 = VGroup(eq_suma,).arrange(RIGHT,
                                          buff=1).next_to(video1,
                                                          DOWN).scale(1)

        r1 =  MathTex(r"""\frac{\lambda a_j}{\lambda a_k}=\frac{a_j}{a_k}\qquad
        \text{para todo}\; \lambda, j, k,\;
        \text{ si }\; a_k\ne0""",
                      tex_template = myTemplate).next_to(video1,
                                                         DOWN).scale(1)
        
        with self.voiceover(text=_("""Como las componentes del vector
        son multiplicadas por un mismo valor, las proporciones entre
        las cordenadas no nulas se mantienen entre todos los
        múltiplos.""")) as tracker:
            
            self.play(FadeIn(grp3))
            self.pausa(tracker.duration*2/5)
            self.play(FadeOut(grp3))           
            self.play(FadeIn(r1))
            
        with self.voiceover(text=_("""Así, dada la interpretación del
        producto entre tres números vista anteriormente, los múltiplos
        de un vector no nulo de R3 se corresponden con los puntos de
        una recta que pasa por el origen de coordenadas.""")) as tracker:
            
            self.pausa(tracker.duration)
            self.play(FadeOut(r1),
                      FadeOut(video1))

        resumen1 = Tex(_(r"""El conjunto de múltiplos de un vector no nulo de \R[3]"""),
                       tex_template = myTemplate)
        resumen2 = Tex(_(r"""se corresponde con una recta que pasa por el origen."""),
                       tex_template = myTemplate).next_to(resumen1, DOWN)
            
        with self.voiceover(text=_("""Por tanto, el conjunto de
        múltiplos de cualquier vector no nulo de R 3 es una recta que
        pasa por el origen.""")) as tracker:
            self.play(Write(resumen1),
                      run_time=tracker.duration/2)
            self.play(Write(resumen2),
                      run_time=tracker.duration/2)

            self.pausa_muy_corta()
            self.play(FadeOut(resumen1),
                      FadeOut(resumen2))

        titulo2 = Tex(_("Interpretación geométrica del producto en ") + r"$\R[n]$",
                       tex_template = myTemplate,
                       font_size=60).set_color(BLUE).to_edge(UP)

        resumenRn_1 = Tex(_(r"""El conjunto de múltiplos de un vector no nulo de \R[n]"""),
                          tex_template = myTemplate)
        resumenRn_2 = Tex(_(r"""se corresponde con una recta que pasa por el origen."""),
                          tex_template = myTemplate).next_to(resumenRn_1, DOWN)
                
        with self.voiceover(text=_("""Reescalar un vector en R n
        mantiene la proporción entre sus coordenadas. Aunque no
        podemos visualizar una recta en más de tres dimensiones,
        abusando del lenguaje diremos que: los múltiplos de un vector
        en R n se corresponden con una recta que pasa por el
        origen.""")) as tracker:

            self.play(FadeOut(titulo))
            self.play(FadeIn(titulo2))
            self.pausa(tracker.duration/2)
            self.play(Write(resumenRn_1))
            self.play(Write(resumenRn_2))
            self.pausa(2)

#+END_SRC

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="7")
# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="7")

# [[file:lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/L01_V04_E05_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4]]


