L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-org13f53aa" class="outline-3">
<h3 id="org13f53aa"><span class="section-number-3">1.7.</span> Escena 5 - Interpretación geométrica del producto por escalares en de \(\mathbb{R}^3\) (explicación)</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Antes es necesario compilar la escena anterior y mover el fichero
<code>mp4</code> a <code>aux_movie_files</code>.
</p>

<div class="org-src-container">
<pre class="src src-python">&lt;&lt;Definici&#243;n de VideoStatus y VideoMobject&gt;&gt;

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">L01_V04_E05_InterpretacionGeometricaDelProductoPorEscalaresEnR3</span>(MiEscenaConVoz):
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">construct</span>(<span style="color: #0000FF;">self</span>):
        <span style="color: #0000FF;">self</span>.set_speech_service( AzureService(voice=<span style="color: #008000;">"es-ES-AlvaroNeural"</span> ) )       
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.set_speech_service(GTTSService(lang="es", tld="com"))        </span>
        <span style="color: #BA36A5;">myTemplate</span> = TexTemplate()
        myTemplate.add_to_preamble(r<span style="color: #008000;">"""\usepackage{nacal} """</span>)

        <span style="color: #0000FF;">self</span>.creditos(1)

        <span style="color: #BA36A5;">titulo</span> = Tex(_(<span style="color: #008000;">"Interpretaci&#243;n geom&#233;trica del producto en "</span>) + r<span style="color: #008000;">"$\R[3]$"</span>,
                       tex_template = myTemplate,
                       font_size=60).set_color(BLUE).to_edge(UP)

        <span style="color: #BA36A5;">video1</span> = VideoMobject(
            filename=r<span style="color: #008000;">"./media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/aux_movie_files/L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4"</span>,
            <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">filename=r"./media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/1080p60/aux_movie_files/L01_V04_E05_3D_InterpretacionGeometricaDelProductoPorEscalaresEnR3.mp4",</span>
           speed=1.0
        ).scale_to_fit_width(6.5).next_to(titulo, DOWN, buff=0)

        <span style="color: #BA36A5;">escalar</span> = sp.symbols(<span style="color: #008000;">'\lambda'</span>)
        <span style="color: #BA36A5;">c3</span>      = sp.symbols(<span style="color: #008000;">'a_3'</span>)
        <span style="color: #BA36A5;">c</span>       = nc.Vector([0,0,c3])
        <span style="color: #BA36A5;">s0</span>      = MathTex(r<span style="color: #008000;">"\lambda "</span> + c.latex(),   tex_template = myTemplate,)
        <span style="color: #BA36A5;">igual</span>   = MathTex(r<span style="color: #008000;">"="</span>,        tex_template = myTemplate,)
        <span style="color: #BA36A5;">s05</span>     = MathTex((escalar*c).latex(), tex_template = myTemplate,)
        <span style="color: #BA36A5;">grp0</span> = VGroup(s0,
                      igual,
                      s05).arrange(RIGHT).next_to(video1, DOWN).scale(.9)
       
        <span style="color: #BA36A5;">escalar</span> = sp.symbols(<span style="color: #008000;">'\lambda'</span>)
        <span style="color: #BA36A5;">a</span>  = nc.Vector(sp.symbols(<span style="color: #008000;">'a:4'</span>)[1:])
        <span style="color: #BA36A5;">s1</span> = MathTex(r<span style="color: #008000;">"\lambda "</span> + a.latex(),
                     tex_template = myTemplate,)
        <span style="color: #BA36A5;">s5</span> = MathTex((escalar*a).latex(),
                     tex_template = myTemplate,)
        <span style="color: #BA36A5;">grp1</span> = VGroup(s1,
                      igual.copy(),
                      s5).arrange(RIGHT).next_to(video1, DOWN).scale(.9)
        
        <span style="color: #0000FF;">self</span>.creditos(17)
      
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""La interpretaci&#243;n geom&#233;trica del</span>
<span style="color: #008000;">        producto por escalares en R3 es similar a la de R2."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.add(titulo)
            <span style="color: #0000FF;">self</span>.add(video1)
            <span style="color: #0000FF;">self</span>.pausa(4)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""En el caso en el que todas las</span>
<span style="color: #008000;">        componentes salvo la &#250;ltima son cero."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp0))
            <span style="color: #0000FF;">self</span>.pausa(3)
                        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""El conjunto de m&#250;ltiplos</span>
<span style="color: #008000;">        constituye el eje vertical."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.pausa(7.7)
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp0))
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""En cuanto a cualquier otro tipo</span>
<span style="color: #008000;">        de vector no nulo."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp1))

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Dependiendo del valor del</span>
<span style="color: #008000;">        escalar, las componentes del m&#250;ltiplo ser&#225;n mayores o</span>
<span style="color: #008000;">        menores."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.pausa(1)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Y si el escalar es negativo,</span>
<span style="color: #008000;">        cambiar&#225; el signo de las componentes del vector."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)

        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Adem&#225;s, cualquier vector</span>
<span style="color: #008000;">        multiplicado por cero es un vector nulo."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp1))
            <span style="color: #0000FF;">self</span>.pausa(1)

        <span style="color: #BA36A5;">cvab</span> = MathTex(r<span style="color: #008000;">"\elemRp{\lambda\Vect{a}}{i}"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">cvb</span>  = MathTex(r<span style="color: #008000;">"\lambda\eleVRpE{a}{i}"</span>, tex_template = myTemplate)
        <span style="color: #BA36A5;">eq_suma</span> = VGroup(cvab,igual,cvb).arrange(RIGHT).scale(1.5)
        
        <span style="color: #BA36A5;">grp3</span> = VGroup(eq_suma,).arrange(RIGHT,
                                          buff=1).next_to(video1,
                                                          DOWN).scale(1)

        <span style="color: #BA36A5;">r1</span> =  MathTex(r<span style="color: #008000;">"""\frac{\lambda a_j}{\lambda a_k}=\frac{a_j}{a_k}\qquad</span>
<span style="color: #008000;">        \text{para todo}\; \lambda, j, k,\;</span>
<span style="color: #008000;">        \text{ si }\; a_k\ne0"""</span>,
                      tex_template = myTemplate).next_to(video1,
                                                         DOWN).scale(1)
        
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Como las componentes del vector</span>
<span style="color: #008000;">        son multiplicadas por un mismo valor, las proporciones entre</span>
<span style="color: #008000;">        las cordenadas no nulas se mantienen entre todos los</span>
<span style="color: #008000;">        m&#250;ltiplos."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.play(FadeIn(grp3))
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration*2/5)
            <span style="color: #0000FF;">self</span>.play(FadeOut(grp3))           
            <span style="color: #0000FF;">self</span>.play(FadeIn(r1))
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""As&#237;, dada la interpretaci&#243;n del</span>
<span style="color: #008000;">        producto entre tres n&#250;meros vista anteriormente, los m&#250;ltiplos</span>
<span style="color: #008000;">        de un vector no nulo de R3 se corresponden con los puntos de</span>
<span style="color: #008000;">        una recta que pasa por el origen de coordenadas."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration)
            <span style="color: #0000FF;">self</span>.play(FadeOut(r1),
                      FadeOut(video1))

        <span style="color: #BA36A5;">resumen1</span> = Tex(_(r<span style="color: #008000;">"""El conjunto de m&#250;ltiplos de un vector no nulo de \R[3]"""</span>),
                       tex_template = myTemplate)
        <span style="color: #BA36A5;">resumen2</span> = Tex(_(r<span style="color: #008000;">"""se corresponde con una recta que pasa por el origen."""</span>),
                       tex_template = myTemplate).next_to(resumen1, DOWN)
            
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Por tanto, el conjunto de</span>
<span style="color: #008000;">        m&#250;ltiplos de cualquier vector no nulo de R 3 es una recta que</span>
<span style="color: #008000;">        pasa por el origen."""</span>)) <span style="color: #0000FF;">as</span> tracker:
            <span style="color: #0000FF;">self</span>.play(Write(resumen1),
                      run_time=tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(Write(resumen2),
                      run_time=tracker.duration/2)

            <span style="color: #0000FF;">self</span>.pausa_muy_corta()
            <span style="color: #0000FF;">self</span>.play(FadeOut(resumen1),
                      FadeOut(resumen2))

        <span style="color: #BA36A5;">titulo2</span> = Tex(_(<span style="color: #008000;">"Interpretaci&#243;n geom&#233;trica del producto en "</span>) + r<span style="color: #008000;">"$\R[n]$"</span>,
                       tex_template = myTemplate,
                       font_size=60).set_color(BLUE).to_edge(UP)

        <span style="color: #BA36A5;">resumenRn_1</span> = Tex(_(r<span style="color: #008000;">"""El conjunto de m&#250;ltiplos de un vector no nulo de \R[n]"""</span>),
                          tex_template = myTemplate)
        <span style="color: #BA36A5;">resumenRn_2</span> = Tex(_(r<span style="color: #008000;">"""se corresponde con una recta que pasa por el origen."""</span>),
                          tex_template = myTemplate).next_to(resumenRn_1, DOWN)
                
        <span style="color: #0000FF;">with</span> <span style="color: #0000FF;">self</span>.voiceover(text=_(<span style="color: #008000;">"""Reescalar un vector en R n</span>
<span style="color: #008000;">        mantiene la proporci&#243;n entre sus coordenadas. Aunque no</span>
<span style="color: #008000;">        podemos visualizar una recta en m&#225;s de tres dimensiones,</span>
<span style="color: #008000;">        abusando del lenguaje diremos que: los m&#250;ltiplos de un vector</span>
<span style="color: #008000;">        en R n se corresponden con una recta que pasa por el</span>
<span style="color: #008000;">        origen."""</span>)) <span style="color: #0000FF;">as</span> tracker:

            <span style="color: #0000FF;">self</span>.play(FadeOut(titulo))
            <span style="color: #0000FF;">self</span>.play(FadeIn(titulo2))
            <span style="color: #0000FF;">self</span>.pausa(tracker.duration/2)
            <span style="color: #0000FF;">self</span>.play(Write(resumenRn_1))
            <span style="color: #0000FF;">self</span>.play(Write(resumenRn_2))
            <span style="color: #0000FF;">self</span>.pausa(2)

</pre>
</div>
</div>
</div>
</div>
