L01_V04-ProductoDeUnVectorPorUnEscalar.org
* Trozos comunes de código

** Carga de la librería Manim y NacAL

#+name: Carga de la librería Manim y NacAL
#+BEGIN_SRC python :exports none :results discard
from manim import *
from manim_voiceover import VoiceoverScene
from manim_voiceover.services.gtts import GTTSService
import nacal as nc
import sympy as sp

# PARA LA TRADUCCIÓN (pero no sé generar los vídeos traducidos)
from manim_voiceover.translate import get_gettext
# It is good practice to get the LOCALE and DOMAIN from environment variables
import os
LOCALE = os.getenv("LOCALE")
DOMAIN = os.getenv("DOMAIN")
# The following function uses LOCALE and DOMAIN to set the language, and
# returns a gettext function that is used to insert translations.
_ = get_gettext()
#+END_SRC


#+name: Carga de la librería Manim y NacAL con AzureService
#+BEGIN_SRC python :results discard
from manim import *
from manim_voiceover import VoiceoverScene
from manim_voiceover.services.azure import AzureService
import nacal as nc
import sympy as sp
# PARA LA TRADUCCIÓN (pero no sé generar los vídeos traducidos)
from manim_voiceover.translate import get_gettext
# It is good practice to get the LOCALE and DOMAIN from environment variables
import os
LOCALE = os.getenv("LOCALE")
DOMAIN = os.getenv("DOMAIN")
# The following function uses LOCALE and DOMAIN to set the language, and
# returns a gettext function that is used to insert translations.
_ = get_gettext()
#+END_SRC

#+RESULTS: Carga de la librería Manim y NacAL con AzureService

** Definición de algunas subclases con definiciones generales 
  :PROPERTIES:  
  :UNNUMBERED: t  
  :END:  

#+name: Definición de mi escena con voz
#+BEGIN_SRC python :noweb no-export :results discard

class MiEscenaConVoz(VoiceoverScene):
    def pausa_muy_corta(self, n=0.3):
        self.wait(n)
    def pausa_corta(self, n=0.5):
        self.wait(n)
    def pausa(self, n=1):
        self.wait(n)
    def pausa_media(self, n=1.5):
        self.wait(n)
    def pausa_larga(self, n=3):
        self.wait(n)
    def pausa_muy_larga(self, n=5):
        self.wait(n)

    <<Créditos en distintas partes de la pantalla>>
         
#+END_SRC

#    por    = MathTex(r"\cdot")
#    igual  = MathTex("=")
#    donde  = Tex("donde")
#    pycoma = Tex(";")


#+name: Créditos en distintas partes de la pantalla
#+BEGIN_SRC python :results discard
def creditos(self, variante=1):
    def analisis_opcion_elegida(tipo):
        'Análisis de las opciones de eliminación elegidas'
        lista = [100,20,10,4,2,1]
        opcion = set()
        for t in lista:
            if (tipo - (tipo % t)) in lista:
                opcion.add(tipo - (tipo % t))
                tipo = tipo % t
        return opcion    
    copyright = Tex(r"\textcopyright{\;} 2025\; Marcos Bujosa  ")
    if 1 in analisis_opcion_elegida(variante):
        stampDcha  = VGroup(copyright.copy()).rotate( PI/2).scale(0.5).to_edge(RIGHT, buff=0.1).set_color(GRAY_D)
        self.add(stampDcha)
    if 2 in analisis_opcion_elegida(variante):
        stampIzda  = VGroup(copyright.copy()).rotate(-PI/2).scale(0.5).to_edge(LEFT, buff=0.1).set_color(GRAY_D)
        self.add(stampIzda)
    if 4 in analisis_opcion_elegida(variante):
        stampBottom= VGroup(copyright.copy()).rotate(    0).scale(0.5).to_edge(DOWN, buff=0.1).set_color(GRAY_D)
        self.add(stampBottom)
    if 10 in analisis_opcion_elegida(variante):
        stampTop   = VGroup(copyright.copy()).rotate(    0).scale(0.5).to_edge(  UP, buff=0.1).set_color(GRAY_D)
        self.add(stampTop)
        
#+END_SRC

# ** Creditos

#+name: copyright
#+BEGIN_SRC python :noweb tangle :results discard
class ZCreditos(Scene):
    def construct(self):
        copyright = Tex(r"\textcopyright{\;} 2025 \; Marcos Bujosa")
        github = Tex(r"\texttt{https://github.com/mbujosab}").next_to(copyright, DOWN)
        CGG  = VGroup(copyright,github).scale(1.1)
        self.add(CGG)
        self.wait(10)
#+END_SRC

# +call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="4")

# +call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="4")

# +call: montandoHD(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

# +call: fade(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

