L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-org8dfedca" class="outline-4">
<h4 id="org8dfedca">Definición Vectores en R2 y R3</h4>
<div class="outline-text-4" id="text-org8dfedca">
<p>
Estas clases definen vectores en \(\R[2]\) y \(\R[3]\) para ser representados con dibujos.
</p>

<div class="org-src-container">
<pre class="src src-python" id="org35e5a90">
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">VectorR2</span>():
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">__init__</span>(<span style="color: #0000FF;">self</span>, lista, rpr=<span style="color: #008000;">'c'</span>, color=GRAY_B):
        <span style="color: #036A07;">"""Inicializa un Vector con una lista"""</span>
        <span style="color: #BA36A5;">coords</span> = lista + [0] <span style="color: #0000FF;">if</span> <span style="color: #006FE0;">len</span>(lista)&lt;3 <span style="color: #0000FF;">else</span> lista        
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">color</span>  = color
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.coords = tuple(coords)</span>
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.coords = tuple([float(i) for i in coords])</span>
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">coords</span> = <span style="color: #006FE0;">tuple</span>([<span style="color: #006FE0;">int</span>(i) <span style="color: #0000FF;">if</span> <span style="color: #006FE0;">float</span>(i)==<span style="color: #006FE0;">int</span>(i) <span style="color: #0000FF;">else</span> <span style="color: #006FE0;">float</span>(i) <span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> coords])
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">Vector</span> = nc.Vector(<span style="color: #0000FF;">self</span>.coords[:2], rpr)
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">tex</span>    = MathTex(<span style="color: #0000FF;">self</span>.Vector.latex(), color=<span style="color: #0000FF;">self</span>.color).scale(0.8)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">dot</span>(<span style="color: #0000FF;">self</span>, ejes, radio=0.08):
        <span style="color: #0000FF;">return</span> Dot(ejes.c2p(*<span style="color: #0000FF;">self</span>.coords), radius=radio, color=<span style="color: #0000FF;">self</span>.color)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">v_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> ejes.get_vertical_line(ejes.c2p(*<span style="color: #0000FF;">self</span>.coords), color=<span style="color: #0000FF;">self</span>.color)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">h_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> ejes.get_horizontal_line(ejes.c2p(*<span style="color: #0000FF;">self</span>.coords), color=<span style="color: #0000FF;">self</span>.color)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">arrow</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> ejes.get_vector(<span style="color: #0000FF;">self</span>.Vector.lista, stroke_color = <span style="color: #0000FF;">self</span>.color, stroke_width=4)
        
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python" id="org54667a8">
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">VectorR3</span>():
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">__init__</span>(<span style="color: #0000FF;">self</span>, lista, rpr=<span style="color: #008000;">'c'</span>, color=GRAY_B):
        <span style="color: #036A07;">"""Inicializa un Vector con una lista"""</span>
        <span style="color: #BA36A5;">coords</span> = lista + [0] <span style="color: #0000FF;">if</span> <span style="color: #006FE0;">len</span>(lista)&lt;3 <span style="color: #0000FF;">else</span> lista
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">color</span>  = color
        <span style="color: #8D8D84;">#</span><span style="color: #8D8D84; font-style: italic;">self.coords = tuple(coords)</span>
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">coords</span> = <span style="color: #006FE0;">tuple</span>([<span style="color: #006FE0;">int</span>(i) <span style="color: #0000FF;">if</span> <span style="color: #006FE0;">float</span>(i)==<span style="color: #006FE0;">int</span>(i) <span style="color: #0000FF;">else</span> <span style="color: #006FE0;">float</span>(i) <span style="color: #0000FF;">for</span> i <span style="color: #0000FF;">in</span> coords])
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">Vector</span> = nc.Vector(<span style="color: #0000FF;">self</span>.coords, rpr)
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">tex</span>    = MathTex(<span style="color: #0000FF;">self</span>.Vector.latex(), color=<span style="color: #0000FF;">self</span>.color).scale(0.8)
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">proyXY</span> = <span style="color: #0000FF;">self</span>.coords[:-1] + (0,)
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">proyZ</span>  = (0,0,) + (<span style="color: #0000FF;">self</span>.coords[-1],)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">dot</span>(<span style="color: #0000FF;">self</span>, ejes, radio=0.08):
        <span style="color: #0000FF;">return</span> Dot3D(ejes.c2p(*<span style="color: #0000FF;">self</span>.coords), radius=radio, color=<span style="color: #0000FF;">self</span>.color)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">x_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> ejes.get_vertical_line(ejes.c2p(*<span style="color: #0000FF;">self</span>.proyXY), color=<span style="color: #0000FF;">self</span>.color)
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">y_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> ejes.get_horizontal_line(ejes.c2p(*<span style="color: #0000FF;">self</span>.proyXY), color=<span style="color: #0000FF;">self</span>.color)
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">z_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> Line3D(start=ejes.c2p(*<span style="color: #0000FF;">self</span>.proyZ), end=ejes.c2p(*<span style="color: #0000FF;">self</span>.coords), thickness=0.01)
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">v_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> Line3D(start=ejes.c2p(*<span style="color: #0000FF;">self</span>.proyXY), end=ejes.c2p(*<span style="color: #0000FF;">self</span>.coords), thickness=0.01)
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">xy_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> Line3D(start=np.array([0,0,0]), end=ejes.c2p(*<span style="color: #0000FF;">self</span>.proyXY), thickness=0.01)
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">proy_x_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> ejes.get_horizontal_line(ejes.c2p(*<span style="color: #0000FF;">self</span>.proyXY), color=<span style="color: #0000FF;">self</span>.color)
    
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">proy_y_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> ejes.get_horizontal_line(ejes.c2p(*<span style="color: #0000FF;">self</span>.coords), color=<span style="color: #0000FF;">self</span>.color)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">proy_y_line</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> Line3D(start=ejes.c2p(*<span style="color: #0000FF;">self</span>.proyZ), end=ejes.c2p(*<span style="color: #0000FF;">self</span>.coords), thickness=0.01)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">arrow</span>(<span style="color: #0000FF;">self</span>, ejes):
        <span style="color: #0000FF;">return</span> Arrow3D(
            start=np.array([0, 0, 0]),
            end=np.array(ejes.c2p(*<span style="color: #0000FF;">self</span>.coords)),
            resolution=8,
            color = <span style="color: #0000FF;">self</span>.color )

</pre>
</div>
</div>
</div>
