L01_V04-ProductoDeUnVectorPorUnEscalar.org
*** Insertar un vídeo en una escena

#+name: Definición de VideoStatus y VideoMobject
#+BEGIN_SRC python :results discard
import cv2 # needs opencv-python https://pypi.org/project/opencv-python/
from PIL import Image, ImageOps
from dataclasses import dataclass

@dataclass
class VideoStatus:
    time: float = 0
    videoObject: cv2.VideoCapture = None
    def __deepcopy__(self, memo):
        return self

class VideoMobject(ImageMobject):
    '''
    Following a discussion on Discord about animated GIF images.
    Modified for videos

    Parameters
    ----------
    filename
        the filename of the video file

    imageops
        (optional) possibility to include a PIL.ImageOps operation, e.g.
        PIL.ImageOps.mirror

    speed
        (optional) speed-up/slow-down the playback

    loop
        (optional) replay the video from the start in an endless loop

    https://discord.com/channels/581738731934056449/1126245755607339250/1126245755607339250
    2023-07-06 Uwe Zimmermann & Abulafia
    2024-03-09 Uwe Zimmermann
    '''
    def __init__(self, filename=None, imageops=None, speed=1.0, loop=False, **kwargs):
        self.filename = filename
        self.imageops = imageops
        self.speed    = speed
        self.loop     = loop
        self._id = id(self)
        self.status = VideoStatus()
        self.status.videoObject = cv2.VideoCapture(filename)

        self.status.videoObject.set(cv2.CAP_PROP_POS_FRAMES, 1)
        ret, frame = self.status.videoObject.read()
        if ret:
            frame = cv2.cvtColor(frame, cv2.COLOR_BGR2RGB)            
            img = Image.fromarray(frame)

            if imageops != None:
                img = imageops(img)
        else:
            img = Image.fromarray(np.uint8([[63, 0, 0, 0],
                                        [0, 127, 0, 0],
                                        [0, 0, 191, 0],
                                        [0, 0, 0, 255]
                                        ]))
        super().__init__(img, **kwargs)
        if ret:
            self.add_updater(self.videoUpdater)

    def videoUpdater(self, mobj, dt):
        if dt == 0:
            return
        status = self.status
        status.time += 1000*dt*mobj.speed
        self.status.videoObject.set(cv2.CAP_PROP_POS_MSEC, status.time)
        ret, frame = self.status.videoObject.read()
        if (ret == False) and self.loop:
            status.time = 0
            self.status.videoObject.set(cv2.CAP_PROP_POS_MSEC, status.time)
            ret, frame = self.status.videoObject.read()
        if ret:
            frame = cv2.cvtColor(frame, cv2.COLOR_BGR2RGB)  # needed here?        
            img = Image.fromarray(frame)

            if mobj.imageops != None:
                img = mobj.imageops(img)
            mobj.pixel_array = change_to_rgba_array(
                np.asarray(img), mobj.pixel_array_dtype
            )

#+END_SRC


# +call: rodando(fichero="L01_V03_SumaDeVectores-I", escena="4")

# +call: rodandoHD(fichero="L01_V03_SumaDeVectores-I", escena="4")

# +call: montandoHD(video="L01_V03_SumaDeVectores-I")

# +call: fade(video="L01_V03_SumaDeVectores-I")

*** Mover miniescenas a un subdirectorio auxiliar

#+call: mover(fichero="L01_V04_E03_ProductoEnR3_3D.mp4")
#+call: mover(fichero="L01_V03_E03_SumaEnRn_3D.mp4")

#+name: mover
#+BEGIN_SRC bash :var fichero="L01_V04_E03_ProductoEnR3_3D.mp4" :dir /home/marcos/SynologyDrive/ReposGH/Docencia/VideosMates2/lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/ :results silent
mkdir -p /home/marcos/SynologyDrive/ReposGH/Docencia/VideosMates2/lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/aux_movie_files
mv $fichero aux_movie_files/
#+END_SRC

#+call: moverHD(fichero="L01_V04_E03_ProductoEnR3_3D.mp4")
#+call: moverHD(fichero="L01_V03_E03_SumaEnRn_3D.mp4")

#+name: moverHD
#+BEGIN_SRC bash :var fichero="L01_V04_E03_ProductoEnR3_3D.mp4" :dir /home/marcos/CloudStation/ReposGH/Docencia/VideosMates2/lib/media/videos/L01_V03_SumaDeVectores-II/1080p60/ :results silent
mv $fichero aux_movie_files/
#+END_SRC

*** COMMENT Código obtener subíndices de caracteres en expresiones

Este código indexa los elementos de expresiones en \LaTeX para
facilitar la transformación de una expresión en otra mediante la
transformación de unos elementos en otros.

#+name: Obtención de subíndices de caracteres en expresiones
#+BEGIN_SRC python  :results discard

import itertools
def get_sub_indexes(tex):
    ni = VGroup()
    colors = itertools.cycle([RED,TEAL,GREEN,BLUE,PURPLE])
    for i in range(len(tex)):
        n = Text(f"{i}",color=next(colors)).scale(0.7)
        n.next_to(tex[i],DOWN,buff=0.01)
        ni.add(n)
    return ni

#+END_SRC



* Rodando: 1,2,3\dots ¡acción!


#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="1,2,4,5,6")

# +call: FusionSumaR3()

# +call: FusionSumaRn()

#+call: montando(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

#+call: fade(video="L01_V04_ProductoDeUnVectorPorUnEscalar")


#+call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="1,2,3,4,5,6,7,8")

# +call: FusionSumaR3_HD()

# +call: FusionSumaRn_HD()

#+call: montandoHD(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

#+call: fade(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

**** Generamos un fichero ~mpeg~ por cada escena

- Versión de poca calidad:

#+call: rodando(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="1,2")

#+name: rodando
#+BEGIN_SRC bash :var fichero="L01_V04_ProductoDeUnVectorPorUnEscalar" :var escena="1" :dir /home/marcos/CloudStation/ReposGH/Docencia/VideosMates2/lib :results silent
echo $escena | manim -pql $fichero.py --disable_caching
#+END_SRC

- Versión con calidad HD1080:

#+call: rodandoHD(fichero="L01_V04_ProductoDeUnVectorPorUnEscalar", escena="1,2")

#+name: rodandoHD
#+BEGIN_SRC bash :var fichero="L01_V04_ProductoDeUnVectorPorUnEscalar" :var escena="1" :dir /home/marcos/CloudStation/ReposGH/Docencia/VideosMates2/lib :results silent
echo $escena | manim -qh $fichero.py --disable_caching
#+END_SRC

