L01_V04-ProductoDeUnVectorPorUnEscalar.html
<div id="outline-container-orgb7a6c6e" class="outline-4">
<h4 id="orgb7a6c6e">Insertar un vídeo en una escena</h4>
<div class="outline-text-4" id="text-orgb7a6c6e">
<div class="org-src-container">
<pre class="src src-python" id="org1d254d6"><span style="color: #0000FF;">import</span> cv2 <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">needs opencv-python https://pypi.org/project/opencv-python/</span>
<span style="color: #0000FF;">from</span> PIL <span style="color: #0000FF;">import</span> Image, ImageOps
<span style="color: #0000FF;">from</span> dataclasses <span style="color: #0000FF;">import</span> dataclass

<span style="color: #6434A3;">@dataclass</span>
<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">VideoStatus</span>:
    <span style="color: #BA36A5;">time</span>: <span style="color: #006FE0;">float</span> = 0
    <span style="color: #BA36A5;">videoObject</span>: cv2.VideoCapture = <span style="color: #D0372D;">None</span>
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">__deepcopy__</span>(<span style="color: #0000FF;">self</span>, memo):
        <span style="color: #0000FF;">return</span> <span style="color: #0000FF;">self</span>

<span style="color: #0000FF;">class</span> <span style="color: #6434A3;">VideoMobject</span>(ImageMobject):
    <span style="color: #036A07;">'''</span>
<span style="color: #036A07;">    Following a discussion on Discord about animated GIF images.</span>
<span style="color: #036A07;">    Modified for videos</span>

<span style="color: #036A07;">    Parameters</span>
<span style="color: #036A07;">    ----------</span>
<span style="color: #036A07;">    filename</span>
<span style="color: #036A07;">        the filename of the video file</span>

<span style="color: #036A07;">    imageops</span>
<span style="color: #036A07;">        (optional) possibility to include a PIL.ImageOps operation, e.g.</span>
<span style="color: #036A07;">        PIL.ImageOps.mirror</span>

<span style="color: #036A07;">    speed</span>
<span style="color: #036A07;">        (optional) speed-up/slow-down the playback</span>

<span style="color: #036A07;">    loop</span>
<span style="color: #036A07;">        (optional) replay the video from the start in an endless loop</span>

<span style="color: #036A07;">    https://discord.com/channels/581738731934056449/1126245755607339250/1126245755607339250</span>
<span style="color: #036A07;">    2023-07-06 Uwe Zimmermann &amp; Abulafia</span>
<span style="color: #036A07;">    2024-03-09 Uwe Zimmermann</span>
<span style="color: #036A07;">    '''</span>
    <span style="color: #0000FF;">def</span> <span style="color: #006699;">__init__</span>(<span style="color: #0000FF;">self</span>, filename=<span style="color: #D0372D;">None</span>, imageops=<span style="color: #D0372D;">None</span>, speed=1.0, loop=<span style="color: #D0372D;">False</span>, **kwargs):
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">filename</span> = filename
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">imageops</span> = imageops
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">speed</span>    = speed
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">loop</span>     = loop
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">_id</span> = <span style="color: #006FE0;">id</span>(<span style="color: #0000FF;">self</span>)
        <span style="color: #0000FF;">self</span>.<span style="color: #BA36A5;">status</span> = VideoStatus()
        <span style="color: #0000FF;">self</span>.status.<span style="color: #BA36A5;">videoObject</span> = cv2.VideoCapture(filename)

        <span style="color: #0000FF;">self</span>.status.videoObject.<span style="color: #006FE0;">set</span>(cv2.CAP_PROP_POS_FRAMES, 1)
        <span style="color: #BA36A5;">ret</span>, <span style="color: #BA36A5;">frame</span> = <span style="color: #0000FF;">self</span>.status.videoObject.read()
        <span style="color: #0000FF;">if</span> ret:
            <span style="color: #BA36A5;">frame</span> = cv2.cvtColor(frame, cv2.COLOR_BGR2RGB)            
            <span style="color: #BA36A5;">img</span> = Image.fromarray(frame)

            <span style="color: #0000FF;">if</span> imageops != <span style="color: #D0372D;">None</span>:
                <span style="color: #BA36A5;">img</span> = imageops(img)
        <span style="color: #0000FF;">else</span>:
            <span style="color: #BA36A5;">img</span> = Image.fromarray(np.uint8([[63, 0, 0, 0],
                                        [0, 127, 0, 0],
                                        [0, 0, 191, 0],
                                        [0, 0, 0, 255]
                                        ]))
        <span style="color: #006FE0;">super</span>().__init__(img, **kwargs)
        <span style="color: #0000FF;">if</span> ret:
            <span style="color: #0000FF;">self</span>.add_updater(<span style="color: #0000FF;">self</span>.videoUpdater)

    <span style="color: #0000FF;">def</span> <span style="color: #006699;">videoUpdater</span>(<span style="color: #0000FF;">self</span>, mobj, dt):
        <span style="color: #0000FF;">if</span> dt == 0:
            <span style="color: #0000FF;">return</span>
        <span style="color: #BA36A5;">status</span> = <span style="color: #0000FF;">self</span>.status
        status.<span style="color: #BA36A5;">time</span> += 1000*dt*mobj.speed
        <span style="color: #0000FF;">self</span>.status.videoObject.<span style="color: #006FE0;">set</span>(cv2.CAP_PROP_POS_MSEC, status.time)
        <span style="color: #BA36A5;">ret</span>, <span style="color: #BA36A5;">frame</span> = <span style="color: #0000FF;">self</span>.status.videoObject.read()
        <span style="color: #0000FF;">if</span> (ret == <span style="color: #D0372D;">False</span>) <span style="color: #0000FF;">and</span> <span style="color: #0000FF;">self</span>.loop:
            status.<span style="color: #BA36A5;">time</span> = 0
            <span style="color: #0000FF;">self</span>.status.videoObject.<span style="color: #006FE0;">set</span>(cv2.CAP_PROP_POS_MSEC, status.time)
            <span style="color: #BA36A5;">ret</span>, <span style="color: #BA36A5;">frame</span> = <span style="color: #0000FF;">self</span>.status.videoObject.read()
        <span style="color: #0000FF;">if</span> ret:
            <span style="color: #BA36A5;">frame</span> = cv2.cvtColor(frame, cv2.COLOR_BGR2RGB)  <span style="color: #8D8D84;"># </span><span style="color: #8D8D84; font-style: italic;">needed here?        </span>
            <span style="color: #BA36A5;">img</span> = Image.fromarray(frame)

            <span style="color: #0000FF;">if</span> mobj.imageops != <span style="color: #D0372D;">None</span>:
                <span style="color: #BA36A5;">img</span> = mobj.imageops(img)
            mobj.<span style="color: #BA36A5;">pixel_array</span> = change_to_rgba_array(
                np.asarray(img), mobj.pixel_array_dtype
            )

</pre>
</div>
</div>
</div>
<div id="outline-container-orgef83ad2" class="outline-4">
<h4 id="orgef83ad2">Mover miniescenas a un subdirectorio auxiliar</h4>
<div class="outline-text-4" id="text-orgef83ad2">
<div class="org-src-container">
<pre class="src src-bash" id="orgc87ca01">mkdir -p /home/marcos/SynologyDrive/ReposGH/Docencia/VideosMates2/lib/media/videos/L01_V04_ProductoDeUnVectorPorUnEscalar/480p15/aux_movie_files
mv $<span style="color: #BA36A5;">fichero</span> aux_movie_files/
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash" id="orga14f448">mv $<span style="color: #BA36A5;">fichero</span> aux_movie_files/
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org2316e75" class="outline-2">
<h2 id="org2316e75"><span class="section-number-2">3.</span> Rodando: 1,2,3&hellip; ¡acción!</h2>
<div class="outline-text-2" id="text-3">
</div>
<ol class="org-ol">
<li><a id="orgd6a8ef9"></a>Generamos un fichero <code>mpeg</code> por cada escena<br />
<div class="outline-text-5" id="text-3-0-0-1">
<ul class="org-ul">
<li>Versión de poca calidad:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash" id="org51cae23"><span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">escena</span> | manim -pql $<span style="color: #BA36A5;">fichero</span>.py --disable_caching
</pre>
</div>

<ul class="org-ul">
<li>Versión con calidad HD1080:</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash" id="orge2cfb48"><span style="color: #006FE0;">echo</span> $<span style="color: #BA36A5;">escena</span> | manim -qh $<span style="color: #BA36A5;">fichero</span>.py --disable_caching
</pre>
</div>
</div>
</li>
