L01_V04-ProductoDeUnVectorPorUnEscalar.org
**** Concatenamos las escenas en un único fichero ~mpeg~ y añadimos música de fondo.

- Montando la versión de baja resolución

#+call: montando(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

#+name: montando
#+BEGIN_SRC bash  :var subdir="lib/media/videos" :var video="L01_V04_ProductoDeUnVectorPorUnEscalar" :var calidad="480p15"  :var music="music/3Blue1Brown-Zeta-X3" :results silent
ln -s -f "$(pwd)/$subdir/ZCreditos/$calidad/ZCreditos.mp4" "$(pwd)/$subdir/$video/$calidad/ZCreditos.mp4"
rm -f $subdir/$video/$calidad/$video.mp4 list.txt
for f in $subdir/$video/$calidad/*.mp4; do echo file \'$f\' >> list.txt; done
ffmpeg -f concat -safe 0 -i list.txt -c copy $subdir/$video/$calidad/$video.mp4
mkdir -p tmp
ffmpeg -i $subdir/$video/$calidad/$video.mp4 -i $music.mp3  -filter_complex "[0:a]apad[main]; [1:a]volume=0.04,apad[A]; [main][A]amerge[out]" -c:v libx264 -c:a aac -map 0:v -map "[out]" -preset ultrafast -threads 0 -profile:v baseline -ac 2 -pix_fmt yuv420p -shortest -y tmp/$video.mp4
#+END_SRC

- Montando la versión de resolución HD1080

#+call: montandoHD(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

#+name: montandoHD
#+BEGIN_SRC bash  :var subdir="lib/media/videos" :var video="L01_V04_ProductoDeUnVectorPorUnEscalar" :var calidad="1080p60" :var music="music/3Blue1Brown-Zeta-X3" :results silent
ln -s -f "$(pwd)/$subdir/ZCreditos/$calidad/ZCreditos.mp4" "$(pwd)/$subdir/$video/$calidad/ZCreditos.mp4"
rm -f $subdir/$video/$calidad/$video.mp4 list.txt
for f in $subdir/$video/$calidad/*.mp4 ; do echo file \'$f\' >> list.txt; done
ffmpeg -f concat -safe 0 -i list.txt -c copy $subdir/$video/$calidad/$video.mp4
mkdir -p tmp
ffmpeg -i $subdir/$video/$calidad/$video.mp4 -i $music.mp3 -filter_complex "[0:a]apad[main]; [1:a]volume=0.04,apad[A]; [main][A]amerge[out]" -c:v libx264 -c:a aac -map 0:v -map "[out]" -preset medium -tune stillimage -threads 0 -profile:v baseline -ac 2 -pix_fmt yuv420p -shortest -y tmp/$video.mp4
#+END_SRC

**** Fundimos a negro los últimos segundos del vídeo (y la música).

#+call: fade(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

#+name: fade
#+BEGIN_SRC bash :var video="L01_Vectores" :results silent
dur=$(ffprobe -loglevel error -show_entries format=duration -of default=nk=1:nw=1 "tmp/$video.mp4")
offset=$(bc -l <<< "$dur"-7)
ffmpeg -i "tmp/$video.mp4" \
       -filter_complex "[0:v]fade=type=in:duration=0,fade=type=out:duration=6:start_time='$offset'[v];[0:a]afade=type=in:duration=1,afade=type=out:duration=6:start_time='$offset'[a]" \
       -map "[v]" -map "[a]" -y $video.mp4
#+END_SRC

**** Traducción

#+call: translate(escena="L01_V04_E01_ProductoPorEscalares")
#+call: translate(escena="L01_V04_E02_InterpretacionGeometricaDelProducto")

#+name: translate
#+BEGIN_SRC bash :dir ./lib :results silent :var fichero="L01_V04_ProductoDeUnVectorPorUnEscalar" :var escena="L01_V04_E01_ProductoPorEscalares" 
xgettext -o locale/$fichero.pot $fichero.py

msginit -i locale/$fichero.pot -o locale/en/LC_MESSAGES/$fichero.po --locale=es --no-translator

manim_translate -s es -t en -d $fichero -l locale $fichero.py

manim_render_translation $fichero.py -s $escena -d $fichero -l en
#+END_SRC

#+BEGIN_SRC sh :dir lib :var fichero="L01_V04_ProductoDeUnVectorPorUnEscalar" :var escena="L01_V04_E01_ProductoPorEscalares"
manim_render_translation $fichero.py -s $escena -d $fichero -l en -ql
#+END_SRC

#+RESULTS:
: Rendering L01_V04_E01_ProductoPorEscalares in en...


**** COMMENT Copiamos el resultado a un lugar público

#+call: publicar(video="L01_V04_ProductoDeUnVectorPorUnEscalar")

#+name: publicar
#+BEGIN_SRC sh :var subdir="/home/marcos/CloudStation/Nextcloud/pub/Mates2Videos" :var video="L01_Vectores"  :results silent
cp -f $video.mp4 $subdir/$video.mp4
#+END_SRC


