L01_V04-ProductoDeUnVectorPorUnEscalar.html
<li><a id="org5a064e0"></a>Concatenamos las escenas en un único fichero <code>mpeg</code> y añadimos música de fondo.<br />
<div class="outline-text-5" id="text-3-0-0-2">
<ul class="org-ul">
<li>Montando la versión de baja resolución</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash" id="org1a9ae22">ln -s -f <span style="color: #008000;">"$(</span><span style="color: #FF1493;">pwd</span><span style="color: #008000;">)/$subdir/ZCreditos/$calidad/ZCreditos.mp4"</span> <span style="color: #008000;">"$(</span><span style="color: #FF1493;">pwd</span><span style="color: #008000;">)/$subdir/$video/$calidad/ZCreditos.mp4"</span>
rm -f $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4 list.txt
<span style="color: #0000FF;">for</span> f<span style="color: #0000FF;"> in</span> $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/*.mp4; <span style="color: #0000FF;">do </span><span style="color: #006FE0;">echo</span> file <span style="color: #008000;">\'</span>$<span style="color: #BA36A5;">f</span><span style="color: #008000;">\'</span> &gt;&gt; list.txt; <span style="color: #0000FF;">done</span>
ffmpeg -f concat -safe 0 -i list.txt -c copy $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4
mkdir -p tmp
ffmpeg -i $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4 -i $<span style="color: #BA36A5;">music</span>.mp3  -filter_complex <span style="color: #008000;">"[0:a]apad[main]; [1:a]volume=0.04,apad[A]; [main][A]amerge[out]"</span> -c:v libx264 -c:a aac -map 0:v -map <span style="color: #008000;">"[out]"</span> -preset ultrafast -threads 0 -profile:v baseline -ac 2 -pix_fmt yuv420p -shortest -y tmp/$<span style="color: #BA36A5;">video</span>.mp4
</pre>
</div>

<ul class="org-ul">
<li>Montando la versión de resolución HD1080</li>
</ul>

<div class="org-src-container">
<pre class="src src-bash" id="org76e873e">ln -s -f <span style="color: #008000;">"$(</span><span style="color: #FF1493;">pwd</span><span style="color: #008000;">)/$subdir/ZCreditos/$calidad/ZCreditos.mp4"</span> <span style="color: #008000;">"$(</span><span style="color: #FF1493;">pwd</span><span style="color: #008000;">)/$subdir/$video/$calidad/ZCreditos.mp4"</span>
rm -f $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4 list.txt
<span style="color: #0000FF;">for</span> f<span style="color: #0000FF;"> in</span> $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/*.mp4 ; <span style="color: #0000FF;">do </span><span style="color: #006FE0;">echo</span> file <span style="color: #008000;">\'</span>$<span style="color: #BA36A5;">f</span><span style="color: #008000;">\'</span> &gt;&gt; list.txt; <span style="color: #0000FF;">done</span>
ffmpeg -f concat -safe 0 -i list.txt -c copy $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4
mkdir -p tmp
ffmpeg -i $<span style="color: #BA36A5;">subdir</span>/$<span style="color: #BA36A5;">video</span>/$<span style="color: #BA36A5;">calidad</span>/$<span style="color: #BA36A5;">video</span>.mp4 -i $<span style="color: #BA36A5;">music</span>.mp3 -filter_complex <span style="color: #008000;">"[0:a]apad[main]; [1:a]volume=0.04,apad[A]; [main][A]amerge[out]"</span> -c:v libx264 -c:a aac -map 0:v -map <span style="color: #008000;">"[out]"</span> -preset medium -tune stillimage -threads 0 -profile:v baseline -ac 2 -pix_fmt yuv420p -shortest -y tmp/$<span style="color: #BA36A5;">video</span>.mp4
</pre>
</div>
</div>
</li>
<li><a id="orgff193e2"></a>Fundimos a negro los últimos segundos del vídeo (y la música).<br />
<div class="outline-text-5" id="text-3-0-0-3">
<div class="org-src-container">
<pre class="src src-bash" id="org7a256e7"><span style="color: #BA36A5;">dur</span>=$(<span style="color: #FF1493;">ffprobe -loglevel error -show_entries format=duration -of default=nk=1:nw=1 "tmp/$video.mp4"</span>)
<span style="color: #BA36A5;">offset</span>=$(<span style="color: #FF1493;">bc -l &lt;&lt;&lt; "$dur"-7</span>)
ffmpeg -i <span style="color: #008000;">"tmp/$video.mp4"</span> <span style="color: #008000;">\</span>
       -filter_complex <span style="color: #008000;">"[0:v]fade=type=in:duration=0,fade=type=out:duration=6:start_time='$offset'[v];[0:a]afade=type=in:duration=1,afade=type=out:duration=6:start_time='$offset'[a]"</span> <span style="color: #008000;">\</span>
       -map <span style="color: #008000;">"[v]"</span> -map <span style="color: #008000;">"[a]"</span> -y $<span style="color: #BA36A5;">video</span>.mp4
</pre>
</div>
</div>
</li>
<li><a id="org8fc013a"></a>Traducción<br />
<div class="outline-text-5" id="text-3-0-0-4">
<div class="org-src-container">
<pre class="src src-bash" id="orgf95a50a">xgettext -o locale/$<span style="color: #BA36A5;">fichero</span>.pot $<span style="color: #BA36A5;">fichero</span>.py

msginit -i locale/$<span style="color: #BA36A5;">fichero</span>.pot -o locale/en/LC_MESSAGES/$<span style="color: #BA36A5;">fichero</span>.po --locale=es --no-translator

manim_translate -s es -t en -d $<span style="color: #BA36A5;">fichero</span> -l locale $<span style="color: #BA36A5;">fichero</span>.py

manim_render_translation $<span style="color: #BA36A5;">fichero</span>.py -s $<span style="color: #BA36A5;">escena</span> -d $<span style="color: #BA36A5;">fichero</span> -l en
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">manim_render_translation $<span style="color: #BA36A5;">fichero</span>.py -s $<span style="color: #BA36A5;">escena</span> -d $<span style="color: #BA36A5;">fichero</span> -l en -ql
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Marcos Bujosa</p>
<p class="date">Created: 2025-02-22 sáb 20:28</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
